Repository: TSLab-Dev/Handlers
Catalog: Properties/Resources.*.resx
Languages: ru

# SingleSeriesNumericalTheta.ShowNodes.Description
source: Nodes are shown when true
ru: При true будет показывать узлы на отображаемой линии

# SingleSeriesNumericalVega.ReturnPct.Name
source: Return Pct
ru: Расчет в процентах

# SingleSeriesNumericalVega.ReturnPct.Description
source: Values are calculated as percents
ru: При true результат будет вычислен в процентах

# SingleSeriesNumericalVega.ShowNodes.Name
source: Show nodes
ru: Показывать узлы

# SingleSeriesNumericalVega.ShowNodes.Description
source: Nodes are shown when true
ru: При true будет показывать узлы на отображаемой линии

# SingleSeriesPositionGrid.SigmaMult.Name
source: Width multiplier
ru: Множитель ширины

# SingleSeriesPositionGrid.SigmaMult.Description
source: Width multiplier
ru: Множитель ширины

# SingleSeriesPositionGrid.ShowNodes.Name
source: Show nodes
ru: Показывать узлы

# SingleSeriesPositionGrid.ShowNodes.Description
source: Nodes are shown when true
ru: При true будет показывать узлы на отображаемой линии

# SingleSeriesPositionList.SigmaMult.Name
source: Width multiplier
ru: Множитель ширины

# SingleSeriesPositionList.SigmaMult.Description
source: Width multiplier
ru: Множитель ширины

# SingleSeriesPositionList.ShowNodes.Name
source: Show nodes
ru: Показывать узлы

# SingleSeriesPositionList.ShowNodes.Description
source: Nodes are shown when true
ru: При true будет показывать узлы на отображаемой линии

# SmileImitation3.SigmaMult.Name
source: Width multiplier
ru: Множитель ширины

# SmileImitation3.SigmaMult.Description
source: Width multiplier
ru: Множитель ширины

# SmileImitation3.ShowNodes.Name
source: Show nodes
ru: Показывать узлы

# SmileImitation3.ShowNodes.Description
source: Nodes are shown when true
ru: При true будет показывать узлы на отображаемой линии

# SmileImitation5.SigmaMult.Name
source: Width multiplier
ru: Множитель ширины

# SmileImitation5.SigmaMult.Description
source: Width multiplier
ru: Множитель ширины

# SmileImitation5.ShowNodes.Name
source: Show nodes
ru: Показывать узлы

# SmileImitation5.ShowNodes.Description
source: Nodes are shown when true
ru: При true будет показывать узлы на отображаемой линии

# CentralStrike.SwitchRatioPct.Name
source: Switch Ratio Pct
ru: Процент для переключения

# CentralStrike.SwitchRatioPct.Description
source: Market should pass this percent of distance to next strike to switch central strike
ru: Процент движения к следующему страйку для переключения

# CentralStrike.StrikeStep.Name
source: Strike step
ru: Шаг страйков

# CentralStrike.StrikeStep.Description
source: Strike step to extract most important options
ru: Шаг страйков для выделения главных подсерий

# CentralStrike.DisplayUnits.Name
source: Display Units
ru: Единицы отображения

# CentralStrike.DisplayUnits.Description
source: Display units (hundreds, thousands, as is)
ru: Единицы отображения (сотни, тысячи, как есть)

# CentralStrike.DisplayPrice.Name
source: Display Price
ru: Цена для интерфейса

# CentralStrike.DisplayPrice.Description
source: Base asset price (only to display at UI)
ru: Цена БА (только для отображения в интерфейсе)

# IvOnF.RepeatLastIv.Name
source: Repeat Last IV
ru: Повтор значения

# IvOnF.RepeatLastIv.Description
source: Handler should repeat last known value to avoid further logic errors
ru: При true будет находить и использовать последнее известное значение

# AutoHedger.MinPeriod.Name
source: Period
ru: Период

# AutoHedger.MinPeriod.Description
source: Hedge period (seconds)
ru: Период хеджирования (секунды)

# BuyOptions.EntryShift.Name
source: Entry shift
ru: Сдвиг входа

# BuyOptions.EntryShift.Description
source: Entry shift to get lower buy price (price step)
ru: Сдвиг входа для уменьшения цены покупки (шаг цены)

# BuyOptions.ExitShift.Name
source: Exit shift
ru: Сдвиг выхода

# BuyOptions.ExitShift.Description
source: Exit shift to get quick execution (price step)
ru: Сдвиг выхода для быстрого закрытия позиции (шаг цены)

# NumericalDeltaOnF3.PrintDeltaInLog.Name
source: Print in Log
ru: Выводить в лог

# NumericalDeltaOnF3.PrintDeltaInLog.Description
source: Print delta in main log
ru: Выводить дельту в главный лог приложения

# PositionsManager.BlockTrading.Name
source: Block Trading
ru: Блокировать торговлю

# PositionsManager.BlockTrading.Description
source: When true trading is completely blocked to avoid user misclick errors
ru: При true торговля будет полностью блокирована, чтобы избежать случайных кликов по котировкам

# PositionsManager.DropVirtualPos.Name
source: Drop Virtual Positions
ru: Очистить виртуальные позиции

# PositionsManager.DropVirtualPos.Description
source: Drop virtual positions
ru: Очистить виртуальные позиции

# PositionsManager.UseGlobalCache.Name
source: Use Global Cache
ru: Использовать глобальный кеш

# PositionsManager.UseGlobalCache.Description
source: Use global cache
ru: Использовать глобальный кеш?

# SellOptions.OptionType.Name
source: Option type
ru: Тип опциона

# SellOptions.OptionType.Description
source: Limit trading to options of given type (call, put, both)
ru: Ограничение на тип торгуемого инструмента (колл, пут, котируются одновременно оба)

# SellOptions.FixedQty.Name
source: Order size
ru: Объём заявки

# SellOptions.FixedQty.Description
source: Order size
ru: Объём заявки

# SellOptions.EntryShift.Name
source: Entry shift
ru: Сдвиг входа

# SellOptions.EntryShift.Description
source: Entry shift to get higher sell price (price step)
ru: Сдвиг входа для увеличения цены продажи (шаг цены)

# SellOptions.ExitShift.Name
source: Exit shift
ru: Сдвиг выхода

# SellOptions.ExitShift.Description
source: Exit shift to get quick execution (price step)
ru: Сдвиг выхода для быстрого закрытия позиции (шаг цены)

# SellOptionGroup.OptionType.Name
source: Option type
ru: Тип опциона

# SellOptionGroup.OptionType.Description
source: Limit trading to options of given type (call, put, both)
ru: Ограничение на тип торгуемого инструмента (колл, пут, котируются одновременно оба)

# SellOptionGroup.FixedQty.Name
source: Order size
ru: Объём заявки

# SellOptionGroup.FixedQty.Description
source: Order size
ru: Объём заявки

# SellOptionGroup.EntryShift.Name
source: Entry shift
ru: Сдвиг входа

# SellOptionGroup.EntryShift.Description
source: Entry shift to get higher sell price (price step)
ru: Сдвиг входа для увеличения цены продажи (шаг цены)

# SellOptionGroup.ExitShift.Name
source: Exit shift
ru: Сдвиг выхода

# SellOptionGroup.ExitShift.Description
source: Exit shift to get quick execution (price step)
ru: Сдвиг выхода для быстрого закрытия позиции (шаг цены)

# SellOptionGroup.StrikeStep.Name
source: Strike step
ru: Шаг страйков

# SellOptionGroup.StrikeStep.Description
source: Strike step to extract the most important options
ru: Шаг страйков для выделения главных подсерий

# SellOptionGroup.StrikeAmount.Name
source: Strike amount
ru: Количество страйков

# SellOptionGroup.StrikeAmount.Description
source: Strike amount to set your orders (up and down from the central strike)
ru: Количество страйков для котирования (в обе стороны от центрального страйка)

# SellOptionGroupDelta.FixedQty.Name
source: Order size
ru: Объём заявки

# SellOptionGroupDelta.FixedQty.Description
source: Order size
ru: Объём заявки

# SellOptionGroupDelta.EntryShift.Name
source: Entry shift
ru: Сдвиг входа

# SellOptionGroupDelta.EntryShift.Description
source: Entry shift to get higher sell price (price step)
ru: Сдвиг входа для увеличения цены продажи (шаг цены)

# SellOptionGroupDelta.ExitShift.Name
source: Exit shift
ru: Сдвиг выхода

# SellOptionGroupDelta.ExitShift.Description
source: Exit shift to get quick execution (price step)
ru: Сдвиг выхода для быстрого закрытия позиции (шаг цены)

# SellOptionGroupDelta.StrikeStep.Name
source: Strike step
ru: Шаг страйков

# SellOptionGroupDelta.StrikeStep.Description
source: Strike step to extract the most important options
ru: Шаг страйков для выделения главных подсерий

# SellOptionGroupDelta.MinDeltaPct.Name
source: Min delta, %
ru: Мин. дельта, %

# SellOptionGroupDelta.MinDeltaPct.Description
source: The lowest working delta we allow to quote (as percents)
ru: Минимальная рабочая дельта, которую мы согласны котировать (в процентах)

# SellOptionGroupDelta.MaxDeltaPct.Name
source: Max delta, %
ru: Макс. дельта, %

# SellOptionGroupDelta.MaxDeltaPct.Description
source: The highest working delta we allow to quote (as percents)
ru: Максимальная рабочая дельта, которую мы согласны котировать (в процентах)

# SellOptionGroupDelta.CheckAbsDelta.Name
source: Check absolute delta
ru: Проверять модуль дельты

# SellOptionGroupDelta.CheckAbsDelta.Description
source: Check absolute value of option's delta
ru: Флаг того, что дельту опционов следует проверять по модулю (без учета знака)

# TotalProfit.Name
source: Profit ATM (IntSer)
ru: Профит на деньгах (IntSer)

# TotalProfit.Description
source: Numerical estimate of profit at-the-money (only one point is processed using position profile)
ru: Численный расчет профита позиции в текущей точке БА (вычисляется одна точка по профилю позиции)

# TotalProfit.Profit.Name
source: Profit
ru: Профит

# TotalProfit.Profit.Description
source: Current position profit
ru: Текущий профит всей позиции

# TotalProfit.PrintProfitInLog.Name
source: Print in Log
ru: Выводить в лог

# TotalProfit.PrintProfitInLog.Description
source: Print profit in main log
ru: Выводить профит в главный лог приложения

# TotalProfit.ScaleMultiplier.Name
source: Scale multiplier
ru: Масштабный множитель

# TotalProfit.ScaleMultiplier.Description
source: Scale multiplier to convert profit from price units to money (i.e. dollars or euros)
ru: Масштабный множитель для пересчета единиц цен в деньги (например, в рубли или доллары)

# OptionSelector.BaseSecPrefix.Name
source: Base asset
ru: Базовый актив

# OptionSelector.BaseSecPrefix.Description
source: Select Base Asset (RI, Si, Eu, ES, ...)
ru: Выбор Базового Актива (RI, Si, Eu, ES, ...)

# OptionSelector.OptionSeries.Name
source: Option Series
ru: Опционная серия

# OptionSelector.OptionSeries.Description
source: Select option series (RIH5, SiG5, ESM6, ...)
ru: Выбор опционной серии (RIH5, SiG5, ESM6, ...)

# OptionSeriesSelector.Name
source: Option Series Selector
ru: Выбор серии из опциона

# OptionSeriesSelector.Description
source: Choose one of several option series from single OPTION source
ru: Выбор одной опционной серии из нескольких доступных в источнике ОПЦИОН

# OptionSeriesSelector.AliveOnly.Name
source: Alive Only
ru: Только живые

# OptionSeriesSelector.AliveOnly.Description
source: Handler will use only alive option series
ru: При true будет находить и использовать только живые серии

# OptionSeriesSelector.OptionSeries.Name
source: Option Series
ru: Опционная серия

# OptionSeriesSelector.OptionSeries.Description
source: Select option series (RIH5, SiG5, ESM6, ...)
ru: Выбор опционной серии (RIH5, SiG5, ESM6, ...)

# SeriesSelector.Name
source: Series Selector
ru: Выбор Серии

# SeriesSelector.Description
source: Choose one of several option series
ru: Выбор одной опционной серии из нескольких альтернатив

# SeriesSelector.AliveOnly.Name
source: Alive Only
ru: Только живые

# SeriesSelector.AliveOnly.Description
source: Handler will use only alive option series
ru: При true будет находить и использовать только живые серии

# SeriesSelector.OptionSeries.Name
source: Option Series
ru: Опционная серия

# SeriesSelector.OptionSeries.Description
source: Select option series (RIH5, SiG5, ESM6, ...)
ru: Выбор опционной серии (RIH5, SiG5, ESM6, ...)

# GetValueAtm.Name
source: Get Value ATM (IntSer)
ru: Значение на деньгах (IntSer)

# GetValueAtm.Description
source: Numerical estimate of value at-the-money (only one point of profile is returned)
ru: Численный расчет значения точки на-деньгах (вычисляется одна точка из профиля)

# GetValueAtm.Moneyness.Name
source: Moneyness
ru: Денежность

# GetValueAtm.Moneyness.Description
source: Moneyness
ru: Денежность

# GetValueAtm.Result.Name
source: Result
ru: Результат

# GetValueAtm.Result.Description
source: Value ATM
ru: Значение на-деньгах

# GetValueAtm.PrintInLog.Name
source: Print in Log
ru: Выводить в лог

# GetValueAtm.PrintInLog.Description
source: Print in main log
ru: Выводить в главный лог приложения

# IvOnF2.Description
source: Implied Volatility at-the-money
ru: Подразумеваемая волатильность на деньгах

# IvOnF2.RepeatLastIv.Name
source: Repeat Last IV
ru: Повтор значения

# IvOnF2.RepeatLastIv.Description
source: Handler should repeat last known value to avoid further logic errors
ru: При true будет находить и использовать последнее известное значение

# IvOnF2.ReturnPct.Name
source: Return Pct
ru: Расчет в процентах

# IvOnF2.ReturnPct.Description
source: Values are calculated as percents
ru: При true результат будет вычислен в процентах

# IvOnF2.ShowNodes.Name
source: Show Nodes
ru: Показывать узлы

# IvOnF2.ShowNodes.Description
source: Nodes are shown when true
ru: При true будет показывать узлы на отображаемой линии

# CloseVirtualFutPosition.FixedPx.Name
source: Fixed Price
ru: Фиксированная цена

# CloseVirtualFutPosition.FixedPx.Description
source: Exit price for virtual futures position
ru: Фиксированная цена закрытия фьючерсной позиции

# CloseVirtualFutPosition.TimeToLive.Name
source: Time to Live
ru: Время жизни

# CloseVirtualFutPosition.TimeToLive.Description
source: Position lifetime (in minutes)
ru: Время жизни позиции (в минутах)

# ExchangeTheorPx.Multiplier.Name
source: Multiplier
ru: Мультипликатор

# ExchangeTheorPx.Multiplier.Description
source: Price multiplier
ru: Мультипликатор цен

# ExchangeTheorPx.ShiftPx.Name
source: Shift
ru: Сдвиг цен

# ExchangeTheorPx.ShiftPx.Description
source: Price shift (price steps)
ru: Сдвиг цен (в шагах цены)

# ExchangeTheorSigma2.ReturnPct.Name
source: Return Pct
ru: В процентах

# ExchangeTheorSigma2.ReturnPct.Description
source: Return volatility as percents
ru: При true будет возвращать волатильность в процентах

# ExchangeTheorSigma2.OptionType.Name
source: Option Type
ru: Вид опционов

# ExchangeTheorSigma2.OptionType.Description
source: Option type (parameter Any is not recommended)
ru: Тип опционов (использование типа Any может привести к неожиданному поведению)

# ExchangeTheorSigma2.MultiplierPx.Name
source: Multiplier
ru: Мультипликатор

# ExchangeTheorSigma2.MultiplierPx.Description
source: Price multiplier
ru: Мультипликатор цен

# ExchangeTheorSigma2.ShiftPx.Name
source: Shift
ru: Сдвиг цен

# ExchangeTheorSigma2.ShiftPx.Description
source: Price shift (price steps)
ru: Сдвиг цен (в шагах цены)

# ExchangeTheorSigma2.ExpiryTime.Name
source: Expiry Time
ru: Время истечения

# ExchangeTheorSigma2.ExpiryTime.Description
source: Exact expiration time of day (HH:mm)
ru: Точное время экспирации (HH:mm)

# ExchangeTheorSigma3.ReturnPct.Name
source: Return Pct
ru: В процентах

# ExchangeTheorSigma3.ReturnPct.Description
source: Return volatility as percents
ru: При true будет возвращать волатильность в процентах

# ExchangeTheorSigma3.OptionType.Name
source: Option Type
ru: Вид опционов

# ExchangeTheorSigma3.OptionType.Description
source: Option type (parameter Any is not recommended)
ru: Тип опционов (использование типа Any может привести к неожиданному поведению)

# ExchangeTheorSigma3.MultiplierPx.Name
source: Multiplier
ru: Мультипликатор

# ExchangeTheorSigma3.MultiplierPx.Description
source: Price multiplier
ru: Мультипликатор цен

# ExchangeTheorSigma3.ShiftPx.Name
source: Shift
ru: Сдвиг цен

# ExchangeTheorSigma3.ShiftPx.Description
source: Price shift (price steps)
ru: Сдвиг цен (в шагах цены)

# ExchangeTheorSigma3.ExpiryTime.Name
source: Expiry Time
ru: Время истечения

# ExchangeTheorSigma3.ExpiryTime.Description
source: Exact expiration time of day (HH:mm)
ru: Точное время экспирации (HH:mm)

# ExchangeTheorSigma5.ReturnPct.Name
source: Return Pct
ru: В процентах

# ExchangeTheorSigma5.ReturnPct.Description
source: Return volatility as percents
ru: При true будет возвращать волатильность в процентах

# ExchangeTheorSigma5.RescaleTime.Name
source: Rescale Time
ru: Заменить время

# ExchangeTheorSigma5.RescaleTime.Description
source: Rescale time-to-expiry to our internal?
ru: Заменять время на 'правильное'?

# ExchangeTheorSigma5.OptionType.Name
source: Option Type
ru: Вид опционов

# ExchangeTheorSigma5.OptionType.Description
source: Option type (parameter Any is not recommended)
ru: Тип опционов (использование типа Any может привести к неожиданному поведению)

# ExchangeTheorSigma5.MultiplierPx.Name
source: Multiplier
ru: Мультипликатор

# ExchangeTheorSigma5.MultiplierPx.Description
source: Price multiplier
ru: Мультипликатор цен

# ExchangeTheorSigma5.ShiftPx.Name
source: Shift
ru: Сдвиг цен

# ExchangeTheorSigma5.ShiftPx.Description
source: Price shift (price steps)
ru: Сдвиг цен (в шагах цены)

# ExchangeTheorSigma5.ExpiryTime.Name
source: Expiry Time
ru: Время истечения

# ExchangeTheorSigma5.ExpiryTime.Description
source: Exact expiration time of day (HH:mm)
ru: Точное время экспирации (HH:mm)

# ForwardTheorPx.Strike.Name
source: Strike
ru: Страйк

# ForwardTheorPx.Strike.Description
source: Strike to calculate forward price
ru: Страйк, который будет использован для расчета форвардной цены

# GlobalHv.UseAllData.Name
source: Use All Data
ru: Все данные

# GlobalHv.UseAllData.Description
source: Should handler use all data including overnight gaps?
ru: При true будет учитывать все данные, включая ночные гепы

# GlobalHv.Period.Name
source: Period
ru: Период

# GlobalHv.Period.Description
source: Calculation period
ru: Период расчета исторической волатильности

# GlobalHv.Timeframe.Name
source: Timeframe
ru: Таймфрейм

# GlobalHv.Timeframe.Description
source: Timeframe (seconds)
ru: Таймфрейм (секунды)

# GlobalHv.AnnualizingMultiplier.Name
source: Annualizing Multiplier
ru: Масштабный множитель

# GlobalHv.AnnualizingMultiplier.Description
source: Multiplier to convert volatility to annualized value
ru: Множитель для перевода волатильности в годовое исчисление

# GlobalHv.ReturnPct.Name
source: Return Pct
ru: В процентах

# GlobalHv.ReturnPct.Description
source: Return volatility as percents
ru: При true будет возвращать волатильность в процентах

# GlobalHv.RepeatLastHv.Name
source: Repeat Last HV
ru: Повтор последней волатильности

# GlobalHv.RepeatLastHv.Description
source: When true it will find and repeat last known value in case when current value is unavailable
ru: При true будет находить и использовать последнее известное значение

# Heartbeat.DelayMs.Name
source: Delay
ru: Задержка

# Heartbeat.DelayMs.Description
source: Delay between calls (ms)
ru: Задержка между вызовами (мс)

# Heartbeat.OnlyAtTradingSession.Name
source: Trading session only
ru: Только в торговое время

# Heartbeat.OnlyAtTradingSession.Description
source: If the flag is set, handler initiates execution only in agent mode at trading time when data provider is connected to market and the instrument is actually traded.
ru: Если выставить этот флаг, блок работает только в режиме агента во время торгов, когда подключен провайдер и использованный инструмент действительно торгуется.

# HeartbeatHandler.Interval.Name
source: Interval
ru: Интервал

# HeartbeatHandler.Interval.Description
source: Interval
ru: Интервал

# GaussSmile.IsVisiblePoints.Name
source: Show nodes
ru: Показывать узлы

# GaussSmile.IsVisiblePoints.Description
source: Show nodes
ru: Показывать узлы на кривой

# GaussSmile.GenerateTails.Name
source: Generate Tails
ru: Формировать края

# GaussSmile.GenerateTails.Description
source: Prepare invisible tails to extend working range
ru: Генерировать невидимые края, чтобы расширить рабочий диапазон

# GaussSmile.IvAtmPct.Description
source: IV ATM (percents)
ru: Волатильность на деньгах (проценты)

# GaussSmile.ShiftPct.Name
source: Shift
ru: Сдвиг

# GaussSmile.ShiftPct.Description
source: Shift (percents)
ru: Сдвиг нижней точки (проценты)

# GaussSmile.DepthPct.Name
source: Depth
ru: Глубина

# GaussSmile.DepthPct.Description
source: Depth (percents)
ru: Глубина прогиба (проценты)

# AnyOption
source: Security or Option Series or OPTION
ru: Инструмент или Опционная серия или ОПЦИОН

# HV.UseAllData.Name
source: Use All Data
ru: Все данные

# HV.UseAllData.Description
source: Should handler use all data including overnight gaps?
ru: При true будет учитывать все данные, включая ночные гепы

# HV.Period.Name
source: Period
ru: Период

# HV.Period.Description
source: Calculation period
ru: Период расчета исторической волатильности

# HV.AnnualizingMultiplier.Name
source: Annualizing Multiplier
ru: Масштабный множитель

# HV.AnnualizingMultiplier.Description
source: Multiplier to convert volatility to annualized value
ru: Множитель для перевода волатильности в годовое исчисление

# HV.ReturnPct.Name
source: Return Pct
ru: В процентах

# HV.ReturnPct.Description
source: Return volatility as percents
ru: При true будет возвращать волатильность в процентах

# HV.Reset.Name
source: Repeat
ru: Повторить

# HV.Reset.Description
source: Repeat calculation for all bars every execution
ru: Повторять вычисление для всех баров при каждом вызове

# HV.UseGlobalCache.Name
source: Use Global Cache
ru: Использовать глобальный кеш

# HV.UseGlobalCache.Description
source: Use global cache
ru: Использовать глобальный кеш

# HV.AllowGlobalReadWrite.Name
source: Allow Global Write
ru: Разрешить запись

# HV.AllowGlobalReadWrite.Description
source: Permission to write to Global Cache
ru: Разрешить чтение/запись в глобальный кеш или только чтение?

# HV.GlobalSavePeriod.Name
source: Global Save Period
ru: Периодичность записи

# HV.GlobalSavePeriod.Description
source: Period to write to Global Cache
ru: Сохранять в глобальный кеш через каждые N баров

# IvOnF.UseGlobalCache.Name
source: Use Global Cache
ru: Использовать глобальный кеш

# IvOnF.UseGlobalCache.Description
source: Use global cache
ru: Использовать глобальный кеш

# IvOnF.AllowGlobalReadWrite.Name
source: Allow Global Write
ru: Разрешить запись

# IvOnF.AllowGlobalReadWrite.Description
source: Permission to write to Global Cache
ru: Разрешить чтение/запись в глобальный кеш или только чтение?

# IvOnF.GlobalSavePeriod.Name
source: Global Save Period
ru: Периодичность записи

# IvOnF.GlobalSavePeriod.Description
source: Period to write to Global Cache
ru: Сохранять в глобальный кеш через каждые N баров

# IvOnF.MinStrike.Name
source: Min strike
ru: Минимальный страйк

# IvOnF.MinStrike.Description
source: Min strike to be processed by handler
ru: Минимальный обрабатываемый страйк

# IvOnF.MaxStrike.Name
source: Max strike
ru: Максимальный страйк

# IvOnF.MaxStrike.Description
source: Max strike to be processed by handler
ru: Максимальный обрабатываемый страйк

# IvOnF.StrikeStep.Name
source: Strike step
ru: Шаг страйков

# IvOnF.StrikeStep.Description
source: Strike step
ru: Шаг между страйками

# IvSmile.OptPxMode.Name
source: Price Mode
ru: Вид цены

# IvSmile.OptPxMode.Description
source: Algorythm to get option price
ru: Алгоритм расчета цены опциона

# IvSmile.OptionType.Name
source: Option Type
ru: Тип опциона

# IvSmile.OptionType.Description
source: Option type to be used by handler (call, put, best volatility)
ru: Тип опционов для расчетов (колл, пут, лучшая волатильность)

# IvSmile.ShiftBid.Name
source: Shift Bid
ru: Сдвиг бидов

# IvSmile.ShiftBid.Description
source: Shift Bids down (price steps)
ru: Сдвиг котировок Bid на заданное количество шагов цены вниз

# IvSmile.ShiftAsk.Name
source: Shift Ask
ru: Сдвиг асков

# IvSmile.ShiftAsk.Description
source: Shift Asks up (price steps)
ru: Сдвиг котировок Ask на заданное количество шагов цены вверх

# IvSmile.MaxSigmaPct.Name
source: Max Sigma Pct
ru: Макс. вола (проценты)

# IvSmile.MaxSigmaPct.Description
source: Max volatility limit (percents)
ru: Предельная волатильность (в процентах)

# IvSmile.MinStrike.Name
source: Min strike
ru: Минимальный страйк
