Repository: TSLab-Dev/Handlers
Catalog: Properties/Resources.*.resx
Languages: ru

# SingleSeriesProfileDeribit.FutNominal.Description
source: Nominal value of Deribit futures (by default is 10 USD)
ru: Номинальный размер фьючерса Дерибит (по умолчанию 10 USD)

# SingleSeriesProfileDeribit.ProfileAsBtc.Name
source: Profile in BTC?
ru: Профиль в биткойнах?

# SingleSeriesProfileDeribit.ProfileAsBtc.Description
source: Calculate profile as bitcoins
ru: Вычислить профиль позиции в биткойнах

# SingleSeriesProfileDeribit.SigmaMult.Name
source: Width multiplier
ru: Множитель ширины

# SingleSeriesProfileDeribit.SigmaMult.Description
source: Width multiplier
ru: Множитель ширины

# SingleSeriesProfileDeribit.ShowNodes.Name
source: Show nodes
ru: Показывать узлы

# SingleSeriesProfileDeribit.ShowNodes.Description
source: Nodes are shown when true
ru: При true будет показывать узлы на отображаемой линии

# SmileImitationDeribit5.Name
source: Smile Imitation v5 (Deribit)
ru: Имитация улыбки v5 (Deribit)

# SmileImitationDeribit5.Description
source: Smile imitation using application-wide user function in Global Cache
ru: Имитация улыбки, используя пользовательскую функцию в глобальном кеше (c учетом необходимости домножить цены на курс конвертации)

# SmileImitationDeribit5.SetIvByHands.Name
source: Set IV
ru: Задать IV

# SmileImitationDeribit5.SetIvByHands.Description
source: Set IV manually
ru: Уровень IV ATM задаётся руками (в %)

# SmileImitationDeribit5.SetSlopeByHands.Name
source: Set Skew Manually
ru: Наклон принудительно

# SmileImitationDeribit5.SetSlopeByHands.Description
source: Set skew manually
ru: Уровень наклона задаётся принудительно

# SmileImitationDeribit5.SetShapeByHands.Name
source: Set Shape Manually
ru: Форма принудительно

# SmileImitationDeribit5.SetShapeByHands.Description
source: Set shape manually
ru: Форма задаётся руками

# SmileImitationDeribit5.GenerateTails.Name
source: Generate Tails
ru: Формировать края

# SmileImitationDeribit5.GenerateTails.Description
source: Generate invisible tails
ru: Генерировать невидимые края

# SmileImitationDeribit5.UseLocalTemplate.Name
source: Use Local Template
ru: Локальный шаблон

# SmileImitationDeribit5.UseLocalTemplate.Description
source: Use template from global or from local cache
ru: Использовать шаблон из глобального или из локального кеша

# SmileImitationDeribit5.IvAtmPct.Description
source: IV ATM (percents)
ru: Волатильность на-деньгах (в процентах)

# SmileImitationDeribit5.SlopePct.Name
source: Skew, %
ru: Наклон, %

# SmileImitationDeribit5.SlopePct.Description
source: Skew (percents)
ru: Наклон (в процентах)

# SmileImitationDeribit5.ShapePct.Name
source: Shape, %
ru: Форма, %

# SmileImitationDeribit5.ShapePct.Description
source: Shape (percents)
ru: Форма (в процентах)

# SmileImitationDeribit5.FrozenSmileID.Name
source: Frozen Smile ID
ru: Локальный ключ

# SmileImitationDeribit5.FrozenSmileID.Description
source: Smile ID to be used with Local Cache
ru: Ключ улыбки в локальном кеше

# SmileImitationDeribit5.GlobalSmileID.Name
source: Global Smile ID
ru: Глобальный ключ

# SmileImitationDeribit5.GlobalSmileID.Description
source: Smile ID to be used with Global Cache
ru: Ключ улыбки в глобальном кеше

# SmileImitationDeribit5.SigmaMult.Name
source: Width multiplier
ru: Множитель ширины

# SmileImitationDeribit5.SigmaMult.Description
source: Width multiplier
ru: Множитель ширины

# SmileImitationDeribit5.ShowNodes.Name
source: Show nodes
ru: Показывать узлы

# SmileImitationDeribit5.ShowNodes.Description
source: Nodes are shown when true
ru: При true будет показывать узлы на отображаемой линии

# InteractiveConstGen.Description
source: Creates an interactive constant on a chart pane (a horizontal line).
ru: Создает интерактивную константу на панели графика (горизонтальная линия).

# InteractiveLineGen.Description
source: Creates an interactive line on a chart pane.
ru: Создает интерактивную линию на панели графика.

# Ln.Mult.Name
source: Multiply
ru: Множитель

# Ln.Mult.Description
source: A result of logarithm may be multiplied by this coefficient ( Mult*LN(x) + Add )
ru: Результат логарифмирования можно сразу умножить на этот коэффициент ( Mult*LN(x) + Add )

# Ln.Add.Name
source: Add
ru: Прибавить

# Ln.Add.Description
source: A result of logarithm (after multiplication) may be shifted by this value ( Mult*LN(x) + Add )
ru: Результат логарифмирования (после домножения) можно увеличить на этот сдвиг ( Mult*LN(x) + Add )

# Multiply.Coef.Name
source: Multiply
ru: Множитель

# Multiply.Coef.Description
source: Every item of input is multiplied by this coefficient ( Mult*x )
ru: Каждый элемент входной серии умножается на указанный коэффициент ( Mult*x )

# SecDivideWith.Coef.Name
source: Multiply
ru: Множитель

# SecDivideWith.Coef.Description
source: Every bar of input is multiplied by this coefficient ( Mult * x / Source2 )
ru: Каждый бар входной серии умножается на указанный коэффициент ( Mult * x / Source2 )

# SecMultiply.Coef.Name
source: Multiply
ru: Множитель

# SecMultiply.Coef.Description
source: Every bar of input is multiplied by this coefficient ( Mult*x )
ru: Каждый бар входной серии умножается на указанный коэффициент ( Mult*x )

# SecMultiplyWith.Coef.Name
source: Multiply
ru: Множитель

# SecMultiplyWith.Coef.Description
source: Every bar of input is multiplied by this coefficient ( Mult * Source2 * x )
ru: Каждый бар входной серии умножается на указанный коэффициент ( Mult * Source2 * x )

# AbsolutCommission.Commission.Name
source: Comission
ru: Комиссия

# AbsolutCommission.Commission.Description
source: Absolute comission per 1 lot of a security
ru: Абсолютная комиссия на 1 лот инструмента

# RelativeCommisionWithMinimal.MinimalCommission.Name
source: Minimal comission
ru: Минимальная комиссия

# RelativeCommisionWithMinimal.MinimalCommission.Description
source: Minimal absolute comission for a trade
ru: Минимальная абсолютная комиссия за сделку

# RelativeCommisionWithMinimal.CommissionPct.Name
source: Comission, %
ru: Комиссия, %

# RelativeCommisionWithMinimal.CommissionPct.Description
source: Сomission as a percent of a volume
ru: Комиссия в процентах от объема сделки

# RelativeCommission.CommissionPct.Name
source: Comission, %
ru: Комиссия, %

# RelativeCommission.CommissionPct.Description
source: Сomission as a percent of a volume
ru: Комиссия в процентах от объема сделки

# TextHandler.Text.Name
source: Text
ru: Текст

# TextHandler.Text.Description
source: Text (string)
ru: Текст (строка)

# AlignedSecurityHandler.Description
source: The 'Aligned Instrument’ block allows to display the same width histograms regardless of the actual number of candles in the chart.
ru: Блок 'Выровненный инструмент' обеспечивает отображение гистограмм одинаковой ширины вне зависимости от фактического количества свечей в графике.

# AllTimeTradeStatisticsHandler.Description
source: The 'All Time Trade Statistics' block creates a histogram based on the entire available time interval. [br]The histogram can be built on the number of trades, the volume of trades, the buy quantity, the sell quantity, the difference between the buy and sell quantity and the relative difference between the buy and sell quantity, % (see the 'View' parameter).
ru: Блок 'Торговая статистика за всё время' создает гистограмму на основе всего доступного временного интервала. [br]Гистограмма может быть построена на количестве сделок, объеме торгов, количестве покупок, количестве продаж, разнице количества покупок и продаж и относительной разнице количества покупок и продаж, % (см. параметр 'Вид').

# BidAskMarketPosition.Description
source: Bid/Ask footprint shows the number of purchases and sales separately for every price step or price range, depending on value of a 'Combine Steps' parameter. If there are more purchases, the line turns green, if less, the line turns red. In case the numbers of purchases and sales are equal, the line turns yellow.
ru: Отображает количество покупок и продаж отдельно для каждого шага или диапазона цены, в зависимости от настройки параметра 'Объединять шагов'. В случае если покупок больше, строка окрашивается зеленым цветом, если меньше - красным. В случае равенства числа покупок и числа продаж строка окрашивается желтым цветом.

# BuysHandler.Description
source: A handler calculates statistics (amount or total volume) of a long trades
ru: Показывает характеристики (количество или суммарный объем) сделок на покупку

# BuysMinusSellsHandler.Description
source: A handler calculates statistics difference (amount or total volume) of a long and short trades
ru: Показывает разницу характеристик (количество или суммарный объем) сделок на покупку и на продажу

# DeltaMarketPosition.Description
source: Delta Footprint shows difference in the number of purchases and sales separately for every price step or price range, depending on value of a 'Combine Steps' parameter. If there are more purchases, the line turns green, if less, the line turns red. In case the numbers of sales and purchases are equal, the line turns yellow.
ru: Отображает разность числа покупок и числа продаж отдельно для каждого шага или диапазона цены, в зависимости от настройки параметра 'Объединять шагов'. В случае если покупок больше, строка окрашивается зеленым цветом, если меньше - красным цветом. В случае равенства числа покупок и числа продаж строка окрашивается желтым.

# LastContractsTradeStatisticsHandler.Description
source: The 'Last Contracts Trade Statistics' block creates a histogram for the specified number of -last contracts.
ru: Блок 'Торговая статистика последних контрактов' создает гистограмму за указанное количество последних контрактов.

# LastTradeStatisticsHandler.Description
source: The 'Latest Trade Statistics' block creates a histogram for the specified time interval.
ru: Блок 'Последняя торговая статистика' создает гистограмму за указанный временной интервал.

# SellsHandler.Description
source: A handler calculates statistics (amount or total volume) of a short trades
ru: Показывает характеристики (количество или суммарный объем) сделок на продажу

# TradeStatisticsBarsCountHandler.Description
source: The 'Trade Statistics Strings Count' block gives the number of lines of trade statistics corresponding to the selected filter.
ru: Блок 'Количество строк торговой статистики' выдает количество строк торговой статистики, соответствующее выбранному фильтру.

# TradeStatisticsBarsSumHandler.Description
source: The 'Trade Statistics Strings Sum' block gives a value based on the sum of the values of rows of trade statistics.
ru: Блок 'Сумма строк торговой статистики' выдает значение, основанное на сумме значений строк торговой статистики.

# TradeStatisticsExtendedBarsCountHandler.Description
source: The 'Trade Statistics Extended Strings Count 1' block displays the number of lines of trade statistics corresponding to the selected filter.
ru: Блок 'Расширенное количество строк торговой статистики 1' выдает количество строк торговой статистики, соответствующее выбранному фильтру.

# TradeStatisticsExtendedBarsCountHandler2.Description
source: The 'Trade Statistics Extended Strings Count 2' block displays the number of lines of trade statistics corresponding to the selected filter.
ru: Блок 'Расширенное количество строк торговой статистики 2' выдает количество строк торговой статистики, соответствующее выбранному фильтру.

# TradeStatisticsExtendedBarsSumHandler.Description
source: The 'Trade Statistics Extended Strings Sum 1' block gives a value based on the sum of the values of lines of trade statistics.
ru: Блок 'Расширенная сумма строк торговой статистики 1' выдает значение, основанное на сумме значений строк торговой статистики.

# TradeStatisticsExtendedBarsSumHandler2.Description
source: The 'Trade Statistics Extended Strings Sum 2' block gives a value based on the sum of the values of lines of trade statistics.
ru: Блок 'Расширенная сумма строк торговой статистики 2', выдает значение, основанное на сумме значений строк торговой статистики.

# TradeStatisticsExtendedExtremumPriceHandler.Description
source: The 'Trade Statistics Extended Extremum Price 1' block shows the maximum value of trade statistics at the extremum price.
ru: Блок 'Расширенная экстремальная цена торговой статистики 1' показывает максимальное значение торговой статистики при экстремальной цене.

# TradeStatisticsExtendedExtremumPriceHandler2.Description
source: The 'Trade Statistics Extended Extremum Price 2' block shows the price at which the maximum value of the histogram was reached.
ru: Блок 'Расширенная экстремальная цена торговой статистики 2' показывает цену, при которой было достигнуто максимальное значение гистограммы.

# TradeStatisticsExtremumPriceHandler.Description
source: The 'Trade Statistics Extremum Price' block shows the price at which the maximum value of the histogram was reached.
ru: Блок 'Экстремальная цена торговой статистики' показывает цену, при которой было достигнуто максимальное значение гистограммы.

# TradeStatisticsExtremumValueHandler.Description
source: The 'Trade Statistics Extremum Value' block shows the maximum value of trade statistics at an extreme price.
ru: Блок 'Экстремальное значение торговой статистики' показывает максимальное значение торговой статистики при экстремальной цене.

# TradeStatisticsHandler.Description
source: The 'Trade Statistics' block creates a histogram for the selected timeframe (time interval). [br]The histogram can be built on the number of trades , the volume of trades, the buy quantity, the sell quantity, the difference between the buy and sell quantity and the relative difference between the buy and sell quantity, % (see the 'View' parameter).
ru: Блок 'Торговая статистика' создает гистограмму за выбранный таймфрейм (временной интервал). [br]Гистограмма может быть построена на количестве сделок, объеме торгов, количестве покупок, количестве продаж, разнице количества покупок и продаж и относительной разнице количества покупок и продаж, % (см. параметр 'Вид').

# TradeStatisticsLowerEdgeHandler.Description
source: The 'Trade Statistics Lower Level' block allows you to set the cut-off data percentage for the lower level. This block is connected to the block 'Trading statistics'.
ru: Кубик 'Нижний уровень торговой статистики' позволяет установить в процентном значении отсечку данных по нижнему уровню. Данный блок соединяется с блоком 'Торговая статистика'.

# TradeStatisticsPriceValueHandler.Description
source: The 'Trade Statistics Price Value' block creates a histogram based on the selected price. Used in conjunction with the block 'Trading statistics'.
ru: Блок 'Значение цены торговой статистики' создает гистограмму на основе выбранной цены. Используется совместно с блоком 'Торговая статистика'.

# TradeStatisticsUpperEdgeHandler.Description
source: The 'Trade Statistics Upper Level' block allows you to set the percentage of data cutoff at the upper level. This block is connected to the block 'Trading statistics'.
ru: Блок 'Верхний уровень торговой статистики' позволяет установить в процентном значении отсечки данных по верхнему уровню. Данный блок соединяется с блоком 'Торговая статистика'.

# VolumeForPeriodHandler.Description
source: Volume for period (total or average)
ru: Объём за период (суммарный или средний)

# VolumeMarketPosition.Description
source: Volume footprint shows the sum of purchases and sales for every price step or price range, depending on value of a 'Combine Steps' parameter.
ru: Отображает сумму покупок и продаж для каждого шага или диапазона цены, в зависимости от настройки параметра 'Объединять шагов'.

# ADX.Description
source: Old algo to calculate ADX: EMA of (Input1-Input2)/(Input1+Input2)
ru: Нестандартный (старый) расчет ADX: разность первого и второго входа делится на их сумму и затем усредняется по алгоритму EMA

# ADX.Period.Name
source: Period
ru: Период

# ADX.Period.Description
source: Indicator period (processing window)
ru: Период индикатора (окно расчетов)

# ADXFull.Description
source: An indicator of the Average Directional Movement Index (ADX). Helps to define a possible trend direction.
ru: Индикатор ADX или индикатор средней направленности (Average Directional Movement Index). Служит для определения вероятного направления основного тренда.

# ADXFull.Period.Name
source: Period
ru: Период

# ADXFull.Period.Description
source: Indicator period (processing window)
ru: Период индикатора (окно расчетов)

# AMA.Description
source: The Adaptive Moving Average.
ru: Адаптивное сглаженное скользящее среднее.

# AMA.Period.Name
source: Period
ru: Период

# AMA.Period.Description
source: Indicator period (processing window)
ru: Период индикатора (окно расчетов)

# AroonDown.Description
source: The Aroon- indicator.
ru: Индикатор Арун-.

# AroonDown.Period.Name
source: Period
ru: Период

# AroonDown.Period.Description
source: Indicator period (processing window)
ru: Период индикатора (окно расчетов)

# AroonUp.Description
source: The Aroon+ indicator.
ru: Индиатор Арун+.

# AroonUp.Period.Name
source: Period
ru: Период

# AroonUp.Period.Description
source: Indicator period (processing window)
ru: Период индикатора (окно расчетов)

# AverageTrueRange.Description
source: Old algo to calculate ATR. This indicator shows a exponentially moving average value of the True Range values (TR).
ru: Индикатор среднего истинного диапазона (Average True Range - ATR). Представляет собой скользящее среднее значений истинного диапазона (TR).

# AverageTrueRange.Period.Name
source: Period
ru: Период

# AverageTrueRange.Period.Description
source: Indicator period (processing window)
ru: Период индикатора (окно расчетов)

# BollingerBands1.Description
source: The upper Bollinger band.
ru: Верхняя граница коридора Болинжера.

# BollingerBands1.Coef.Name
source: Width
ru: Ширина

# BollingerBands1.Coef.Description
source: Width of a Bollinger band
ru: Ширина полосы Боллинджера

# BollingerBands1.Period.Name
source: Period
ru: Период

# BollingerBands1.Period.Description
source: Indicator period (processing window)
ru: Период индикатора (окно расчетов)

# BollingerBands2.Description
source: The lower Bollinger band.
ru: Нижняя граница коридора Болинжера.

# BollingerBands2.Coef.Name
source: Width
ru: Ширина

# BollingerBands2.Coef.Description
source: Width of a Bollinger band
ru: Ширина полосы Боллинджера

# BollingerBands2.Period.Name
source: Period
ru: Период

# BollingerBands2.Period.Description
source: Indicator period (processing window)
ru: Период индикатора (окно расчетов)

# CCI.Description
source: The Commodity Channel Index (CCI) measures deviation of instrument price from its average price.
ru: Индекс товарного канала (Commodity Channel Index - CCI). Измеряет отклонение цены инструмента от его среднестатистической цены.

# CCI.Period.Name
source: Period
ru: Период

# CCI.Period.Description
source: Indicator period (processing window)
ru: Период индикатора (окно расчетов)

# Compress.Interval.Name
source: Interval
ru: Интервал

# Compress.Interval.Description
source: Target interval in units of security timeframe. I.e. Interval=5 for timeframe H1 results in bars in timeframe H5. But Interval=4 for timeframe M2 results in timeframe M4.
ru: Целевой таймфрейм в единицах таймфрейма инструмента. Например, Интервал=5 для таймфрейма H1 даст бары в таймфрейме H5. Но Интервал=4 для таймфрейма M2 даст бары в таймфрейме M4.

# CompressAdvanced.IntervalBase.Name
source: Interval base
ru: База интервала

# CompressAdvanced.IntervalBase.Description
source: Target timeframe base (DAYS, MINUTE, SECONDS, TICK, VOLUME, PRICERANGE).
ru: База итогового таймфрейма (Дни, Минуты, Секунды, Тики, Объём, Шаги цены).

# CompressAdvanced.Interval.Name
source: Interval
ru: Интервал

# CompressAdvanced.Interval.Description
source: Target interval in units of parameter 'Interval base'.
ru: Целевой таймфрейм в единицах параметра 'База интервала'.

# CompressToSeconds.Interval.Name
source: Interval
ru: Интервал

# CompressToSeconds.Interval.Description
source: Target interval in seconds. I.e. Interval=16 results in timeframe S16. The source must be compatible with a target timeframe.
ru: Целевой таймфрейм в секундах. Например, Интервал=16 даст бары в таймфрейме S16. Но источник должен быть совместим с требуемым таймфреймом.

# CuttlerRSI.Description
source: A variation called the Cutler's RSI, based on a simple moving average. This is a momentum oscillator, measuring velocity and magnitude of directional price movements.
ru: Индекс относительной силы (Cutler's Relative strength index) это версия индикатора, использующая экспоненциональное сглаживание. Следующий за ценами осциллятор, который колеблется в диапазоне от 0 до 100.

# CuttlerRSI.Period.Name
source: Period
ru: Период

# CuttlerRSI.Period.Description
source: Indicator period (processing window)
ru: Период индикатора (окно расчетов)

# DEMA.Description
source: The Double Exponential Moving Average.
ru: Двойное экспоненциальное сглаженное скользящее среднее.

# DEMA.Period.Name
source: Period
ru: Период

# DEMA.Period.Description
source: Indicator period (processing window)
ru: Период индикатора (окно расчетов)

# DIM.Description
source: A negative direction indicator of the Average Directional Movement Index.
ru: Индикатор отрицательного направления системы индикаторов Average Directional Movement Index.

# DIM.Period.Name
source: Period
ru: Период

# DIM.Period.Description
source: Indicator period (processing window)
ru: Период индикатора (окно расчетов)

# DIP.Description
source: A positive direction indicator of the Average Directional Movement Index.
ru: Индикатор положительного направления системы индикаторов Average Directional Movement Index.

# DIP.Period.Name
source: Period
ru: Период

# DIP.Period.Description
source: Indicator period (processing window)
ru: Период индикатора (окно расчетов)

# EMA.Description
source: The Exponential Moving Average. Calculated by summing up a previous moving average value and some part of a current closing price.
ru: Экспоненциально сглаженное скользящее среднее. Определяется путем прибавления к предыдущему значению скользящего среднего определенной доли текущей цены закрытия.

# EMA.Period.Name
source: Period
ru: Период

# EMA.Period.Description
source: Indicator period (processing window)
ru: Период индикатора (окно расчетов)

# FAMA.Description
source: The Fractal Adaptive Moving Average.
ru: Фрактальное сглаженное скользящее среднее.

# Highest.Description
source: The highest price of an instrument in a period.
ru: Наибольшая цена инструмента за выбранный период (в барах).

# Highest.Period.Name
source: Period
ru: Период

# Highest.Period.Description
source: Indicator period (processing window)
ru: Период индикатора (окно расчетов)

# Lowest.Description
source: The lowest price of an instrument in a period.
ru: Наименьшая цена инструмента за выбранный период (в барах).

# Lowest.Period.Name
source: Period
ru: Период

# Lowest.Period.Description
source: Indicator period (processing window)
ru: Период индикатора (окно расчетов)

# LWMA.Description
source: The Linear-Weighted Moving Average
ru: Линейно-взвешенное сглаженное скользящее среднее.

# LWMA.Period.Name
source: Period
ru: Период

# LWMA.Period.Description
source: Indicator period (processing window)
ru: Период индикатора (окно расчетов)

# MACD.Description
source: The Moving Average Convergence/Divergence. This indicator spots trend changes. Shows a ratio of two moving average values of price. Parameters of movings are hardcoded (12 and 26).
ru: Технический индикатор 'Схождение / Расхождение скользящих средних' - это следующий за тенденцией динамический индикатор. Показывает соотношение между двумя скользящими средними цены. Параметры мувингов фиксированы (12 и 26).
