Repository: TSLab-Dev/Handlers
Catalog: Properties/Resources.*.resx
Languages: ru

# BarsCountForValuesSumHandler.ValuesSum.Description
source: Indicator values sum
ru: Сумма значений индикатора

# ControlMessageHandler.Name
source: Control message
ru: Контрольное сообщение

# ControlMessageHandler.Description
source: Outputs control message
ru: Выводит контрольное сообщение

# ControlMessageHandler.TrueMessage.Name
source: True message
ru: Истинное сообщение

# ControlMessageHandler.TrueMessage.Description
source: True message
ru: Истинное сообщение

# ControlMessageHandler.FalseMessage.Name
source: False message
ru: Ложное сообщение

# ControlMessageHandler.FalseMessage.Description
source: False message
ru: Ложное сообщение

# ControlMessageHandler.Message.Name
source: Message
ru: Сообщение

# ControlMessageHandler.Message.Description
source: Message
ru: Сообщение

# ExportValuesHandler.Name
source: Export values
ru: Экспорт значений

# ImportBoolValuesHandler.Name
source: Import bool values
ru: Импорт логических значений

# ImportDoubleValuesHandler.Name
source: Import double values
ru: Импорт вещественных значений

# ImportIntValuesHandler.Name
source: Import int values
ru: Импорт целочисленных значений

# TimestampHandler.Name
source: Timestamp
ru: Штамп времени

# LastClosedPositionExitBarNumber.Name
source: Exit bar number of last closed position
ru: Номер бара выхода из последней закрытой позиции

# LastClosedPositionExitBarNumber.Description
source: The exit bar number of the latest closed position.
ru: Номер бара выхода из последней закрытой позиции.

# OrderBookPrice.Name
source: Order book, price
ru: Очередь заявок, цена

# OrderBookPrice.Description
source: Price value from a row of the order book.
ru: Значение цены в строке из очереди заявок.

# OrderBookPrice.Buy.Name
source: Direction
ru: Направление

# OrderBookPrice.Buy.Description
source: On - Buy, Off - Sell
ru: Вкл - Покупка, выкл - Продажа

# OrderBookPrice.Index.Name
source: Index
ru: Номер строки

# OrderBookPrice.Index.Description
source: Index of row starting at 0, from the middle of the order book.
ru: Индекс строки начиная с 0, от середины очереди заявок

# OrderBookQty.Name
source: Order book, quantity
ru: Очередь заявок, количество

# OrderBookQty.Description
source: Quantity value from a row of the order book.
ru: Значение количество в строке из очереди заявок.

# OrderBookQty.Buy.Name
source: Direction
ru: Направление

# OrderBookQty.Buy.Description
source: On - Buy, Off - Sell
ru: Вкл - Покупка, выкл - Продажа

# OrderBookQty.Index.Name
source: Index
ru: Номер строки

# OrderBookQty.Index.Description
source: Index of row starting at 0, from the middle of the order book.
ru: Индекс строки начиная с 0, от середины очереди заявок

# OrderBookTotal.Name
source: Order book, total
ru: Очередь заявок, суммарный объем

# OrderBookTotal.Description
source: Total ask/bid for the depth of the order book.
ru: Суммарный спрос/предложение на заданную глубину очереди заявок.

# OrderBookTotal.Buy.Name
source: Direction
ru: Направление

# OrderBookTotal.Buy.Description
source: On - Buy, Off - Sell
ru: Вкл - Покупка, выкл - Продажа

# OrderBookTotal.NumberRows.Name
source: Number of rows
ru: Количество строк

# OrderBookTotal.NumberRows.Description
source: Number of rows from the middle of the order book for which the total
ru: Количество строк от середины очереди заявок, по которым считается сумма

# ResultForOptimization.Name
source: Result for optimization
ru: Результат для оптимизации

# ResultForOptimization.Description
source: Value for showing in the "Result from script" column in the optimization results grid.
ru: Значение, которое отображается в колонке "Результат из скрипта" в таблице результатов оптимизации.

# ControlledBoolBreaker.Name
source: Controlled Boolean Breaker
ru: Управляемый логический разделитель

# ControlledBoolBreaker.Description
source: Sets a FALSE value at every candle except the last one. For the last value sets a selected TRUE/FALSE value. This block is used together with the control pane buttons. When signaled, the Value parameter reset automatically.
ru: Используется совместно с блоком 'Контрольная панель' для осуществления ручного управления кнопками на ней (режим полуавтоматической торговли). При нажатии на кнопку будет выдан true только для текущей свечи, что гарантирует, что сигнал будет выдан всегда на текущей свече. После появления сигнала на входе (true) параметр Value сбрасывается.

# ControlledBoolBreaker.Value.Name
source: Value
ru: Значение

# ControlledBoolBreaker.Value.Description
source: Set true for waiting a signal. Reset automatically when signaled.
ru: при True запуск режима ожидания сигнала по входу. Сбрасывается при поступлении сигнала.

# RecalcScheduler.Name
source: Recalc Scheduler
ru: Пересчет скрипта в заданное время

# RecalcScheduler.Description
source: Execute a script by schedule.
ru: Автоматический принудительный пересчет скрипта в заданное системное время компьютера.

# RecalcScheduler.RecalcTime.Name
source: Time
ru: Время

# RecalcScheduler.RecalcTime.Description
source: Executing time.
ru: Время с точностью до миллисекунды, когда будет запущен пересчет скрипта.

# MaxCount.Name
source: Max count
ru: Макс. количество

# Index.Name
source: Index
ru: Индекс

# UseLastIndex.Name
source: Use last index
ru: Использовать последний индекс

# ExecutionOrder.Name
source: Execution order
ru: Порядок исполнения

# EventKindHandler.Name
source: Event
ru: Событие

# EventKindHandler.Description
source: During the next recalculation, if the specified event is executed, the Event block will return the value true. This value can be used in the algorithm. [br]The block can be used many times in the editor. The block connects to the source, returns an event for the tool.
ru: Событие

# EventKindHandler.EventKind.Name
source: Event kind
ru: Вид события

# EventKindHandler.EventKind.Description
source: Event type: None, Order rejected, Order filled, Position opening, Position closing, Order quantity changed, Trading is started, Trading is stopped, Order canceled, Pretrade limitation.
ru: Вид события

# EventKind.Name
source: Event kind
ru: Вид события

# RandomHandler.Name
source: Random number
ru: Случайное число

# RandomHandler.Description
source: Random number in the specified range.
ru: Случайное число в заданном диапазоне.

# RandomHandler.MinValue.Name
source: Min value
ru: Мин. значение

# RandomHandler.MaxValue.Name
source: Max value
ru: Макс. значение

# RandomHandler.Precision.Name
source: Precision
ru: Точность

# RandomHandler.Precision.Description
source: The number of decimal places.
ru: Число знаков после запятой.

# RandomHandler.Seed.Description
source: A number used to calculate a starting value for the pseudo-random number sequence. (0 - not set).
ru: Число, используемое для вычисления начального значения последовательности псевдослучайных чисел.

# RandomHandler.SaveHistory.Name
source: Save history
ru: Сохранить историю
