Repository: TSLab-Dev/Handlers
Catalog: Properties/Resources.*.resx
Languages: ru

# ConstSmileLevel2.ShowNodes.Description
source: Nodes are shown when true
ru: При true будет показывать узлы на отображаемой линии

# LastValueToParameter.Name
source: Last Value
ru: Последнее значение

# LastValueToParameter.Description
source: Convert last value in series to parameter
ru: Преобразовать последнее значение индикатора в параметр

# LastValueToParameter.Result.Name
source: Display value
ru: Показываемое значение

# LastValueToParameter.Result.Description
source: Display value (just to show it on ControlPane)
ru: Показываемое значение (для отображения в интерфейсе агента)

# OptionsBoardNumericalDelta.OptionType.Name
source: Option Type
ru: Вид опционов

# OptionsBoardNumericalDelta.OptionType.Description
source: Option type (parameter Any is not recommended)
ru: Тип опционов (использование типа Any может привести к неожиданному поведению)

# OptionsBoardNumericalDelta.GreekAlgo.Name
source: Greek algo
ru: Алгоритм улыбки

# OptionsBoardNumericalDelta.GreekAlgo.Description
source: FrozenSmile - smile is frozen; ShiftingSmile - smile shifts horizontally without modification
ru: FrozenSmile -- улыбка заморожена; ShiftingSmile -- улыбка без искажений сдвигается по горизонтали вслед за БА

# OptionsBoardNumericalDelta.TooltipFormat.Name
source: Tooltip format
ru: Формат подсказки

# OptionsBoardNumericalDelta.TooltipFormat.Description
source: Tooltip format (i.e. '0.00', '0.0##' etc)
ru: Формат числа для тултипа. Например, '0.00', '0.0##' и т.п.

# OptionsBoardNumericalDelta.SigmaMult.Name
source: Width multiplier
ru: Множитель ширины

# OptionsBoardNumericalDelta.SigmaMult.Description
source: Width multiplier
ru: Множитель ширины

# OptionsBoardNumericalDelta.ShowNodes.Name
source: Show nodes
ru: Показывать узлы

# OptionsBoardNumericalDelta.ShowNodes.Description
source: Nodes are shown when true
ru: При true будет показывать узлы на отображаемой линии

# OptionsBoardNumericalGamma.Name
source: Options board numerical gamma
ru: Численная гамма для доски

# OptionsBoardNumericalGamma.Description
source: Estimate gamma as function of strikes with numerical differentiation
ru: Численный расчет гаммы одного опциона на каждом страйке

# OptionsBoardNumericalGamma.OptionType.Name
source: Option Type
ru: Вид опционов

# OptionsBoardNumericalGamma.OptionType.Description
source: Option type (parameter Any is not recommended)
ru: Тип опционов (использование типа Any может привести к неожиданному поведению)

# OptionsBoardNumericalGamma.GreekAlgo.Name
source: Greek algo
ru: Алгоритм улыбки

# OptionsBoardNumericalGamma.GreekAlgo.Description
source: FrozenSmile - smile is frozen; ShiftingSmile - smile shifts horizontally without modification
ru: FrozenSmile -- улыбка заморожена; ShiftingSmile -- улыбка без искажений сдвигается по горизонтали вслед за БА

# OptionsBoardNumericalGamma.TooltipFormat.Name
source: Tooltip format
ru: Формат подсказки

# OptionsBoardNumericalGamma.TooltipFormat.Description
source: Tooltip format (i.e. '0.00', '0.0##' etc)
ru: Формат числа для тултипа. Например, '0.00', '0.0##' и т.п.

# OptionsBoardNumericalGamma.SigmaMult.Name
source: Width Multiplier
ru: Множитель ширины

# OptionsBoardNumericalGamma.SigmaMult.Description
source: Width Multiplier
ru: Множитель ширины

# OptionsBoardNumericalGamma.ShowNodes.Name
source: Show Nodes
ru: Показывать узлы

# OptionsBoardNumericalGamma.ShowNodes.Description
source: Nodes are shown when true
ru: При true будет показывать узлы на отображаемой линии

# SmileSelector.Name
source: Select smile
ru: Выбрать улыбку

# SmileSelector.Description
source: Select one of several available smiles using handler parameter
ru: Выбрать одну из улыбок на основании параметра блока

# SmileSelector.SmileIndex.Name
source: Input index
ru: Индекс входа

# SmileSelector.SmileIndex.Description
source: Input index (start from 1)
ru: Индекс входа (начинается с 1)

# LastValueToParameter.LastValue.Name
source: Last value
ru: Последнее значение

# LastValueToParameter.LastValue.Description
source: Last value
ru: Последнее значение

# QuoteIv.Name
source: Quote volatility
ru: Котирование волатильности

# QuoteIv.Description
source: Quote volatility
ru: Котирование волатильности

# QuoteIv.Strike.Name
source: Strike
ru: Страйк

# QuoteIv.Strike.Description
source: Option strike
ru: Страйк опциона

# QuoteIv.OptionType.Name
source: Option Type
ru: Вид опционов

# QuoteIv.OptionType.Description
source: Option type (when Any, the handler will choose out-of-the-money security)
ru: Тип опционов (Any предполагает автоматический выбор, чтобы котировать всегда опционы вне-денег)

# QuoteIv.ExecuteCommand.Name
source: Execute
ru: Исполнить

# QuoteIv.ExecuteCommand.Description
source: Execute
ru: Исполнить

# QuoteIv.CancelAllLong.Name
source: Cancel all long
ru: Отменить все покупки

# QuoteIv.CancelAllLong.Description
source: Cancel long quotes in all strikes
ru: Отменить котирование покупок во всех страйках

# QuoteIv.CancelAllShort.Name
source: Cancel all short
ru: Отменить все продажи

# QuoteIv.CancelAllShort.Description
source: Cancel short quotes in all strikes
ru: Отменить котирование продаж во всех страйках

# QuoteIv.Qty.Name
source: Size
ru: Кол-во

# QuoteIv.Qty.Description
source: Trade quantity. Negative value reverts the signal.
ru: Торговый объём. Отрицательное значение приведет к перевороту сигнала.

# QuoteIv.ShiftIvPct.Name
source: Shift IV
ru: Сдвиг волатильности

# QuoteIv.ShiftIvPct.Description
source: Shift quote relative to the smile (in percents of volatility)
ru: Сдвиг котировки относительно улыбки (в процентах волатильности)

# QuoteIv.StrikeStep.Name
source: Strike step
ru: Шаг страйков

# QuoteIv.StrikeStep.Description
source: Strike step to extract most important options
ru: Шаг страйков для выделения главных подсерий

# QuoteIv.ShiftPrice.Name
source: Shift price
ru: Сдвиг цены

# QuoteIv.ShiftPrice.Description
source: Shift quote relative to the shifted smile (in price steps)
ru: Сдвиг котировки относительно сдвинутой улыбки (в шагах цены)

# ShowIvTargets.Name
source: Show IV Targets
ru: Заявки по волатильности

# ShowIvTargets.Description
source: Show volatility limit orders
ru: Показать котировки по волатильности

# ShowIvTargets.IsLong.Name
source: Long
ru: Длинные

# ShowIvTargets.IsLong.Description
source: Show long orders
ru: Показывать длинные заявки

# SingleSeriesPositionPrices.CountQty.Name
source: Count lot size
ru: Считать лоты

# SingleSeriesPositionPrices.CountQty.Description
source: Count lot size
ru: Подсчитывать объём в лотах

# BalancedPrice.Name
source: Average entry price
ru: Средняя цена входа

# PositionsManager.CheckSecurityTime.Name
source: Check security time
ru: Проверять время инструмента

# PositionsManager.CheckSecurityTime.Description
source: When true it will validate security time before sending order to market
ru: При true будет проверять время последнего бара в инструменте перед тем, как отправить заявку в рынок

# Ask.Name
source: Ask
ru: Цена лучшей продажи

# AskQty.Name
source: Total offer
ru: Суммарное предложение

# Bid.Name
source: Bid
ru: Цена лучшей покупки

# BidQty.Name
source: Total demand
ru: Суммарный спрос

# BarNumber.Name
source: Bar number
ru: Номер бара

# HoldSignalForNBars.Name
source: Hold signal for N bars
ru: Удерживать сигнал N баров

# IsItLossAtLastPosition.Name
source: Last closed position was unprofitable
ru: Последняя закрытая позиция убыточна

# PositionChangeEntryBarNumber.Name
source: Changed Position Entry Bar Number
ru: Номер бара входа в измененную позицию

# PositionChangeExitBarNumber.Name
source: Changed Position Exit Bar Number
ru: Номер бара выхода из измененной позиции

# PositionEntryBarNumber.Name
source: Position Entry Bar Number
ru: Номер бара входа в позицию

# PositionExitBarNumber.Name
source: Position Exit Bar Number
ru: Номер бара выхода из позиции

# PositionChangeEntryPrice.Name
source: Changed Position Entry Price
ru: Цена входа в измененную позицию

# PositionChangeExitPrice.Name
source: Changed Position Exit Price
ru: Цена выхода из измененной позиции

# PositionIsVirtualHandler.Name
source: Position Is Virtual
ru: Виртуальная позиция?

# PositionIsVirtualClosedHandler.Name
source: Position Is Virtually Closed
ru: Виртуальный выход из позиции?

# Median.Name
source: Equity Drawdown
ru: Просадка (кривой) прибыли

# BuyCount.Name
source: Number of purchases
ru: СумСпрос

# SellCount.Name
source: Number of sales
ru: СумПредл

# BuyDeposit.Name
source: Buy Deposit
ru: Гарантийные обеспечения покупателя

# SellDeposit.Name
source: Sell Deposit
ru: Гарантийные обеспечения продавца

# HighestPos.Name
source: Bars since last high
ru: Баров с последнего максимума

# LowestPos.Name
source: Bars since last low
ru: Баров с последнего минимума

# SessionClose.Name
source: Session close
ru: Закрытие сессии

# SessionHeld.Name
source: Current Session Bar
ru: Текущий бар сессии

# SessionHigh.Name
source: Session high
ru: Максимум сессии

# SessionLow.Name
source: Session low
ru: Минимум сессии

# SessionOpen.Name
source: Session open
ru: Открытие сессии

# HoldSignalForNBars.NBars.Name
source: Bars count
ru: Количество баров

# PrepareLineForCanvasPane.Name
source: Prepare line
ru: Подготовить линию

# PrepareLineForCanvasPane.Description
source: Merge two series of numbers to InteractiveSeries
ru: Объединить две серии чисел в интерактивную линию

# ControlledBoolConst.Name
source: Controlled Boolean Constant
ru: Управляемая логическая константа

# ResettableControlledBoolConst.Name
source: Resettable Controlled Boolean Constant
ru: Сбрасываемая управляемая логическая константа

# BarsConstructorHandler.Name
source: Bars Constructor
ru: Конструктор баров

# Input.BarsConstructorHandler.1
source: Open
ru: Открытие

# Input.BarsConstructorHandler.2
source: Close
ru: Закрытие

# Input.BarsConstructorHandler.3
source: Maximum
ru: Максимум

# Input.BarsConstructorHandler.4
source: Mimimum
ru: Минимум

# Input.BarsConstructorHandler.5
source: Volume
ru: Объём

# TimeFrameKind.Name
source: Time frame kind
ru: Вид таймфрейма

# TopTimeFrame.Name
source: Top time frame
ru: Топ-таймфрейм

# TopTimeFrameUnit.Name
source: Top time frame unit
ru: Ед. изм. топ-таймфрейма

# PriceMode.Name
source: Price mode
ru: Режим цены

# TrimLevelPercent.Name
source: Trim level, %
ru: Уровень отсечки, %

# TrimValueMode.Name
source: Trim value mode
ru: Режим значения отсечки

# TrimValue.Name
source: Trim value
ru: Значение отсечки

# TrimComparisonMode.Name
source: Trim comparison mode
ru: Режим сравнения отсечки

# TrimAskQuantity.Name
source: Trim ask quantity
ru: Отсечка количества асков

# TrimBidQuantity.Name
source: Trim bid quantity
ru: Отсечка количества бидов

# TrimDeltaAskBidQuantity.Name
source: Trim delta ask bid quantity
ru: Отсечка разницы количества асков и бидов

# TrimRelativeDeltaAskBidQuantityPercent.Name
source: Trim relative delta ask bid quantity, %
ru: Отсечка относительной разницы количества асков и бидов, %

# TrimQuantity.Name
source: Trim quantity
ru: Отсечка количества

# TrimTradesCount.Name
source: Trim trades count
ru: Отсечка количества трэйдов

# UseTrimAskQuantity.Name
source: Use trim ask quantity
ru: Использовать отсечку количества асков

# UseTrimBidQuantity.Name
source: Use trim bid quantity
ru: Использовать отсечку количества бидов

# UseTrimDeltaAskBidQuantity.Name
source: Use trim delta ask bid quantity
ru: Использовать отсечку разницы количества асков и бидов

# UseTrimRelativeDeltaAskBidQuantityPercent.Name
source: Use trim relative delta ask bid quantity, %
ru: Использовать отсечку относительной разницы количества асков и бидов, %

# UseTrimQuantity.Name
source: Use trim quantity
ru: Использовать отсечку количества

# UseTrimTradesCount.Name
source: Use trim trades count
ru: Использовать отсечку количества трэйдов

# TrimTradesCountComparisonMode.Name
source: Trim trades count comparison mode
ru: Режим сравнения отсечки количества трэйдов

# TrimQuantityComparisonMode.Name
source: Trim quantity comparison mode
ru: Режим сравнения отсечки количества

# TrimAskQuantityComparisonMode.Name
source: Trim ask quantity comparison mode
ru: Режим сравнения отсечки количества асков

# TrimBidQuantityComparisonMode.Name
source: Trim bid quantity comparison mode
ru: Режим сравнения отсечки количества бидов

# TrimDeltaAskBidQuantityComparisonMode.Name
source: Trim delta ask bid quantity comparison mode
ru: Режим сравнения отсечки разницы количества асков и бидов

# TrimRelativeDeltaAskBidQuantityPercentComparisonMode.Name
source: Trim relative delta ask bid quantity comparison mode, %
ru: Режим сравнения отсечки относительной разницы количества асков и бидов, %

# ProfitKind.Name
source: Profit kind
ru: Вид дохода

# SessionStart.Name
source: Session start
ru: Начало сессии

# Message.Name
source: Message
ru: Сообщение

# SaveToGlobalCache.Name
source: Save to Global Cache
ru: Сохранить в Глобальный Кеш

# SaveToGlobalCache.Description
source: Save any indicator to Global Cache
ru: Сохранить значение любого индикатора в Глобальный Кеш

# SaveToGlobalCache.RepeatLastValue.Name
source: Repeat last value
ru: Повтор значения

# SaveToGlobalCache.RepeatLastValue.Description
source: Handler should repeat last known value to avoid further logic errors
ru: При true будет находить и использовать последнее известное значение

# SaveToGlobalCache.MaxValues.Name
source: Maximum numbers
ru: Максимальное количество

# SaveToGlobalCache.MaxValues.Description
source: Maximum number of stored values. If 0, then it will be limited by the number of bars
ru: Максимальное количество сохраняемых значений. Если 0, то будет ограничиваться количеством баров

# SaveToGlobalCache.SaveToStorage.Name
source: Save to disk
ru: Сохранять на диск

# SaveToGlobalCache.SaveToStorage.Description
source: Save to HDD to use indicator values across different program sessions
ru: Сохранять значения в файл на диске для повторного использования между перезапусками программы

# SaveToGlobalCache.ValuesName.Name
source: Values name
ru: Название значений

# SaveToGlobalCache.ValuesName.Description
source: Unique indicator name to be used to store values in Global Cache
ru: Уникальное название индикатора для целей сохранения в Глобальный Кеш

# LoadFromGlobalCache.Name
source: Load from Global Cache
ru: Загрузить из Глобального Кеша

# LoadFromGlobalCache.Description
source: Load indicator from Global Cache
ru: Загрузить значение индикатора из Глобального Кеша

# LoadFromGlobalCache.RepeatLastValue.Name
source: Repeat last value
ru: Повтор значения

# LoadFromGlobalCache.RepeatLastValue.Description
source: Handler should repeat last known value to avoid further logic errors
ru: При true будет находить и использовать последнее известное значение

# LoadFromGlobalCache.LoadFromStorage.Name
source: Load from disk
ru: Загружать с диска

# LoadFromGlobalCache.LoadFromStorage.Description
source: Load from HDD to use indicator values across different program sessions
ru: Загружать значения из файла на диске для повторного использования между перезапусками программы

# LoadFromGlobalCache.AgentName.Name
source: Agent name
ru: Имя агента

# LoadFromGlobalCache.AgentName.Description
source: Name of the agent that writes to Global Cache
ru: Имя агента, который пишет в Глобальный Кеш

# LoadFromGlobalCache.ValuesName.Name
source: Values name
ru: Название значений

# LoadFromGlobalCache.ValuesName.Description
source: Unique indicator name to be used to store values in Global Cache
ru: Уникальное название индикатора для целей сохранения в Глобальный Кеш

# LoadFromGlobalCache.OverrideSymbol.Name
source: Override security
ru: Переопределить инструмент

# LoadFromGlobalCache.OverrideSymbol.Description
source: Override security (use this ticker instead of handler's input)
ru: Переопределить инструмент (использовать это значение вместо полученного на входе блока)

# GlobalSkewOnF.RepeatLastSkew.Description
source: Handler should repeat last known value to avoid further logic errors
ru: При true будет находить и использовать последнее известное значение

# GlobalSkewOnF.SkewMode.Name
source: Skew mode
ru: Режим наклона

# GlobalSkewOnF.SkewMode.Description
source: Algorythm to get smile skew
ru: Алгоритм определения наклона улыбки

# ShowTrades.Name
source: Show all trades
ru: Показать все сделки

# ShowTrades.Description
source: Show all security trades on the Chart Pane
ru: Показать все сделки инструмента на Панели Графика

# BlackScholesGreeks.SigmaMult.Name
source: Width multiplier
ru: Множитель ширины

# BlackScholesGreeks.SigmaMult.Description
source: Width multiplier
ru: Множитель ширины

# OptionsBoardNumericalDelta.FixedQty.Name
source: Size
ru: Кол-во

# OptionsBoardNumericalDelta.FixedQty.Description
source: Entry size of this virtual position
ru: Объём открытия этой виртуальной позиции

# OwnOrders.ShowLongOrders.Name
source: Show long
ru: Показывать длинные

# OwnOrders.ShowLongOrders.Description
source: Show long or short orders
ru: Показывать длинные заявки или короткие?

# OwnPositionIv.DisplayIv.Name
source: Display IV
ru: Волатильность

# OwnPositionIv.DisplayIv.Description
source: Effective position volatility (only to display at UI)
ru: Эффективная волатильность позиции (только для отображения в интерфейсе)

# OwnPositionIvLine.DisplayIv.Name
source: Display IV
ru: Волатильность

# OwnPositionIvLine.DisplayIv.Description
source: Effective position volatility (only to display at UI)
ru: Эффективная волатильность позиции (только для отображения в интерфейсе)

# PositionsManagerSingle.Name
source: Positions Manager (single security)
ru: Менеджер позиций (один инструмент)

# PositionsManagerSingle.Description
source: Manager for virtual and real positions (single security)
ru: Управление виртуальными и реальными позициями (один инструмент)

# PositionsManagerSingle.BlockTrading.Name
source: Block Trading
ru: Блокировать торговлю

# PositionsManagerSingle.BlockTrading.Description
source: When true trading is completely blocked to avoid user misclick errors
ru: При true торговля будет полностью блокирована, чтобы избежать случайных кликов по котировкам

# PositionsManagerSingle.UseVirtualPositions.Name
source: Virtual Positions
ru: Виртуальные позиции

# PositionsManagerSingle.UseVirtualPositions.Description
source: When true it will create only virtual positions without sending orders in market
ru: При true будет создавать виртуальные позиции без выставления заявок в рынок

# PositionsManagerSingle.AgregatePositions.Name
source: Agregate positions
ru: Агрегировать позиции

# PositionsManagerSingle.AgregatePositions.Description
source: When true it will agregate positions of similar directions in one
ru: При true будет агрегировать позиции одинакового направления в одну общую

# PositionsManagerSingle.DropVirtualPos.Name
source: Drop Virtual Positions
ru: Очистить виртуальные позиции

# PositionsManagerSingle.DropVirtualPos.Description
source: Drop virtual positions
ru: Очистить виртуальные позиции

# PositionsManagerSingle.ImportRealPos.Name
source: Import Real Pos
ru: Импорт позиций

# PositionsManagerSingle.ImportRealPos.Description
source: Button to import real positions
ru: Кнопка импорта реальных позиций

# PositionsManagerSingle.UseGlobalCache.Name
source: Use Global Cache
ru: Использовать глобальный кеш

# PositionsManagerSingle.UseGlobalCache.Description
source: Use global cache
ru: Использовать глобальный кеш?

# PositionsManagerSingle.CheckSecurityTime.Name
source: Check security time
ru: Проверять время инструмента

# PositionsManagerSingle.CheckSecurityTime.Description
source: When true it will validate security time before sending order to market
ru: При true будет проверять время последнего бара в инструменте перед тем, как отправить заявку в рынок

# SingleSeriesNumericalSpeed.Name
source: Single Series Numerical Speed
ru: Численная скорость (одна серия)

# SingleSeriesNumericalSpeed.Description
source: Estimate 'Speed' profile with numerical differentiation
ru: Численный расчет грека 'Скорость' позиции (строит сразу профиль скорости)

# SingleSeriesNumericalSpeed.GreekAlgo.Name
source: Greek Algo
ru: Алгоритм улыбки

# SingleSeriesNumericalSpeed.GreekAlgo.Description
source: FrozenSmile - smile is frozen; ShiftingSmile - smile shifts horizontally without modification
ru: FrozenSmile -- улыбка заморожена; ShiftingSmile -- улыбка без искажений сдвигается по горизонтали вслед за БА

# SingleSeriesNumericalSpeed.TooltipFormat.Name
source: Tooltip Format
ru: Формат подсказки

# SingleSeriesNumericalSpeed.TooltipFormat.Description
source: Tooltip format (i.e. '0.00', '0.0##' etc)
ru: Формат числа для тултипа. Например, '0.00', '0.0##' и т.п.

# SingleSeriesNumericalSpeed.SigmaMult.Name
source: Width multiplier
ru: Множитель ширины

# SingleSeriesNumericalSpeed.SigmaMult.Description
source: Width multiplier
ru: Множитель ширины

# SingleSeriesNumericalSpeed.ShowNodes.Name
source: Show nodes
ru: Показывать узлы

# SingleSeriesNumericalSpeed.ShowNodes.Description
source: Nodes are shown when true
ru: При true будет показывать узлы на отображаемой линии

# Add.Description
source: Sum a few input values (from 2 to 6 inputs)
ru: Сложить несколько чисел (от 2 до 30 входов)

# And.Description
source: Logical conjunction of a few input values (from 2 to 30 inputs). Output is TRUE only if all inputs are TRUE at the same time.
ru: Операция логическое 'И' нескольких значений (от 2 до 6 входов). На выходе true, только если все входы одновременно имеют значение true.

# Ask.Description
source: Best sell price recorded at the end of every bar (if available).
ru: Цена лучшей продажи, запомненная в конце каждого бара (если доступно).

# AskQty.Description
source: Total offer size recorded at the end of every bar (if available)
ru: Суммарное предложение (количество асков), запомненное в конце каждого бара (если доступно)

# BarNumber.Description
source: An index of an element in a list of bars or numeric values.
ru: Индекс элемента в списке баров или числовых значений.

# BarsConstructorHandler.Description
source: Handler converts 5 input numeric series to a synthetic security with bars. Inputs are: open, close, high, low, volume.
ru: Кубик преобразует 5 числовых серий на входе в синтетический инструмент с барами. Порядок входов: открытие, закрытие, максимум, минимум, объем.

# Bid.Description
source: Best buy price recorded at the end of every bar (if available).
ru: Цена лучшей покупки, запомненная в конце каждого бара (если доступно).

# BidQty.Description
source: Total demand size recorded at the end of every bar (if available)
ru: Суммарный спрос (количество бидов), запомненное в конце каждого бара (если доступно)

# BoolBreaker.Description
source: Sets a FALSE value at every candle except the last one. For the last value sets a selected TRUE/FALSE value. This block is used together with the control pane buttons.
ru: Используется совместно с блоком 'Контрольная панель' для осуществления ручного управления кнопками на ней (режим полуавтоматической торговли). При нажатии на кнопку будет выдан true только для текущей свечи, что гарантирует, что сигнал будет выдан всегда на текущей свече.

# BoolConst.Description
source: This block sets a fixed boolean value for every bar.
ru: По аналогии с константой выдает фиксированное логическое значение на каждый бар.

# BuyCount.Description
source: Shows the number of purchases (bids). This value is shown also in 'Quotes' table.
ru: Суммарное текущее количество заявок на покупку. Эта же величина показывается в таблице 'Котировки'.

# Close.Description
source: Closing price of the bar.
ru: Цена закрытия бара.
