Repository: TSLab-Dev/Handlers
Catalog: Properties/Resources.*.resx
Languages: ru

# TrailStop.Description
source: This block is identical to 'Trailing stop absolute', but its parameters are in the percentage value.
ru: То же, что и 'Следящий стоп абс.', но параметры ведения задаются в процентах.

# TrailStopAbs.Description
source: The trailing stop, the values are given in absolute numbers. The block has 3 parameters describing 2 modes of functioning. [br]The 1st mode: Stop-loss is described as stop-loss, which sets the maximum fall (in case of short - growth) of the price you can accept. This fall is set in numbers. [br]The 2nd mode is selected if the price grows (in case of short the price falls) according to the value set in the parameter 'Enable Trail'. In other word he profit is being trailed. [br]The parameter 'Use the Calculated Price' allows to calculate Stop from the calculated opening price. In the Laboratory mode this is the opening price of the bar following the signal. In the real trade mode this is the price of position opening. Disabling this parameter causes using the real price received during the trading session. [br]The calculated price cannot be calculated if the box 'By Market at Fixed Price' is selected and slippage higher than 0 is set.
ru: Следящий стоп, значения ведения задаются в абсолютных величинах. У блока 3 параметра, которые описывают два режима работы: [br]1й режим - Стоп - лосс описывается параметром 'Стоп лосс', который задает максимальное падение (для шорта - рост) от цены входа, которые мы готовы принять. Это падение задается числом. [br]Во 2й режим блок переходит, если было зафиксировано увеличение цены (в случае шорта уменьшение) на величину заданную параметром 'Вкл. трейл'. [br]Важно! Переход в режим ведения происходит только в случае превышения ценой заданного уровня! В случае касания цены без превышения ведение не включается. В этом случае уровень поддержки на следующем баре вычисляется, как MFE(этого бара) минус параметр 'трейл лосс'. Иными словами, начинается 'ведение' прибыли. [br]Параметр 'Исп. расч. цену' позволяет вести расчет стопа от расчетной цены открытия. Для режима лаборатории это цена открытия, следующего за сигналом бара. Для режима реальных торгов это цена, по которой была выставлена заявка на открытие позиции. Отключение данного параметра приводит к использованию реальной цены открытия полученной в ходе торгов. [br]Расчетную цену невозможно рассчитать, если включена опция 'По рынку с фикс ценой' и задано проскальзывание отличное от 0.

# BuysHandler.QuantityMode.Name
source: Quantity units
ru: Единицы объема

# BuysHandler.QuantityMode.Description
source: Market volume quantity units (shares, lots, trades count)
ru: Режим отображения рыночной статистики (объем, лоты, количество сделок)

# BuysMinusSellsHandler.QuantityMode.Name
source: Quantity units
ru: Единицы объема

# BuysMinusSellsHandler.QuantityMode.Description
source: Market volume quantity units (shares, lots, trades count)
ru: Режим отображения рыночной статистики (объем, лоты, количество сделок)

# Compress.Shift.Name
source: Shift
ru: Сдвиг

# Compress.Shift.Description
source: Shift
ru: Сдвиг

# CompressAdvanced.Shift.Name
source: Shift
ru: Сдвиг

# CompressAdvanced.Shift.Description
source: Shift
ru: Сдвиг

# Decompres.Method.Name
source: Decompress algorythm
ru: Способ распаковки свечей

# Decompres.Method.Description
source: Decompress algorythm
ru: Метод распаковки свечей

# DecompresBool.Method.Name
source: Decompress algorythm
ru: Способ распаковки свечей

# DecompresBool.Method.Description
source: Decompress algorythm
ru: Метод распаковки свечей

# FAMA.FastLimit.Name
source: Fast limit
ru: Быстрый лимит

# FAMA.FastLimit.Description
source: Fast limit parameter
ru: Быстрый параметр

# FAMA.SlowLimit.Name
source: Slow limit
ru: Медленный лимит

# FAMA.SlowLimit.Description
source: Slow limit parameter
ru: Медленный параметр

# InteractiveConstGen.IsNeedRecalculate.Name
source: Recalculate agent?
ru: Пересчитать агент?

# InteractiveConstGen.IsNeedRecalculate.Description
source: Recalculate agent when line changes its parameters
ru: Пересчет агента, если изменяются параметры линии

# InteractiveLineGen.Mode.Name
source: Line type
ru: Вид линии

# InteractiveLineGen.Mode.Description
source: Line type (finit, infinit, ray)
ru: Вид линии (отрезок, луч, прямая)

# InteractiveLineGen.FirstDateTime.Name
source: First date
ru: Первая дата

# InteractiveLineGen.FirstDateTime.Description
source: Date of a first point
ru: Дата первой точки

# InteractiveLineGen.SecondDateTime.Name
source: Second date
ru: Вторая дата

# InteractiveLineGen.SecondDateTime.Description
source: Date of a second point
ru: Дата второй точки

# InteractiveLineGen.IsNeedRecalculate.Name
source: Recalculate agent?
ru: Пересчитать агент?

# InteractiveLineGen.IsNeedRecalculate.Description
source: Recalculate agent when line changes its parameters
ru: Пересчет агента, если изменяются параметры линии

# MACDEx.Period1.Name
source: First period
ru: Первый период

# MACDEx.Period1.Description
source: First EMA period
ru: Период первого мувинга (типа EMA)

# MACDEx.Period2.Name
source: Second period
ru: Второй период

# MACDEx.Period2.Description
source: Second EMA period
ru: Период второго мувинга (типа EMA)

# MACDSig.Period.Name
source: Period
ru: Период

# MACDSig.Period.Description
source: Signal EMA period
ru: Период сигнального мувинга (типа EMA)

# MAMA.FastLimit.Name
source: Fast limit
ru: Быстрый лимит

# MAMA.FastLimit.Description
source: Fast limit parameter
ru: Быстрый параметр

# MAMA.SlowLimit.Name
source: Slow limit
ru: Медленный лимит

# MAMA.SlowLimit.Description
source: Slow limit parameter
ru: Медленный параметр

# MessageHandler.Message.Name
source: Message
ru: Сообщение

# MessageHandler.Message.Description
source: Message
ru: Сообщение

# MessageHandler.Tag.Name
source: Tag
ru: Метка

# MessageHandler.Tag.Description
source: Additional user tag
ru: Дополнительная пользовательская метка

# MessageHandler.Type.Name
source: Importance
ru: Важность

# MessageHandler.Type.Description
source: Message importance (Info, Warning, Error)
ru: Важность сообщения (Info, Warning, Error)

# ParabolicSAR.AccelerationStart.Name
source: Acceleration start
ru: Начальное ускорение

# ParabolicSAR.AccelerationStart.Description
source: Initial acceleration
ru: Начальное ускорение

# ParabolicSAR.AccelerationStep.Name
source: Acceleration step
ru: Шаг увеличения ускорения

# ParabolicSAR.AccelerationStep.Description
source: Step to increase acceleration
ru: Шаг увеличения ускорения

# ParabolicSAR.AccelerationMax.Name
source: Acceleration max
ru: Максимальное ускорение

# ParabolicSAR.AccelerationMax.Description
source: Acceleration limit
ru: Максимальное ускорение

# RelativeForPeriod.TimeFrame.Name
source: Timeframe
ru: Интервал

# RelativeForPeriod.TimeFrame.Description
source: Timeframe (format D.HH:MM:SS)
ru: Интервал (формат Д.ЧЧ:ММ:СС)

# SellsHandler.QuantityMode.Name
source: Quantity units
ru: Единицы объема

# SellsHandler.QuantityMode.Description
source: Market volume quantity units (shares, lots, trades count)
ru: Режим отображения рыночной статистики (объем, лоты, количество сделок)

# SessionClose.Session.Name
source: Session
ru: Сессия

# SessionClose.Session.Description
source: Session
ru: Сессия

# SessionHigh.Session.Name
source: Session
ru: Сессия

# SessionHigh.Session.Description
source: Session
ru: Сессия

# SessionLow.Session.Name
source: Session
ru: Сессия

# SessionLow.Session.Description
source: Session
ru: Сессия

# SessionOpen.Session.Name
source: Session
ru: Сессия

# SessionOpen.Session.Description
source: Session
ru: Сессия

# SMMA.Shift.Name
source: Shift
ru: Сдвиг

# SMMA.Shift.Description
source: Shift
ru: Сдвиг

# SumForTimeFrameHandler.TimeFrame.Name
source: Timeframe
ru: Интервал

# SumForTimeFrameHandler.TimeFrame.Description
source: Timeframe (format D.HH:MM:SS)
ru: Интервал (формат Д.ЧЧ:ММ:СС)

# VolumeForPeriodHandler.TimeFrame.Name
source: Timeframe
ru: Интервал

# VolumeForPeriodHandler.TimeFrame.Description
source: Timeframe (integer value in units of parameter 'Timeframe units')
ru: Интервал (целое число в единицах параметра 'База интервала')

# VolumeForPeriodHandler.TimeFrameUnit.Name
source: Timeframe units
ru: База интервала

# VolumeForPeriodHandler.TimeFrameUnit.Description
source: Timeframe units (second, minute, hour, day)
ru: База интервала (секунды, минуты, часы, дни)

# VolumeForPeriodHandler.ValueMode.Name
source: Processing algo
ru: Алгоритм вычислений

# VolumeForPeriodHandler.ValueMode.Description
source: Processing algo (sum or average)
ru: Алгоритм вычислений (сумма или среднее)

# NumDaysProfit.ProfitKind.Name
source: Profit kind
ru: Тип прибыли

# NumDaysProfit.ProfitKind.Description
source: Profit kind (fixed or unfixed)
ru: Тип прибыли (фиксированная или плавающая)

# NumMinutesProfit.ProfitKind.Name
source: Profit kind
ru: Тип прибыли

# NumMinutesProfit.ProfitKind.Description
source: Profit kind (fixed or unfixed)
ru: Тип прибыли (фиксированная или плавающая)

# NumPositionsProfit.ProfitKind.Name
source: Profit kind
ru: Тип прибыли

# NumPositionsProfit.ProfitKind.Description
source: Profit kind (fixed or unfixed)
ru: Тип прибыли (фиксированная или плавающая)

# RelativeCommisionWithMinimal.MarginPct.Name
source: Margin, %
ru: Маржа, %

# RelativeCommisionWithMinimal.MarginPct.Description
source: Margin to open or to keep position (as percents)
ru: Обеспечение (доля средств) для поддержания позиции (в процентах)

# RelativeCommission.MarginPct.Name
source: Margin, %
ru: Маржа, %

# RelativeCommission.MarginPct.Description
source: Margin to open or to keep position (as percents)
ru: Обеспечение (доля средств) для поддержания позиции (в процентах)

# WholeDayProfit.SessionStart.Name
source: Session start
ru: Начало сессии

# WholeDayProfit.SessionStart.Description
source: Trading session start (format HH:MM:SS)
ru: Время начала торговой сессии (формат ЧЧ:ММ:СС)

# WholeDayProfit.ProfitKind.Name
source: Profit kind
ru: Тип прибыли

# WholeDayProfit.ProfitKind.Description
source: Profit kind (fixed or unfixed)
ru: Тип прибыли (фиксированная или плавающая)

# WholeTimeProfit.ProfitKind.Name
source: Profit kind
ru: Тип прибыли

# WholeTimeProfit.ProfitKind.Description
source: Profit kind (fixed or unfixed)
ru: Тип прибыли (фиксированная или плавающая)

# TrailStop.StopLoss.Name
source: Stop loss
ru: Стоплосс

# TrailStop.StopLoss.Description
source: Initial stop loss
ru: Начальный уровень стоплосса

# TrailStop.TrailEnable.Name
source: Trail enable
ru: Включение трейла

# TrailStop.TrailEnable.Description
source: Where to start actual trailing
ru: На каком уровне начинать двигать стоп

# TrailStop.TrailLoss.Name
source: Trail loss
ru: Подтягивать стоп

# TrailStop.TrailLoss.Description
source: Trail loss
ru: Сколько должна пройти цена, чтобы стоп передвинулся

# TrailStop.UseCalcPrice.Name
source: Use calc price
ru: Исп. расчетную цену

# TrailStop.UseCalcPrice.Description
source: Use calculated price
ru: Использовать расчетную цену

# TrailStopAbs.StopLoss.Name
source: Stop loss
ru: Стоплосс

# TrailStopAbs.StopLoss.Description
source: Initial stop loss
ru: Начальный уровень стоплосса

# TrailStopAbs.TrailEnable.Name
source: Trail enable
ru: Включение трейла

# TrailStopAbs.TrailEnable.Description
source: Where to start actual trailing
ru: На каком уровне начинать двигать стоп

# TrailStopAbs.TrailLoss.Name
source: Trail loss
ru: Подтягивать стоп

# TrailStopAbs.TrailLoss.Description
source: Trail loss
ru: Сколько должна пройти цена, чтобы стоп передвинулся

# TrailStopAbs.UseCalcPrice.Name
source: Use calc price
ru: Исп. расчетную цену

# TrailStopAbs.UseCalcPrice.Description
source: Use calculated price
ru: Использовать расчетную цену

# TemplateLibrary.Pane
source: Chart pane
ru: Панель графика

# AlignedSecurityHandler.TimeFrame.Name
source: Timeframe
ru: Интервал

# AlignedSecurityHandler.TimeFrame.Description
source: Timeframe (integer value in units of parameter 'Timeframe units')
ru: Интервал (целое число в единицах параметра 'База интервала')

# AlignedSecurityHandler.TimeFrameUnit.Name
source: Timeframe units
ru: База интервала

# AlignedSecurityHandler.TimeFrameUnit.Description
source: Timeframe units (second, minute, hour, day)
ru: База интервала (секунды, минуты, часы, дни)

# AllTimeTradeStatisticsHandler.WidthPercent.Name
source: Width, %
ru: Ширина, %

# AllTimeTradeStatisticsHandler.WidthPercent.Description
source: A width of a hystogram relative to a width of a chart pane.
ru: Ширина гистограммы в процентах относительно ширины панели графика.

# AllTimeTradeStatisticsHandler.CombinePricesCount.Name
source: Combine price steps
ru: Объединять шаги цены

# AllTimeTradeStatisticsHandler.CombinePricesCount.Description
source: How many price steps should be grouped together.
ru: Осуществление выбора шага цены, используемого для группировки цен.

# AllTimeTradeStatisticsHandler.Kind.Name
source: Kind
ru: Вид

# AllTimeTradeStatisticsHandler.Kind.Description
source: Kind of a trade statistics (trades count, trade volume, buy count, sell count, buy and sell difference, relative buy and sell difference).
ru: Вид торговой статистики (количество сделок, объем торгов, количество покупок, количество продаж, разница количества покупок и продаж, относительная разница количества покупок и продаж).

# LastContractsTradeStatisticsHandler.ContractsCount.Name
source: Contracts count
ru: Количество контрактов

# LastContractsTradeStatisticsHandler.ContractsCount.Description
source: A parameter to set contracts count to be used for trade statistics.
ru: Осуществляет выбор количества контрактов, за которые должна отображаться торговая статистика.

# LastContractsTradeStatisticsHandler.CombinePricesCount.Name
source: Combine price steps
ru: Объединять шаги цены

# LastContractsTradeStatisticsHandler.CombinePricesCount.Description
source: How many price steps should be grouped together.
ru: Осуществление выбора шага цены, используемого для группировки цен.

# LastContractsTradeStatisticsHandler.Kind.Name
source: Kind
ru: Вид

# LastContractsTradeStatisticsHandler.Kind.Description
source: Kind of a trade statistics (trades count, trade volume, buy count, sell count, buy and sell difference, relative buy and sell difference).
ru: Вид торговой статистики (количество сделок, объем торгов, количество покупок, количество продаж, разница количества покупок и продаж, относительная разница количества покупок и продаж).

# LastTradeStatisticsHandler.TimeFrame.Name
source: Timeframe
ru: Интервал

# LastTradeStatisticsHandler.TimeFrame.Description
source: Timeframe (integer value in units of parameter 'Timeframe units')
ru: Интервал (целое число в единицах параметра 'База интервала')

# LastTradeStatisticsHandler.TimeFrameUnit.Name
source: Timeframe units
ru: База интервала

# LastTradeStatisticsHandler.TimeFrameUnit.Description
source: Timeframe units (second, minute, hour, day)
ru: База интервала (секунды, минуты, часы, дни)

# LastTradeStatisticsHandler.CombinePricesCount.Name
source: Combine price steps
ru: Объединять шаги цены

# LastTradeStatisticsHandler.CombinePricesCount.Description
source: How many price steps should be grouped together.
ru: Осуществление выбора шага цены, используемого для группировки цен.

# LastTradeStatisticsHandler.Kind.Name
source: Kind
ru: Вид

# LastTradeStatisticsHandler.Kind.Description
source: Kind of a trade statistics (trades count, trade volume, buy count, sell count, buy and sell difference, relative buy and sell difference).
ru: Вид торговой статистики (количество сделок, объем торгов, количество покупок, количество продаж, разница количества покупок и продаж, относительная разница количества покупок и продаж).

# TradeStatisticsBarsCountHandler.TrimValue.Name
source: Trim value
ru: Значение отсечки

# TradeStatisticsBarsCountHandler.TrimValue.Description
source: Trim value.
ru: Выбор значения отсечки.

# TradeStatisticsBarsCountHandler.TrimComparisonMode.Name
source: Comparison operator
ru: Режим сравнения отсечки

# TradeStatisticsBarsCountHandler.TrimComparisonMode.Description
source: Comparison operator for trimming (greater, greater or equal, less, less or equal, equal, not equal).
ru: Оператор сравнения для формирования отсечек (больше, больше или равно, меньше, меньше или равно, равно, не равно).

# TradeStatisticsBarsSumHandler.TrimValue.Name
source: Trim value
ru: Значение отсечки

# TradeStatisticsBarsSumHandler.TrimValue.Description
source: Trim value.
ru: Выбор значения отсечки.

# TradeStatisticsBarsSumHandler.TrimComparisonMode.Name
source: Comparison operator
ru: Режим сравнения отсечки

# TradeStatisticsBarsSumHandler.TrimComparisonMode.Description
source: Comparison operator for trimming (greater, greater or equal, less, less or equal, equal, not equal).
ru: Оператор сравнения для формирования отсечек (больше, больше или равно, меньше, меньше или равно, равно, не равно).

# TradeStatisticsExtendedBarsCountHandler.TrimComparisonMode.Name
source: Comparison operator
ru: Режим сравнения отсечки

# TradeStatisticsExtendedBarsCountHandler.TrimComparisonMode.Description
source: Comparison operator for trimming (greater, greater or equal, less, less or equal, equal, not equal).
ru: Оператор сравнения для формирования отсечек (больше, больше или равно, меньше, меньше или равно, равно, не равно).

# TradeStatisticsExtendedBarsSumHandler.Kind.Name
source: Kind
ru: Вид

# TradeStatisticsExtendedBarsSumHandler.Kind.Description
source: Kind of a trade statistics (trades count, trade volume, buy count, sell count, buy and sell difference, relative buy and sell difference).
ru: Вид торговой статистики (количество сделок, объем торгов, количество покупок, количество продаж, разница количества покупок и продаж, относительная разница количества покупок и продаж).

# TradeStatisticsExtendedBarsSumHandler.TrimComparisonMode.Name
source: Comparison operator
ru: Режим сравнения отсечки

# TradeStatisticsExtendedBarsSumHandler.TrimComparisonMode.Description
source: Comparison operator for trimming (greater, greater or equal, less, less or equal, equal, not equal).
ru: Оператор сравнения для формирования отсечек (больше, больше или равно, меньше, меньше или равно, равно, не равно).

# TradeStatisticsExtendedBarsSumHandler2.Kind.Name
source: Kind
ru: Вид

# TradeStatisticsExtendedBarsSumHandler2.Kind.Description
source: Kind of a trade statistics (trades count, trade volume, buy count, sell count, buy and sell difference, relative buy and sell difference).
ru: Вид торговой статистики (количество сделок, объем торгов, количество покупок, количество продаж, разница количества покупок и продаж, относительная разница количества покупок и продаж).

# TradeStatisticsExtendedExtremumPriceHandler.PriceMode.Name
source: Extremum kind
ru: Вид экстремума

# TradeStatisticsExtendedExtremumPriceHandler.PriceMode.Description
source: Extremum kind (minimum, maximum).
ru: Вид экстремума (минимум, максимум)

# TradeStatisticsExtendedExtremumPriceHandler2.PriceMode.Name
source: Extremum kind
ru: Вид экстремума

# TradeStatisticsExtendedExtremumPriceHandler2.PriceMode.Description
source: Extremum kind (minimum, maximum).
ru: Вид экстремума (минимум, максимум)

# TradeStatisticsExtremumPriceHandler.TrimValueMode.Name
source: Trim value mode
ru: Режим значения отсечки

# TradeStatisticsExtremumPriceHandler.TrimValue.Name
source: Trim value
ru: Значение отсечки

# TradeStatisticsExtremumPriceHandler.TrimValue.Description
source: Trim value.
ru: Выбор значения отсечки.

# TradeStatisticsExtremumPriceHandler.PriceMode.Name
source: Extremum kind
ru: Вид экстремума

# TradeStatisticsExtremumPriceHandler.PriceMode.Description
source: Extremum kind (minimum, maximum).
ru: Вид экстремума (минимум, максимум)

# TradeStatisticsHandler.TimeFrameKind.Name
source: Time frame kind
ru: Вид таймфрейма

# TradeStatisticsHandler.TimeFrameKind.Description
source: Time frame kind (from now to past, from midnight to now).
ru: Вид таймфрейма (из настоящего в прошлое, от полуночи в настоящее).

# TradeStatisticsHandler.StartTime.Name
source: Start time
ru: Время начала

# TradeStatisticsHandler.StartTime.Description
source: Start building a profile.
ru: Начало построения профиля.

# TradeStatisticsHandler.TimeFrame.Name
source: Timeframe
ru: Интервал

# TradeStatisticsHandler.TimeFrame.Description
source: Timeframe (integer value in units of parameter 'Timeframe units')
ru: Интервал (целое число в единицах параметра 'База интервала')

# TradeStatisticsHandler.TimeFrameUnit.Name
source: Timeframe units
ru: База интервала

# TradeStatisticsHandler.TimeFrameUnit.Description
source: Timeframe units (second, minute, hour, day)
ru: База интервала (секунды, минуты, часы, дни)

# TradeStatisticsHandler.CombinePricesCount.Name
source: Combine price steps
ru: Объединять шаги цены

# TradeStatisticsHandler.CombinePricesCount.Description
source: How many price steps should be grouped together.
ru: Осуществление выбора шага цены, используемого для группировки цен.

# TradeStatisticsHandler.Kind.Name
source: Kind
ru: Вид

# TradeStatisticsHandler.Kind.Description
source: Kind of a trade statistics (trades count, trade volume, buy count, sell count, buy and sell difference, relative buy and sell difference).
ru: Вид торговой статистики (количество сделок, объем торгов, количество покупок, количество продаж, разница количества покупок и продаж, относительная разница количества покупок и продаж).

# TradeStatisticsLowerEdgeHandler.TrimLevelPercent.Name
source: Trim level, %
ru: Уровень отсечки, %

# TradeStatisticsLowerEdgeHandler.TrimLevelPercent.Description
source: Trim level (as percents).
ru: Позволяет установить значение отсечки в процентах.

# TradeStatisticsUpperEdgeHandler.TrimLevelPercent.Name
source: Trim level, %
ru: Уровень отсечки, %

# TradeStatisticsUpperEdgeHandler.TrimLevelPercent.Description
source: Trim level (as percents).
ru: Позволяет установить значение отсечки в процентах.

# LastContractsTradeStatisticsHandler.WidthPercent.Name
source: Width, %
ru: Ширина, %

# LastContractsTradeStatisticsHandler.WidthPercent.Description
source: A width of a hystogram relative to a width of a chart pane.
ru: Ширина гистограммы в процентах относительно ширины панели графика.

# LastTradeStatisticsHandler.WidthPercent.Name
source: Width, %
ru: Ширина, %

# LastTradeStatisticsHandler.WidthPercent.Description
source: A width of a hystogram relative to a width of a chart pane.
ru: Ширина гистограммы в процентах относительно ширины панели графика.

# TradeStatisticsHandler.WidthPercent.Name
source: Width, %
ru: Ширина, %

# TradeStatisticsHandler.WidthPercent.Description
source: A width of a hystogram relative to a width of a chart pane.
ru: Ширина гистограммы в процентах относительно ширины панели графика.

# Quantity.Name
source: Position size
ru: Количество

# Direction.Name
source: Direction
ru: Направление

# SpecifiedQuantityPriceAtTradeHandler.Name
source: Specified quantity price at trade
ru: Цена указанного количества в сделке

# SpecifiedQuantityPriceAtTradeHandler.Description
source: Specified quantity price at trade
ru: Цена указанного количества в сделке

# SpecifiedQuantityPriceAtTradeHandler.Quantity.Name
source: Quantity
ru: Количество

# SpecifiedQuantityPriceAtTradeHandler.Quantity.Description
source: Quantity
ru: Количество

# SpecifiedQuantityPriceAtTradeHandler.Direction.Name
source: Direction
ru: Направление

# SpecifiedQuantityPriceAtTradeHandler.Direction.Description
source: Direction
ru: Направление

# BarsCountForValuesSumHandler.Name
source: Number of bars for the sum of values
ru: Количество баров для суммы значений

# BarsCountForValuesSumHandler.Description
source: Number of bars for the sum of values
ru: Количество баров для суммы значений

# BarsCountForValuesSumHandler.ValuesSum.Name
source: Values sum
ru: Сумма значений
