Repository: TSLab-Dev/Handlers
Catalog: Properties/Resources.*.resx
Languages: ru

# NumericalVegaOnF.Name
source: Numerical Vega ATM
ru: Численная вега на деньгах

# NumericalVegaOnF.Description
source: Numerical estimate of vega at-the-money (only one point is processed)
ru: Численный расчет веги позиции в текущей точке БА (вычисляется одна точка)

# NumericalVegaOnF.SigmaStep.Name
source: Sigma step
ru: Шаг сигмы

# NumericalVegaOnF.SigmaStep.Description
source: Sigma step for numerical derivative
ru: Шаг варьирования сигмы при дифференцировании

# NumericalVegaOnF.GreekAlgo.Name
source: Greek algo
ru: Алгоритм улыбки

# NumericalVegaOnF.GreekAlgo.Description
source: FrozenSmile - smile is frozen; ShiftingSmile - smile shifts horizontally without modification
ru: FrozenSmile -- улыбка заморожена; ShiftingSmile -- улыбка без искажений сдвигается по горизонтали вслед за БА

# NumericalVegaOnF.Vega.Name
source: Vega
ru: Вега

# NumericalVegaOnF.Vega.Description
source: Current vega (just to show it on ControlPane)
ru: Текущая вега всей позиции (для отображения в интерфейсе агента)

# NumericalVommaOnF.Name
source: Numerical Vomma ATM
ru: Численная вомма на деньгах

# NumericalVommaOnF.Description
source: Numerical estimate of vomma at-the-money (only one point is processed)
ru: Численный расчет воммы позиции в текущей точке БА (вычисляется одна точка)

# NumericalVommaOnF.SigmaStep.Name
source: Sigma step
ru: Шаг сигмы

# NumericalVommaOnF.SigmaStep.Description
source: Sigma step for numerical derivative
ru: Шаг варьирования сигмы при дифференцировании

# NumericalVommaOnF.GreekAlgo.Name
source: Greek algo
ru: Алгоритм улыбки

# NumericalVommaOnF.GreekAlgo.Description
source: FrozenSmile - smile is frozen; ShiftingSmile - smile shifts horizontally without modification
ru: FrozenSmile -- улыбка заморожена; ShiftingSmile -- улыбка без искажений сдвигается по горизонтали вслед за БА

# NumericalVommaOnF.Vomma.Name
source: Vomma
ru: Вомма

# NumericalVommaOnF.Vomma.Description
source: Current vomma (just to show it on ControlPane)
ru: Текущая вомма всей позиции (для отображения в интерфейсе агента)

# OpenVirtualFutPosition2.Name
source: Open Virtual Fut Pos (bar)
ru: Открыть вирт. позу в БА (бары)

# OpenVirtualFutPosition2.Description
source: Open virtual position in base asset (bar handler)
ru: Создание виртуальной позиции по БА (побарный обработчик)

# OpenVirtualOptPosition2.Name
source: Open Virtual Opt Pos (bar)
ru: Открыть вирт. позицию в опционах (бары)

# OpenVirtualOptPosition2.Description
source: Open virtual position in options (bar handler)
ru: Создание виртуальной позиции в опционах (побарный обработчик)

# OptionBase2.Name
source: Base asset
ru: Базовый актив

# OptionBase2.Description
source: Base asset (bar handler)
ru: Базовый актив (побарный обработчик)

# OptionSeriesByNumber2.Name
source: Option Series by Number
ru: Серия по номеру

# OptionSeriesByNumber2.Description
source: Handler to get option series by its index. Series are sorted ascending from near (index 1) to further. It's bar handler.
ru: Получение опционной серии по её индексу. Серии отсортированы по порядку от ближней (индекс 1) к дальним. Побарный обработчик.

# OwnOrders.Name
source: Own orders
ru: Свои заявки

# OwnOrders.Description
source: Own active orders
ru: Свои активные заявки

# OwnOrders.ReturnPct.Name
source: Return Pct
ru: Расчет в процентах

# OwnOrders.ReturnPct.Description
source: Values are calculated as percents
ru: При true результат будет вычислен в процентах

# OwnOrders.ShowNodes.Name
source: Show Nodes
ru: Показывать узлы

# OwnOrders.ShowNodes.Description
source: Nodes are shown when true
ru: При true будет показывать узлы на отображаемой линии

# OwnOrders.MinStrike.Name
source: Min Strike
ru: Минимальный страйк

# OwnOrders.MinStrike.Description
source: Min strike to be processed by handler
ru: Минимальный обрабатываемый страйк

# OwnOrders.MaxStrike.Name
source: Max Strike
ru: Максимальный страйк

# OwnOrders.MaxStrike.Description
source: Max strike to be processed by handler
ru: Максимальный обрабатываемый страйк

# OwnOrders.StrikeStep.Name
source: Strike Step
ru: Шаг страйков

# OwnOrders.StrikeStep.Description
source: Strike step
ru: Шаг между страйками

# OwnOrders.TooltipFormat.Name
source: Tooltip Format
ru: Формат подсказки

# OwnOrders.TooltipFormat.Description
source: Tooltip format (i.e. '0.00', '0.0##' etc)
ru: Формат числа для тултипа. Например, '0.00', '0.0##' и т.п.

# OwnPositionIv.Name
source: Own position IV (num)
ru: Волатильность позиции (число)

# OwnPositionIv.Description
source: Own position IV (effective volatility that makes current profit to become zero)
ru: Волатильность своей позиции (такая волатильность, чтобы текущая прибыль стала нуль)

# OwnPositionIv.ShowLongPositions.Name
source: Show long
ru: Показывать длинные

# OwnPositionIv.ShowLongPositions.Description
source: Show long or short positions
ru: Показывать длинные позиции или короткие?

# OwnPositionIv.DisplayUnits.Name
source: Display units
ru: Единицы отображения

# OwnPositionIv.DisplayUnits.Description
source: Display units (hundreds, thousands, as is)
ru: Единицы отображения (сотни, тысячи, как есть)

# OwnPositionIvLine.Name
source: Own position IV (line)
ru: Волатильность позиции (линия)

# OwnPositionIvLine.Description
source: Own position IV (effective volatility that makes current profit to become zero)
ru: Волатильность своей позиции (такая волатильность, чтобы текущая прибыль стала нуль)

# OwnPositionIvLine.ShowLongPositions.Name
source: Show long
ru: Показывать длинные

# OwnPositionIvLine.ShowLongPositions.Description
source: Show long or short positions
ru: Показывать длинные позиции или короткие?

# OwnPositionIvLine.DisplayUnits.Name
source: Display units
ru: Единицы отображения

# OwnPositionIvLine.DisplayUnits.Description
source: Display units (hundreds, thousands, as is)
ru: Единицы отображения (сотни, тысячи, как есть)

# SellOptions.Name
source: Sell Options
ru: Продажа опционов

# SellOptions.Description
source: Sell options while position risk is 'small'
ru: Продажа опционов до заданного уровня риска

# SellOptionGroup.Name
source: Sell option group
ru: Продажа группы опционов

# SellOptionGroup.Description
source: Sell many options while position risk is 'small'
ru: Продажа группы опционов до заданного уровня риска

# SellOptionGroupDelta.Name
source: Sell option group (delta range)
ru: Продажа группы опционов (диапазон по дельте)

# SellOptionGroupDelta.Description
source: Sell many options while position risk is 'small' (strike range is set in units of delta)
ru: Продажа группы опционов до заданного уровня риска (диапазон страйков задается в единицах дельты)

# SetViewport.Name
source: Set Viewport
ru: Настройка графика

# SetViewport.Description
source: Configure chart visible region: ranges of axes, grid step, etc.
ru: Блок для настройки видимой области графика -- диапазоны по осям, шаг сетки и т.п.

# SingleSeriesNumericalDelta.Name
source: Single Series Numerical Delta
ru: Численная дельта (одна серия)

# SingleSeriesNumericalDelta.Description
source: Estimates a delta profile with numerical differentiation (build a delta profile)
ru: Численный расчет дельты позиции (строит сразу профиль дельты)

# SingleSeriesNumericalDelta3.Name
source: Numerical Delta (IntSer)
ru: Численная дельта (IntSer)

# SingleSeriesNumericalDelta3.Description
source: Estimates a delta using a position profile
ru: Численный расчет дельты позиции непосредственно на основе её профиля

# SingleSeriesNumericalGamma.Name
source: Single Series Numerical Gamma
ru: Численная гамма (одна серия)

# SingleSeriesNumericalGamma.Description
source: Estimates a gamma profile with numerical differentiation
ru: Численный расчет гаммы позиции (строит сразу профиль гаммы)

# SingleSeriesNumericalGamma3.Name
source: Numerical Gamma (IntSer)
ru: Численная гамма (IntSer)

# SingleSeriesNumericalGamma3.Description
source: Estimates a gamma position using its delta profile
ru: Численный расчет гаммы позиции непосредственно на основе её профиля дельты

# SingleSeriesNumericalTheta.Name
source: Single Series Numerical Theta
ru: Численная тета (одна серия)

# SingleSeriesNumericalTheta.Description
source: Estimates a theta profile with numerical differentiation (build a theta profile)
ru: Численный расчет теты позиции (строит сразу профиль теты)

# SingleSeriesNumericalVega.Name
source: Single Series Numerical Vega
ru: Численная вега (одна серия)

# SingleSeriesNumericalVega.Description
source: Estimates a vega profile with numerical differentiation (build a vega profile)
ru: Численный расчет веги позиции (строит сразу профиль веги)

# SingleSeriesPositionGrid.Name
source: Single Series Position Grid
ru: Таблица позиции (одна серия)

# SingleSeriesPositionGrid.Description
source: Grid of entire option position (count semistraddles)
ru: Таблица набранной позиции для одиночной опционной серии (в полустреддлах)

# SingleSeriesPositionList.Name
source: Single Series Position List
ru: Список трейдов (одна серия)

# SingleSeriesPositionList.Description
source: A list of all user's trades in one option series
ru: Таблица своих трейдов в одной опционной серии

# SingleSeriesProfile.Name
source: Single Series Profile
ru: Профиль позиции (одна серия)

# SingleSeriesProfile.Description
source: A single series position profile (change of currency rate is not included) as a function of BA price
ru: Профиль позиции для одиночной опционной серии (без учета валютной составляющей) как функция цены БА

# SingleSeriesProfile.SigmaMult.Name
source: Width multiplier
ru: Множитель ширины

# SingleSeriesProfile.SigmaMult.Description
source: Width multiplier
ru: Множитель ширины

# SingleSeriesProfile.ShowNodes.Name
source: Show nodes
ru: Показывать узлы

# SingleSeriesProfile.ShowNodes.Description
source: Nodes are shown when true
ru: При true будет показывать узлы на отображаемой линии

# SingleSeriesProfile.NodesCount.Name
source: Nodes Count
ru: Доп. узлы

# SingleSeriesProfile.NodesCount.Description
source: Number of additional nodes near money
ru: Количество дополнительных узлов около денег

# SingleSeriesProfile.GreekAlgo.Name
source: Greek Algo
ru: Алгоритм улыбки

# SingleSeriesProfile.GreekAlgo.Description
source: FrozenSmile - smile is frozen; ShiftingSmile - smile shifts horizontally without modification
ru: FrozenSmile -- улыбка заморожена; ShiftingSmile -- улыбка без искажений сдвигается по горизонтали вслед за БА

# SingleSeriesProfile.TooltipFormat.Name
source: Tooltip Format
ru: Формат подсказки

# SingleSeriesProfile.TooltipFormat.Description
source: Tooltip format (i.e. '0.00', '0.0##' etc)
ru: Формат числа для тултипа. Например, '0.00', '0.0##' и т.п.

# SingleSeriesProfile.TwoSideDelta.Name
source: Two side delta
ru: Две дельты

# SingleSeriesProfile.TwoSideDelta.Description
source: Calculate delta to the left and to the right from the strike
ru: Вычислить дельту с двух сторон от страйка

# SmileImitation3.Name
source: Smile Imitation v3
ru: Имитация улыбки v3

# SmileImitation3.Description
source: Smile imitation using arbitrary function with 3 parameters
ru: Имитация улыбки произвольной трёхпараметрической функцией

# SmileImitation5.Name
source: Smile Imitation v5
ru: Имитация улыбки v5

# SmileImitation5.Description
source: Smile imitation using application-wide user function in Global Cache
ru: Имитация улыбки, используя пользовательскую функцию в глобальном кеше

# TotalCommission.Name
source: Total Commission
ru: Полная комиссия

# TotalCommission.Description
source: Total commission including closed positions
ru: Полная комиссия за время жизни скрипта (включая закрытые позиции)

# TotalQty.Name
source: Total Open Qty
ru: Суммарная открытая позиция

# TotalQty.Description
source: Pure open position in a given security
ru: Суммарное количество лотов в данном инструменте

# TotalRiskN2.Name
source: Total Risk N2
ru: Суммарный риск N2

# TotalRiskN2.Description
source: Total risk of position as number of semistraddles
ru: Суммарный риск позиции 'сумма полустреддлов на всех страйках' (функция риска N2 в терминах Твардовского)

# TransformSmile.Name
source: Transform Smile
ru: Преобразовать улыбку

# TransformSmile.Description
source: Transform smile as requested in parameters
ru: Преобразовать улыбку в соответствии с заданным алгоритмом

# VerticalLine2.Name
source: Vertical Line
ru: Вертикальная линия

# VerticalLine2.Description
source: Vertical line for CanvasPane. It is possible to trade base asset using this control.
ru: Рисование вертикальной линии на чарте. Также даёт возможность совершать сделки в БА.

# BuyOptions.Name
source: Buy Options
ru: Покупка опционов

# BuyOptions.Description
source: Buy options while position risk is 'small'
ru: Покупка опционов до заданного уровня риска

# BuyOptionGroup.Name
source: Buy option group
ru: Покупка группы опционов

# BuyOptionGroup.Description
source: Buy many options while position risk is 'small'
ru: Покупка группы опционов до заданного уровня риска

# BuyOptionGroupDelta.Name
source: Buy option group (delta range)
ru: Покупка группы опционов (диапазон по дельте)

# BuyOptionGroupDelta.Description
source: Buy many options while position risk is 'small' (strike range is set in units of delta)
ru: Покупка группы опционов до заданного уровня риска (диапазон страйков задается в единицах дельты)

# MarketMakerDelta.Name
source: Market maker (delta range)
ru: Маркетмейкер (диапазон по дельте)

# MarketMakerDelta.Description
source: Buy and sell options while position risk is 'small' (strike range is set in units of delta)
ru: Покупка и продажа опционов до заданного уровня риска (диапазон страйков задается в единицах дельты)

# Sub.Name
source: Subtract
ru: Вычесть

# Sub.Description
source: Subtract second number from the first one
ru: Вычесть второе число из первого

# AskSmile.StrikeType.Name
source: Option Type
ru: Вид опционов

# AskSmile.StrikeType.Description
source: Type of option to be used in handler (put, call, any)
ru: Тип опционов, которые будут использованы в обработчике (пут, колл, любой)

# AskSmile.Shift.Name
source: Shift Time
ru: Сдвиг времени

# AskSmile.Shift.Description
source: Shift calculations back in time
ru: Перевод времени в прошлое на заданное число баров

# AskStrikes.StrikeType.Name
source: Option Type
ru: Вид опционов

# AskStrikes.StrikeType.Description
source: Type of option to be used in handler (put, call, any)
ru: Тип опционов, которые будут использованы в обработчике (пут, колл, любой)

# BasePx.PxMode.Name
source: Algorythm
ru: Алгоритм

# BasePx.PxMode.Description
source: Algorythm to get base asset's price (FixedPx, LastTrade, etc)
ru: Алгоритм расчета цены БА (фиксированная, последний трейд и т.п.)

# BasePx.DisplayUnits.Name
source: Display Units
ru: Единицы отображения

# BasePx.DisplayUnits.Description
source: Display units (hundreds, thousands, as is)
ru: Единицы отображения (сотни, тысячи, как есть)

# BasePx.FixedPx.Name
source: Price
ru: Цена

# BasePx.FixedPx.Description
source: Price for algorythm FixedPx
ru: Цена для алгоритма FixedPx (фиксированная)

# BasePx.DisplayPrice.Name
source: Display Price
ru: Цена для интерфейса

# BasePx.DisplayPrice.Description
source: Base asset price (only to display at UI)
ru: Цена БА (только для отображения в интерфейсе)

# BidSmile.StrikeType.Name
source: Option Type
ru: Вид опционов

# BidSmile.StrikeType.Description
source: Type of option to be used in handler (put, call, any)
ru: Тип опционов, которые будут использованы в обработчике (пут, колл, любой)

# BidSmile.Shift.Name
source: Shift Time
ru: Сдвиг времени

# BidSmile.Shift.Description
source: Shift calculations back in time
ru: Перевод времени в прошлое на заданное число баров

# BidStrikes.StrikeType.Name
source: Option Type
ru: Вид опционов

# BidStrikes.StrikeType.Description
source: Type of option to be used in handler (put, call, any)
ru: Тип опционов, которые будут использованы в обработчике (пут, колл, любой)

# ExchangeTheorSigma2.SigmaMult.Name
source: Width multiplier
ru: Множитель ширины

# ExchangeTheorSigma2.SigmaMult.Description
source: Width multiplier
ru: Множитель ширины

# ExchangeTheorSigma2.ShowNodes.Name
source: Show nodes
ru: Показывать узлы

# ExchangeTheorSigma2.ShowNodes.Description
source: Nodes are shown when true
ru: При true будет показывать узлы на отображаемой линии

# IvOnF.ReturnPct.Name
source: Return Pct
ru: Расчет в процентах

# IvOnF.ReturnPct.Description
source: Values are calculated as percents
ru: При true результат будет вычислен в процентах

# IvOnF.ShowNodes.Name
source: Show nodes
ru: Показывать узлы

# IvOnF.ShowNodes.Description
source: Nodes are shown when true
ru: При true будет показывать узлы на отображаемой линии

# IvSmile.ReturnPct.Name
source: Return Pct
ru: Расчет в процентах

# IvSmile.ReturnPct.Description
source: Values are calculated as percents
ru: При true результат будет вычислен в процентах

# IvSmile.ShowNodes.Name
source: Show nodes
ru: Показывать узлы

# IvSmile.ShowNodes.Description
source: Nodes are shown when true
ru: При true будет показывать узлы на отображаемой линии

# AutoHedger.DownDelta.Name
source: Down Delta
ru: Допуск вниз

# AutoHedger.UpDelta.Name
source: Up Delta
ru: Допуск вверх

# AutoHedger.TargetDelta.Name
source: Target Delta
ru: Целевая дельта

# BasePx2.PxMode.Name
source: Algorythm
ru: Алгоритм

# BasePx2.PxMode.Description
source: Algorythm to get base asset's price (FixedPx, LastTrade, etc)
ru: Алгоритм расчета цены БА (фиксированная, последний трейд и т.п.)

# BasePx2.DisplayUnits.Name
source: Display Units
ru: Единицы отображения

# BasePx2.DisplayUnits.Description
source: Display units (hundreds, thousands, as is)
ru: Единицы отображения (сотни, тысячи, как есть)

# BasePx2.FixedPx.Name
source: Price
ru: Цена

# BasePx2.FixedPx.Description
source: Price for algorythm FixedPx
ru: Цена для алгоритма FixedPx (фиксированная)

# BasePx2.DisplayPrice.Name
source: Display Price
ru: Цена для интерфейса

# BasePx2.DisplayPrice.Description
source: Base asset price (only to display at UI)
ru: Цена БА (только для отображения в интерфейсе)

# BlackScholesConstSmile2.ReturnPct.Name
source: Return Pct
ru: Расчет в процентах

# BlackScholesConstSmile2.ReturnPct.Description
source: Values are calculated as percents
ru: При true результат будет вычислен в процентах

# BlackScholesConstSmile2.ShowNodes.Name
source: Show nodes
ru: Показывать узлы

# BlackScholesConstSmile2.ShowNodes.Description
source: Nodes are shown when true
ru: При true будет показывать узлы на отображаемой линии

# BlackScholesDelta.ReturnPct.Name
source: Return Pct
ru: Расчет в процентах

# BlackScholesDelta.ReturnPct.Description
source: Values are calculated as percents
ru: При true результат будет вычислен в процентах

# BlackScholesDelta.ShowNodes.Name
source: Show nodes
ru: Показывать узлы

# BlackScholesDelta.ShowNodes.Description
source: Nodes are shown when true
ru: При true будет показывать узлы на отображаемой линии

# BlackScholesGreeks.ReturnPct.Name
source: Return Pct
ru: Расчет в процентах

# BlackScholesGreeks.ReturnPct.Description
source: Values are calculated as percents
ru: При true результат будет вычислен в процентах

# BlackScholesGreeks.ShowNodes.Name
source: Show nodes
ru: Показывать узлы

# BlackScholesGreeks.ShowNodes.Description
source: Nodes are shown when true
ru: При true будет показывать узлы на отображаемой линии

# BlackScholesSmile2.SigmaMult.Name
source: Width multiplier
ru: Множитель ширины

# BlackScholesSmile2.SigmaMult.Description
source: Width multiplier
ru: Множитель ширины

# BlackScholesSmile2.ShowNodes.Name
source: Show nodes
ru: Показывать узлы

# BlackScholesSmile2.ShowNodes.Description
source: Nodes are shown when true
ru: При true будет показывать узлы на отображаемой линии

# EditTemplateSmile.SigmaMult.Name
source: Width multiplier
ru: Множитель ширины

# EditTemplateSmile.SigmaMult.Description
source: Width multiplier
ru: Множитель ширины

# EditTemplateSmile.ShowNodes.Name
source: Show nodes
ru: Показывать узлы

# EditTemplateSmile.ShowNodes.Description
source: Nodes are shown when true
ru: При true будет показывать узлы на отображаемой линии

# ExchangeTheorSigma3.SigmaMult.Name
source: Width multiplier
ru: Множитель ширины

# ExchangeTheorSigma3.SigmaMult.Description
source: Width multiplier
ru: Множитель ширины

# ExchangeTheorSigma3.ShowNodes.Name
source: Show nodes
ru: Показывать узлы

# ExchangeTheorSigma3.ShowNodes.Description
source: Nodes are shown when true
ru: При true будет показывать узлы на отображаемой линии

# ExchangeTheorSigma5.SigmaMult.Name
source: Width multiplier
ru: Множитель ширины

# ExchangeTheorSigma5.SigmaMult.Description
source: Width multiplier
ru: Множитель ширины

# ExchangeTheorSigma5.ShowNodes.Name
source: Show nodes
ru: Показывать узлы

# ExchangeTheorSigma5.ShowNodes.Description
source: Nodes are shown when true
ru: При true будет показывать узлы на отображаемой линии

# GaussSmile.ReturnPct.Name
source: Return Pct
ru: Расчет в процентах

# GaussSmile.ReturnPct.Description
source: Values are calculated as percents
ru: При true результат будет вычислен в процентах

# GaussSmile.ShowNodes.Name
source: Show nodes
ru: Показывать узлы

# GaussSmile.ShowNodes.Description
source: Nodes are shown when true
ru: При true будет показывать узлы на отображаемой линии

# SetViewport.SigmaMult.Name
source: Width multiplier
ru: Множитель ширины

# SetViewport.SigmaMult.Description
source: Width multiplier
ru: Множитель ширины

# SetViewport.ShowNodes.Name
source: Show nodes
ru: Показывать узлы

# SetViewport.ShowNodes.Description
source: Nodes are shown when true
ru: При true будет показывать узлы на отображаемой линии

# SingleSeriesNumericalDelta.ReturnPct.Name
source: Return Pct
ru: Расчет в процентах

# SingleSeriesNumericalDelta.ReturnPct.Description
source: Values are calculated as percents
ru: При true результат будет вычислен в процентах

# SingleSeriesNumericalDelta.ShowNodes.Name
source: Show nodes
ru: Показывать узлы

# SingleSeriesNumericalDelta.ShowNodes.Description
source: Nodes are shown when true
ru: При true будет показывать узлы на отображаемой линии

# SingleSeriesNumericalDelta3.ReturnPct.Name
source: Return Pct
ru: Расчет в процентах

# SingleSeriesNumericalDelta3.ReturnPct.Description
source: Values are calculated as percents
ru: При true результат будет вычислен в процентах

# SingleSeriesNumericalDelta3.ShowNodes.Name
source: Show nodes
ru: Показывать узлы

# SingleSeriesNumericalDelta3.ShowNodes.Description
source: Nodes are shown when true
ru: При true будет показывать узлы на отображаемой линии

# SingleSeriesNumericalGamma.ReturnPct.Name
source: Return Pct
ru: Расчет в процентах

# SingleSeriesNumericalGamma.ReturnPct.Description
source: Values are calculated as percents
ru: При true результат будет вычислен в процентах

# SingleSeriesNumericalGamma.ShowNodes.Name
source: Show nodes
ru: Показывать узлы

# SingleSeriesNumericalGamma.ShowNodes.Description
source: Nodes are shown when true
ru: При true будет показывать узлы на отображаемой линии

# SingleSeriesNumericalGamma3.ReturnPct.Name
source: Return Pct
ru: Расчет в процентах

# SingleSeriesNumericalGamma3.ReturnPct.Description
source: Values are calculated as percents
ru: При true результат будет вычислен в процентах

# SingleSeriesNumericalGamma3.ShowNodes.Name
source: Show nodes
ru: Показывать узлы

# SingleSeriesNumericalGamma3.ShowNodes.Description
source: Nodes are shown when true
ru: При true будет показывать узлы на отображаемой линии

# SingleSeriesNumericalTheta.ReturnPct.Name
source: Return Pct
ru: Расчет в процентах

# SingleSeriesNumericalTheta.ReturnPct.Description
source: Values are calculated as percents
ru: При true результат будет вычислен в процентах

# SingleSeriesNumericalTheta.ShowNodes.Name
source: Show nodes
ru: Показывать узлы
