Repository: TSLab-Dev/Handlers
Catalog: Properties/Resources.*.resx
Languages: ru

# AutoHedger.Name
source: Auto Hedge Delta
ru: Автохеджер дельты

# AutoHedger.Description
source: Hedge delta by time (on every script execution)
ru: Автоматический хедж дельты позиции по времени (на каждом исполнении скрипта)

# AutoHedger.DownDelta.Description
source: Possible delta decrease from target level
ru: Допуск по дельте вниз

# AutoHedger.HedgeDelta.Description
source: Align delta to target level
ru: Привести дельту к целевому уровню

# AutoHedger.HedgeDelta.Name
source: Align Delta
ru: Ровнять дельту

# AutoHedger.TargetDelta.Description
source: Target delta
ru: Целевая дельта

# AutoHedger.UpDelta.Description
source: Possible delta increase from target level
ru: Допуск по дельте вверх

# AutoHedger.BuyPrice.Name
source: Buy price
ru: Цена покупки

# AutoHedger.BuyPrice.Description
source: Price of hedge order to buy
ru: Цена хеджа при покупке

# AutoHedger.SellPrice.Name
source: Sell price
ru: Цена продажи

# AutoHedger.SellPrice.Description
source: Price of hedge order to sell
ru: Цена хеджа при продаже

# AutoHedger.WorkWithoutOptions.Name
source: Work without options
ru: Работать без опционов

# AutoHedger.WorkWithoutOptions.Description
source: Permission to work without options
ru: Разрешена работа, даже если в позиции нет опционов

source: Delta
ru: Дельта

source: Any Security
ru: Любой инструмент

source: Delta Profile
ru: Профиль Дельты

# FutPx
source: Base Asset Price
ru: Цена БА

source: Risk-free rate %
ru: Безрисковая ставка %

# SECURITYSource
source: Instrument
ru: Фин. инструмент

# POSITIONSource
source: Position
ru: Позиция

source: Option series
ru: Опционная серия

source: Option source
ru: Опционный источник

source: Position profile
ru: Профиль позиции

source: Reference line
ru: Опорная линия

source: Series 1
ru: Серия 1

source: Series 2
ru: Серия 2

source: Smile
ru: Улыбка

source: Strike
ru: Страйк

# PositionsManager.Name
source: Positions Manager
ru: Менеджер позиций

# PositionsManager.Description
source: Manager for virtual and real positions
ru: Управление виртуальными и реальными позициями

# AskSmile.Name
source: Ask smile
ru: Улыбка по оферам

# AskSmile.Description
source: Options ask prices. Strike is ignored if there is no offer in it.
ru: Цена продажи опционов. Если цены нет, страйк игнорируется.

# AskStrikes.Name
source: Option Asks
ru: Цены продажи

# AskStrikes.Description
source: Options ask prices. Price is set to 0 if there is no offer in it. Handler returns a list of Double2.
ru: Цена продажи опционов. Если котировки нет, цена считается нулевой. Результатом блока является лист Double2.

# BasePx.Name
source: Base Price
ru: Цена БА

# BasePx.Description
source: A base asset price. Various algorithms are applied in calculation (fixed price, the last trade, quote midpoint, etc). It is a stream handler.
ru: Цена базового актива. В расчет заложены различные алгоритмы (фиксированная цена, последний трейд, между котировками, на основании опционов, и т.п.). Потоковый обработчик.

# BidSmile.Name
source: Bid smile
ru: Улыбка по бидам

# BidSmile.Description
source: Options bid prices. Strike is ignored if there is no demand in it.
ru: Цены покупки опционов. Если цены покупки нет, страйк игнорируется.

# BidStrikes.Name
source: Option Bids
ru: Цены покупки

# BidStrikes.Description
source: Options bid prices. Price is set to 0 if there is no demand in it. Handler returns a list of Double2.
ru: Цена покупки опционов. Если котировки нет, цена считается нулевой. Результатом блока является лист Double2.

# CentralStrike.Name
source: Central Strike
ru: Центральный страйк

# CentralStrike.Description
source: Central strike of an Option Series
ru: Центральный страйк серии

# CloseVirtualFutPosition.Name
source: Close Virtual Pos
ru: Закрыть вирт. позицию

# CloseVirtualFutPosition.Description
source: Close virtual fut position in base asset
ru: Закрыть виртуальную позицию в БА

# ExchangeTheorPx.Name
source: Exchange Theor Px
ru: Биржевая теор. цена

# ExchangeTheorPx.Description
source: Theoretical option price provided by exchange. Additional linear transformation is allowed.
ru: Теоретические биржевые цены опционов. Возможно, с каким-то линейным преобразованием.

# ExchangeTheorSigma2.Name
source: Exchange Smile
ru: Биржевая улыбка

# ExchangeTheorSigma2.Description
source: Exchange smile (stream handler)
ru: Биржевая улыбка (потоковый обработчик)

# ForwardTheorPx.Name
source: Forward Price
ru: Форвардная цена

# ForwardTheorPx.Description
source: Base asset price calculated using theretical option prices
ru: Цена базового актива, вычисленная через теоретические (биржевые) цены опционов

# GlobalHv.Description
source: This block takes precalculated HV from global cache.
ru: Брать готовый HV из глобального кеша (чтобы не путаться с 'пишущей' версией)

# GlobalIvOnF.Description
source: This block takes precalculated IvOnF from global cache.
ru: Брать готовый IvOnF из глобального кеша (чтобы не путаться с 'пишущей' версией)

# GlobalIvOnF.RepeatLastIv.Name
source: Repeat Last IV
ru: Повтор значения

# GlobalIvOnF.RepeatLastIv.Description
source: Handler should repeat last known value to avoid further logic errors
ru: При true будет находить и использовать последнее известное значение

# GlobalIvOnF.ExpirationMode.Name
source: Search Mode
ru: Режим поиска

# GlobalIvOnF.ExpirationMode.Description
source: Algorythm to get expiration date
ru: Алгоритм определения даты экспирации

# GlobalIvOnF.Number.Name
source: Number
ru: Номер

# GlobalIvOnF.Number.Description
source: Option series index (only alive). Parameter is used in mode ExpiryByNumber.
ru: Индекс серии (учитываются только живые). Используется в режиме ExpiryByNumber.

# GlobalIvOnF.ReturnPct.Name
source: Return Pct
ru: В процентах

# GlobalIvOnF.ReturnPct.Description
source: Return volatility as percents
ru: При true будет возвращать волатильность в процентах

# GlobalIvOnF.Expiry.Name
source: Expiry
ru: Экспирация

# GlobalIvOnF.Expiry.Description
source: Expiration date (format yyyy-MM-dd)
ru: Дата экспирации в формате гггг-ММ-дд

# GlobalIvOnF.RescaleTime.Name
source: Rescale Time
ru: Заменить время

# GlobalIvOnF.RescaleTime.Description
source: Rescale time-to-expiry to our internal?
ru: Заменять время на 'правильное'?

# GlobalIvOnF.DistanceMode.Name
source: Estimation Algo
ru: Алгоритм расчета

# GlobalIvOnF.DistanceMode.Description
source: Algorythm to estimate time-to-expiry
ru: Алгоритм расчета времени до экспирации

# GlobalIvOnF.IgnoreCacheError.Name
source: Ignore cache error
ru: Игнорировать ошибки кеша

# GlobalIvOnF.IgnoreCacheError.Description
source: Handler should ignore cache errors in agent mode
ru: Специально для агента-сборщика волатильности делаю настройку для подавления исключений при отсутствии данных в Глобальном Кеше

# GlobalSkewOnF.Description
source: This block takes precalculated skew at the money from global cache.
ru: Брать готовый наклон на деньгах из глобального кеша (чтобы не путаться с 'пишущей' версией)

# GlobalSkewOnF.ExpirationMode.Name
source: Search mode
ru: Режим поиска

# GlobalSkewOnF.ExpirationMode.Description
source: Algorythm to get expiration date
ru: Алгоритм определения даты экспирации

# GlobalSkewOnF.Number.Name
source: Number
ru: Номер

# GlobalSkewOnF.Number.Description
source: Option series index (only alive). Parameter is used in mode ExpiryByNumber.
ru: Индекс серии (учитываются только живые). Используется в режиме ExpiryByNumber.

# GlobalSkewOnF.Expiry.Name
source: Expiry
ru: Экспирация

# GlobalSkewOnF.Expiry.Description
source: Expiration date (format yyyy-MM-dd)
ru: Дата экспирации в формате гггг-ММ-дд

# GlobalSkewOnF.RepeatLastSkew.Name
source: Repeat last skew
ru: Повтор значения

# GlobalSkewOnF.RepeatLastIv.Description
source: Handler should repeat last known value to avoid further logic errors
ru: При true будет находить и использовать последнее известное значение

# GlobalSkewOnF.RescaleTime.Name
source: Rescale time
ru: Заменить время

# GlobalSkewOnF.RescaleTime.Description
source: Rescale time-to-expiry to our internal?
ru: Заменять время на 'правильное'?

# GlobalSkewOnF.DistanceMode.Name
source: Estimation algo
ru: Алгоритм расчета

# GlobalSkewOnF.DistanceMode.Description
source: Algorythm to estimate time-to-expiry
ru: Алгоритм расчета времени до экспирации

# GlobalSkewOnF.IgnoreCacheError.Name
source: Ignore cache error
ru: Игнорировать ошибки кеша

# GlobalSkewOnF.IgnoreCacheError.Description
source: Handler should ignore cache errors in agent mode
ru: Специально для агента-сборщика волатильности делаю настройку для подавления исключений при отсутствии данных в Глобальном Кеше

# Heartbeat.Name
source: Heartbeat
ru: Метроном

# Heartbeat.Description
source: Recalculate script by timer
ru: Автоматический принудительный пересчет скрипта через заданный промежуток времени

# HeartbeatHandler.Name
source: Heartbeat 2
ru: Метроном 2

# HeartbeatHandler.Description
source: Automatic forced recalculation of the script after a specified period of time. The forced recalculation is started via the Recalc() method in the API. By default, protection is enabled so that the recalculation does not start more often than 300ms.
ru: Метроном 2

# HV.Name
source: HV (from book)
ru: HV (из учебника)

# HV.Description
source: Estimate HV with classic method
ru: Оценка исторической волатильности по формулам из учебника

# IvOnF.Description
source: Implied Volatility at-the-money
ru: Подразумеваемая волатильность на деньгах

# IvSmile.Description
source: Smile derived from option quotes (stream handler)
ru: Улыбка, построенная по котировкам опционов (потоковый обработчик)

# NumericalDeltaOnF2.Name
source: Numerical Delta ATM v2
ru: Численная дельта на деньгах в2

# NumericalDeltaOnF2.Description
source: Numerical estimate of delta at-the-money (only one point is processed; stream handler)
ru: Численный расчет дельты позиции в текущей точке БА (вычисляется одна точка; потоковый обработчик)

# OpenVirtualFutPosition.Name
source: Open Virtual Pos
ru: Открыть вирт. позицию

# OpenVirtualFutPosition.Description
source: Open virtual position in base asset (stream handler)
ru: Создание виртуальной позиции по БА (потоковый обработчик)

# OpenVirtualOptPosition.Name
source: Open Virtual Opt Pos
ru: Открыть вирт. позицию в опционах

# OpenVirtualOptPosition.Description
source: Open virtual position in option (stream handler)
ru: Создание виртуальной позиции в опционах (потоковый обработчик)

# OptionBase.Name
source: Base asset
ru: Базовый актив

# OptionBase.Description
source: Base asset (stream handler)
ru: Базовый актив (потоковый обработчик)

# OptionsBoardNumericalDelta.Name
source: Options board numerical delta
ru: Численная дельта для доски

# OptionsBoardNumericalDelta.Description
source: Estimate delta as function of strikes with numerical differentiation
ru: Численный расчет дельты одного опциона на каждом страйке

# OptionSelector.Name
source: Option Selector
ru: Выбор Опциона

# OptionSelector.Description
source: Choose one of several option sources
ru: Выбор одного опционного источника из нескольких альтернатив

# OptionSeriesByNumber.Name
source: Option Series by Number
ru: Серия по номеру

# OptionSeriesByNumber.Description
source: Handler to get option series by its index. Series are sorted ascending from near (index 1) to further. It's stream handler.
ru: Получение опционной серии по её индексу. Серии отсортированы по порядку от ближней (индекс 1) к дальним. Потоковый обработчик.

# OptionStrikeCount.Name
source: Count Options
ru: Количество опционов

# OptionStrikeCount.Description
source: Number of options in the source
ru: Количество опционов в источнике

# SingleOption.Name
source: Single Option
ru: Один опцион

# SingleOption.Description
source: Get single option from its option series
ru: Извлечь из серии один опцион с заданным страйком

# SingleOption.FixedStrike.Name
source: Strike
ru: Страйк

# SingleOption.FixedStrike.Description
source: Option strike
ru: Страйк опциона

# SingleOption.OptionType.Name
source: Option Type
ru: Вид опционов

# SingleOption.OptionType.Description
source: Option type (parameter Any is not recommended)
ru: Тип опционов (использование типа Any может привести к неожиданному поведению)

# SingleOption.SelectionMode.Name
source: Search Algo
ru: Алгоритм поиска

# SingleOption.SelectionMode.Description
source: Search algorythm
ru: Алгоритм поиска

# SingleOption2.Name
source: Single Option
ru: Один опцион

# SingleOption2.Description
source: Get single option from its option series
ru: Извлечь из серии один опцион с заданным страйком

# SingleOption2.FixedStrike.Name
source: Strike
ru: Страйк

# SingleOption2.FixedStrike.Description
source: Option strike
ru: Страйк опциона

# SingleOption2.OptionType.Name
source: Option Type
ru: Вид опционов

# SingleOption2.OptionType.Description
source: Option type (parameter Any is not recommended)
ru: Тип опционов (использование типа Any может привести к неожиданному поведению)

# SingleOption2.SelectionMode.Name
source: Search Algo
ru: Алгоритм поиска

# SingleOption2.SelectionMode.Description
source: Search algorythm
ru: Алгоритм поиска

# TimeToExpiry.Name
source: Time to expiry
ru: Время до экспирации

# TimeToExpiry.Description
source: Time to expiry in year fractions. Various algorithms are applied (fixed time, plain calendar time, plain calendar time including days off and so on).
ru: Время до экспирации в долях года. Заложены различные алгоритмы (фиксированное время, плоское календарное время, плоское календарное время с учетом выходных, и т.п.).

# VerticalLine.Name
source: Vertical Line
ru: Вертикальная линия

# VerticalLine.Description
source: Vertical line for CanvasPane (no interaction with user)
ru: Вертикальная линия без возможности взаимодействия с пользователем

# BasePx2.Name
source: Base Price
ru: Цена БА

# BasePx2.Description
source: Base asset price. Different algorythms are available (fixed price, last trade, quote midpoint, etc). Bar handler.
ru: Цена базового актива. Заложены различные алгоритмы (фиксированная цена, последний трейд, между котировками, на основании опционов, и т.п.). Тиковый обработчик.

# BestChartTrading.Name
source: Best Chart Trading
ru: Торговля по лучшим заявкам

# BestChartTrading.Description
source: Trading with mouse on CanvasPane. Best quotes are accented automatically
ru: Торговля кликами мыши по чарту CanvasPane (автоматически выделяются лучшие точки)

# BestChartTrading.OptionType.Name
source: Option Type
ru: Вид опционов

# BestChartTrading.OptionType.Description
source: Option type (when Any, the handler will choose the best quote)
ru: Тип опционов (Any предполагает автоматический выбор лучшей котировки)

# BestChartTrading.Qty.Name
source: Size
ru: Кол-во

# BestChartTrading.Qty.Description
source: Trade quantity. Negative value reverts the signal.
ru: Торговый объём. Отрицательное значение приведет к перевороту сигнала.

# BestChartTrading.OptPxMode.Name
source: Quote Type
ru: Тип котировки

# BestChartTrading.OptPxMode.Description
source: Quote type (ask or bid)
ru: Тип котировки (аск или бид)

# BestChartTrading.WidthPx.Name
source: Width
ru: Ширина

# BestChartTrading.WidthPx.Description
source: Width of neutral band (price steps)
ru: Ширина нейтральной полосы (в шагах цены)

# BestChartTrading.OutletDistance.Name
source: Outlet distance
ru: Величина выноса

# BestChartTrading.OutletDistance.Description
source: Outlet distance to 'profitable' market order (units of volatility)
ru: Величина выноса торгового маркера, которым подсвечивается 'выгодная' заявка (в единицах волатильности)

# BestChartTrading.OutletSize.Name
source: Outlet size
ru: Величина маркера

# BestChartTrading.OutletSize.Description
source: Outlet size (pixel)
ru: Величина торгового маркера, которым подсвечивается 'выгодная' заявка (в пикселях)

# BlackScholesConstSmile2.Name
source: Black-Scholes Const
ru: Константа по Блеку-Шолзу

# BlackScholesConstSmile2.Description
source: A flat smile as in the Black-Scholes option model. Volatility is a constant and is defined by the 'Sigma, %' parameter.
ru: Тривиальная улыбка по версии Блека-Шолза. Уровень волатильности постоянен и задаётся параметром 'Волатильность, %'.

# BlackScholesConstSmile2.Label.Name
source: Label
ru: Метка

# BlackScholesConstSmile2.Label.Description
source: Label to mark a nodes
ru: Метка для подписи узлов

# BlackScholesDelta.Name
source: Single Series Delta (book)
ru: Дельта одиночной серии (по учебнику)

# BlackScholesDelta.Description
source: Straigtforward calculation of delta (as in books)
ru: Лобовой (книжный) расчет дельты позиции

# BlackScholesGreeks.Name
source: Single Series Greeks (book)
ru: Греки одиночной серии (по учебнику)

# BlackScholesGreeks.Description
source: Straigtforward calculation of greeks (as in books)
ru: Лобовой (книжный) расчет греков позиции

# BlackScholesSmile2.Name
source: Black-Scholes 'Smile'
ru: 'Улыбка' Блека-Шолза

# BlackScholesSmile2.Description
source: Horizontal line spanning a few Sigma
ru: Горизонтальная линия шириной несколько сигм

# BlackScholesSmile2.Label.Name
source: Label
ru: Метка

# BlackScholesSmile2.Label.Description
source: Label to mark a nodes
ru: Метка для подписи узлов

# ChartTrading.Name
source: Chart Trading
ru: Торговля на графике

# ChartTrading.Description
source: Trading with mouse on CanvasPane
ru: Торговля кликами мыши по чарту CanvasPane

# CloseVirtualPosition.Name
source: Close Virtual Pos (bar)
ru: Закрыть вирт. позицию (бары)

# CloseVirtualPosition.Description
source: Close virtual position (bar handler)
ru: Закрыть виртуальную позицию (побарный обработчик)

# CombinePositionProfiles.Name
source: Combine Series Profiles
ru: Сложить профили позиций

# CombinePositionProfiles.Description
source: Add 2 position profiles
ru: Сложить два профиля позиций

# CurrentFutPx.Name
source: Current Fut Px
ru: Маркер текущей цены БА

# CurrentFutPx.Description
source: Draws a vertical line in the chart. A vertical position is connected to any given Interactive Series.
ru: Рисование вертикальной линии на графике. Положение по вертикали привязано к произвольной InteractiveSeries. Также даёт возможность совершать сделки в БА.

# DropVirtualPositions.Name
source: Clear Virtual Positions
ru: Удалить виртуальные позиции

# DropVirtualPositions.Description
source: This block allows you to delete virtual positions. Connect Delete positions property to Control Pane and create a button.
ru: Блок служит для удаления виртуальных позиций. Для этого нужно привязать его свойство 'Удалить позиции' к 'Контрольной панели' и оформить его в виде кнопки.

# EditTemplateSmile.Name
source: Edit Template Smile
ru: Редактировать шаблон улыбки

# EditTemplateSmile.Description
source: Edit template smile
ru: Редактировать шаблон улыбки

# ExchangeTheorSigma3.Name
source: Exchange Smile
ru: Биржевая улыбка

# ExchangeTheorSigma3.Description
source: Exchange smile (bar handler)
ru: Биржевая улыбка (побарный обработчик)

# ExchangeTheorSigma5.Name
source: Exchange Smile (Rescaled)
ru: Биржевая улыбка (приведенная)

# ExchangeTheorSigma5.Description
source: Exchange smile rescaled to our internal time-to-expiry
ru: Биржевая улыбка, пересчитанная в наше внутреннее время

# FixedValue.Name
source: Fixed Value
ru: Фиксированная величина

# FixedValue.Description
source: Fixed value
ru: Фиксированная величина

# GaussSmile.Name
source: Gauss 'Smile'
ru: Гауссова 'Улыбка'

# GaussSmile.Description
source: Arbitrary function with 3 parameters similar to observed smile
ru: Произвольная трёхпараметрическая функция качественно похожая на улыбку

# IvSmile2.Description
source: Smile derived from option quotes (bar handler)
ru: Подразумеваемые волатильности опционов на основании их рыночных цен

# IvSmile2.ReturnPct.Name
source: Return Pct
ru: Расчет в процентах

# IvSmile2.ReturnPct.Description
source: Values are calculated as percents
ru: При true результат будет вычислен в процентах

# IvSmile2.ShowNodes.Name
source: Show nodes
ru: Показывать узлы

# IvSmile2.ShowNodes.Description
source: Nodes are shown when true
ru: При true будет показывать узлы на отображаемой линии

# IvSmile2.MinStrike.Name
source: Min strike
ru: Минимальный страйк

# IvSmile2.MinStrike.Description
source: Min strike to be processed by handler
ru: Минимальный обрабатываемый страйк

# IvSmile2.MaxStrike.Name
source: Max strike
ru: Максимальный страйк

# IvSmile2.MaxStrike.Description
source: Max strike to be processed by handler
ru: Максимальный обрабатываемый страйк

# IvSmile2.StrikeStep.Name
source: Strike step
ru: Шаг страйков

# IvSmile2.StrikeStep.Description
source: Strike step
ru: Шаг между страйками

# IvSmileRescaled2.Description
source: Smile derived from option quotes with scale multiplier (bar handler, for Deribit)
ru: Подразумеваемые волатильности опционов на основании их рыночных цен (c учетом необходимости домножить цены на курс конвертации)

# IvSmileRescaled2.ReturnPct.Name
source: Return Pct
ru: Считать в %

# IvSmileRescaled2.ReturnPct.Description
source: Values are calculated as percents
ru: Значения волатильности вычисляются в процентах

# IvSmileRescaled2.ShowNodes.Name
source: Show nodes
ru: Показывать узлы

# IvSmileRescaled2.ShowNodes.Description
source: Nodes are shown when true
ru: При true будет показывать узлы на отображаемой линии

# IvSmileRescaled2.MinStrike.Name
source: Min strike
ru: Минимальный страйк

# IvSmileRescaled2.MinStrike.Description
source: Min strike to be processed by handler
ru: Минимальный обрабатываемый страйк

# IvSmileRescaled2.MaxStrike.Name
source: Max strike
ru: Максимальный страйк

# IvSmileRescaled2.MaxStrike.Description
source: Max strike to be processed by handler
ru: Максимальный обрабатываемый страйк

# IvSmileRescaled2.StrikeStep.Name
source: Strike step
ru: Шаг страйков

# IvSmileRescaled2.StrikeStep.Description
source: Strike step
ru: Шаг между страйками

# LinearTransform.Name
source: Linear transform (a*x+b)
ru: Линейное преобразование (a*x+b)

# LinearTransform.Description
source: Linear transform (a*x+b)
ru: Линейное преобразование (a*x+b)

# MarketMaker.Name
source: Market Maker
ru: Маркетмейкер

# MarketMaker.Description
source: Market-maker. It can repeat quotes from one market to another
ru: Маркет-мейкер. Умеет переносить котировки идентичных активов между площадками

# NumericalDeltaOnF.Name
source: Numerical Delta ATM
ru: Численная дельта на деньгах

# NumericalDeltaOnF.Description
source: Numerical estimate of delta at-the-money (only one point is processed; bar handler)
ru: Численный расчет дельты позиции в текущей точке БА (вычисляется одна точка; побарный обработчик)

# NumericalDeltaOnF3.Name
source: Numerical Delta ATM (IntSer)
ru: Численная дельта на деньгах (IntSer)

# NumericalDeltaOnF3.Description
source: Numerical estimate of delta at-the-money (only one point is processed using delta profile)
ru: Численный расчет дельты позиции в текущей точке БА (вычисляется одна точка по профилю дельты)

# NumericalGammaOnF.Name
source: Numerical Gamma ATM
ru: Численная гамма на деньгах

# NumericalGammaOnF.Description
source: Numerical estimate of gamma at-the-money (only one point is processed; bar handler)
ru: Численный расчет гаммы позиции в текущей точке БА (вычисляется одна точка; побарный обработчик)

# NumericalGammaOnF3.Name
source: Numerical Gamma ATM (IntSer)
ru: Численная гамма на деньгах (IntSer)

# NumericalGammaOnF3.Description
source: Numerical estimate of gamma at-the-money (only one point is processed using gamma profile)
ru: Численный расчет гаммы позиции в текущей точке БА (вычисляется одна точка по профилю гаммы)

# NumericalThetaOnF.Name
source: Numerical Theta ATM
ru: Численная тета на деньгах

# NumericalThetaOnF.Description
source: Numerical estimate of theta at-the-money (only one point is processed)
ru: Численный расчет теты позиции в текущей точке БА (вычисляется одна точка)
