Repository: TSLab-Dev/Handlers
Catalog: Properties/Resources.*.resx
Languages: ru

# Compress.Description
source: Compresses current bars time range (minutes into minutes, days into days) into a longer one. Only divisible ranges can be used. For example, 15 minutes can be compressed into 15, 30, 45, 60 minutes and so on.
ru: Сжатие текущего временного диапазона (минуты - в минуты, дни - в дни) баров в более длительный. Сжимать можно только в кратные диапазоны. Например, 15 минут можно сжать в 15, 30, 45, 60 минут и т.д.

# CompressAdvanced.Description
source: Compresses a current bars time range (minutes into minutes, days into days) of bars into a longer one. Only divisible ranges can be used. For example, 15 minutes can be compressed into 15, 30, 45, 60 minutes and so on.
ru: Сжатие текущего временного диапазона (минуты - в минуты, дни - в дни) баров в более длительный. Сжимать можно только в кратные диапазоны. Например, 15 минут можно сжать в 15, 30, 45, 60 минут и т.д.

# CompressToSeconds.Description
source: Compresses current time range of bars into a longer one. Only divisible ranges can be used. For example, 1 minute can be compressed into 60, 120, 180, 240 seconds and so on.
ru: Сжатие текущего временного диапазона баров в более длительный. Сжимать можно только в кратные диапазоны. Например, 1 минуту можно сжать в 60, 120, 180, 240 секунд и т.д.

# ConstGen.Description
source: A constant value.
ru: Постоянное значение.

# ConstGen.Value.Name
source: Value
ru: Значение

# ConstGen.Value.Description
source: A value to return as output of a handler
ru: Значение на выходе блока

# ControlledBoolConst.Description
source: Controlled boolean constant (switch). If input is TRUE the result is taken from a field 'Value', otherwise the result is taken from a field 'Default value'.
ru: Управляемая логическая константа (переключатель). При поступлении на вход значения 'Истина' данный блок выдает значение из поля 'Значение', при поступлении на вход значения 'Ложь' используется 'Значение по умолчанию'.

# ControlledBoolConst.Value.Name
source: Value
ru: Значение

# ControlledBoolConst.Value.Description
source: A value to return as output of a handler when input is true
ru: Значение на выходе блока, если на вход подать 'Истина'

# ControlledBoolConst.DefaultValue.Name
source: Default value
ru: Значение по умолчанию

# ControlledBoolConst.DefaultValue.Description
source: A value to return as output of a handler when input is false
ru: Значение на выходе блока, если на вход подать 'Ложь'

# CrossOver.Description
source: Handler returns true, if second input (signal) crosses down a reference line (first input).
ru: Функция определяет моменты, когда второй вход (сигнал) пересекает опорную линию (первый вход) сверху вниз.

# CrossUnder.Description
source: Handler returns true, if second input (signal) crosses up a reference line (first input).
ru: Функция определяет моменты, когда второй вход (сигнал) пересекает опорную линию (первый вход) снизу вверх.

# Cutter.Description
source: Cuts High and Low up to a selected value.
ru: Обрезает High и Low на заданную величину.

# Cutter.Decimals.Name
source: Decimals
ru: Десятичных знаков

# Cutter.Decimals.Description
source: Decimals for ceiling
ru: Количество десятичных знаков после запятой при округлении чисел вверх

# Date.Description
source: Date of every bar is converted to number as yymmdd. I.e. date 12.31.2018 converts to a number 181231.
ru: Блок принимает на вход финансовый инструмент и возвращает дату каждого бара в виде числа в формате ггммдд. Например, дата 31-12-2018 превратится в число 181231.

# DayOfMonth.Description
source: Handler accepts an instrument at the entry and returns a month day as number from 1 31.
ru: Блок принимает на вход финансовый инструмент и возвращает день месяца в виде значений от 1 до 31.

# DayOfWeek.Description
source: Handler accepts an instrument at the entry and returns a week day as number from 1 (Monday) to 7 (Sunday).
ru: Блок принимает на вход финансовый инструмент и возвращает день недели в виде значений от 1 (понедельник) до 7 (воскресенье).

# Decompres.Description
source: Decompresses calculated numeric data to be used further with other data in authentic range. The Decompress block should be connected to a block being compressed and to the Compress block linked to a block being decompressed. [br]TSLab has three decompression methods. [br]Attention! The 2nd method cannot be applied to offline data testing, as it results in looking into the future and, as a result, corrupts results significantly.
ru: Разжать посчитанные числовые данные в сжатом диапазоне, для последующего их использования с данными в оригинальном диапазоне. Блок 'разжать' необходимо соединить с разжимаемым блоком, а также с блоком 'сжать', соответствующим разжимаемому блоку. [br]В программе существует три метода декомпрессии данных. [br]Внимание! Метод № 2 не применим для исторического тестирования, поскольку приводит к заглядыванию в будущее и приводит к существенному искажению результатов.

# DecompresBool.Description
source: Decompresses Boolean data which have been calculated in compressed range to be used further with other data in authentic range. The Decompress block should be connected to a block being decompressed and with the Compress block, linked to a block being decompressed.
ru: Разжать посчитанные в сжатом диапазоне логические данные для последующего их использования с данными в оригинальном диапазоне. Блок 'Разжать' необходимо соединить с разжимаемым блоком, а также с блоком 'Сжать', соответствующим разжимаемому блоку.

# EqualHandler.Description
source: Handler returns true, if input values are equal (with respect to double values precision)
ru: Кубик возвращает true, если на вход переданы равные значения (в пределах точности вычислений)

# Flip.Description
source: Imitates a trigger with 2 entries, when True appears at the first entry, an outgoing value becomes True, until True appears at the second entry. When True appears at the second entry, an indicator value becomes False, until True appears at the first entry. If True appears at two entries simultaneously, then an indicator valye is False, so it means that the first entry is ignored.
ru: Имитирует работу триггера с двумя входами, при появлении 'Истина' на первом входе, выходное значение становится 'Истина' до появления 'Истина' на втором входе. При появлении 'Истина' на втором входе, значение индикатора становится 'Ложь', до появления значения 'Истина' на первом входе. Если 'Истина' появляется одновременно на двух входах, то значение индикатора - 'Ложь', т.е. первый вход игнорируется.

# GreaterHandler.Description
source: Handler returns true, if the first input is strictly greater than the second input.
ru: Функция определяет моменты, когда первый вход строго больше второго.

# GreaterOrEqualHandler.Description
source: Handler returns true, if the first input is greater or equal than the second input.
ru: Функция определяет моменты, когда первый вход больше или равен второму.

# High.Description
source: A maximum price of a bar.
ru: Максимальная цена бара.

# HighestPos.Description
source: The number of bars since the latest high.
ru: Количество баров, прошедшее с момента последнего обновления максимума.

# HighestPos.Period.Name
source: Period
ru: Период

# HighestPos.Period.Description
source: Indicator period (processing window)
ru: Период индикатора (окно расчетов)

# Hold.Description
source: Holds an incoming Boolean signal during N candles (the Period parameter). So, if an incoming candle value becomes True, it will be duplicated for N candles.
ru: Задерживает входящий логический сигнал на N свечей (параметр 'Период'). Т.е. если входящее значение на определенной свече становится 'Истина', то оно будет продублировано на N свечей.

# Hold.Period.Name
source: Period
ru: Период

# Hold.Period.Description
source: Indicator period (processing window)
ru: Период индикатора (окно расчетов)

# LessHandler.Description
source: Handler returns true, if the first input is strictly less than the second input.
ru: Функция определяет моменты, когда первый вход строго меньше второго.

# LessOrEqualHandler.Description
source: Handler returns true, if the first input is less or equal than the second input.
ru: Функция определяет моменты, когда первый вход меньше или равен второму.

# Ln.Description
source: A natural logarithm (Ln) for a values series.
ru: Натуральный логарифм (Ln) для серии значений.

# Low.Description
source: A minimum price of a bar.
ru: Минимальная цена бара.

# LowestPos.Description
source: The number of bars since the latest low.
ru: Количество баров, прошедшее с момента последнего обновления минимума.

# LowestPos.Period.Name
source: Period
ru: Период

# LowestPos.Period.Description
source: Indicator period (processing window)
ru: Период индикатора (окно расчетов)

# Max.Description
source: Maximum of a few input values (from 2 to 6 inputs)
ru: Максимальное значение из нескольких (от 2 до 6 входов)

# Min.Description
source: Minimum of a few input values (from 2 to 6 inputs)
ru: Минимальное значение из нескольких (от 2 до 6 входов)

# Multiply.Description
source: Multiplies each item of input by a constant factor.
ru: Умножение каждого элемента входной серии на заданный коэффициент.

# Not.Description
source: Negation. Incoming logical value is changed to the opposite. TRUE changes to FALSE, FALSE changes to TRUE.
ru: Логическое отрицание. Меняет входящее логическое значение на противоположное. Если на входе true то на выходе false, если на входе false, то на выходе true.

# Open.Description
source: Opening price of the bar.
ru: Цена открытия бара.

# OpenInterest.Description
source: Open interest as recieved from data feed. This value is shown also in 'Quotes' table.
ru: Открытый интерес (объём открытых позиций) инструмента в том виде, как его присылает брокер. Эта же величина показывается в таблице 'Котировки'.

# OptVolatility.Description
source: Theoretical option volatility received from the Exchange. This value is also shown at the Quotes window.
ru: Теоретическая волатильность опциона (если есть) в том виде, как её присылает биржа. Эта же величиная показывается в таблице 'Котировки'.

# Or.Description
source: Logical disjunction of a few input values (from 2 to 30 inputs). Output is TRUE if at least one input is TRUE.
ru: Операция логическое 'ИЛИ' нескольких значений (от 2 до 30 входов). На выходе true, если хотя бы один вход имеют значение true.

# ResettableControlledBoolConst.Description
source: Resettable controlled boolean constant (switch). If input is TRUE the result is taken from a field 'Value', otherwise the result is taken from a field 'Default value'. Second input determines 'Value'. If it contains more TRUE, then 'Value' is set to 'Default value'.
ru: Сбрасываемая управляемая логическая константа (переключатель). При поступлении на вход значения 'Истина' данный блок выдает значение из поля 'Значение', при поступлении на вход значения 'Ложь' используется 'Значение по умолчанию'. Второй вход определяет чему равно 'Значение'. Если в нем больше истин, то 'Значение' становится равно 'Значению по умолчанию'.

# ResettableControlledBoolConst.Value.Name
source: Value
ru: Значение

# ResettableControlledBoolConst.Value.Description
source: A value to return as output of a handler when input is true
ru: Значение на выходе блока, если на вход подать 'Истина'

# ResettableControlledBoolConst.DefaultValue.Name
source: Default value
ru: Значение по умолчанию

# ResettableControlledBoolConst.DefaultValue.Description
source: A value to return as output of a handler when input is false
ru: Значение на выходе блока, если на вход подать 'Ложь'

# SecDivideWith.Description
source: Handler converts bars of an input to a synthetic security (each incoming bar is divided by an individual weight from a second input).
ru: Кубик преобразует бары на входе в синтетический инструмент (каждый исходный бар делится на свой вес, взятый из второго входа).

# SecDivideWith.Decimals.Name
source: Decimals
ru: Десятичных знаков

# SecDivideWith.Decimals.Description
source: Decimals for ceiling
ru: Количество десятичных знаков после запятой при округлении чисел вверх

# SecMultiply.Description
source: Handler converts bars of an input to a synthetic security (all prices of incoming bars are multiplied by a given coefficient).
ru: Кубик преобразует бары на входе в синтетический инструмент (все цены исходных баров умножаются на заданный коэффициент).

# SecMultiplyWith.Description
source: Handler converts bars of an input to a synthetic security (each incoming bar is multiplied by an individual weight from a second input).
ru: Кубик преобразует бары на входе в синтетический инструмент (каждый исходный бар умножаются на свой вес, взятый из второго входа).

# SecMultiplyWith.Decimals.Name
source: Decimals
ru: Десятичных знаков

# SecMultiplyWith.Decimals.Description
source: Decimals for ceiling
ru: Количество десятичных знаков после запятой при округлении чисел вверх

# SellCount.Description
source: Shows the number of sales (asks). This value is shown also in 'Quotes' table.
ru: Суммарное текущее количество заявок на продажу. Эта же величина показывается в таблице 'Котировки'.

# SessionClose.Description
source: Shows a session close trade price.
ru: Цена закрытия торговой сессии.

# SessionHeld.Description
source: A current bar index from start of current trading day.
ru: Показывает текущий порядковый номер бара c начала сессии.

# SessionHigh.Description
source: Shows the session highest trade price.
ru: Максимальное значение сессии.

# SessionLow.Description
source: Shows the session lowest trade price.
ru: Минимальное значение сессии.

# SessionOpen.Description
source: Shows a session opening trade price.
ru: Цена открытия торговой сессии.

# Shift.Description
source: Moves values for N candles to the right.
ru: Сдвиг значений на N свечей вправо.

# Shift.Period.Name
source: Period
ru: Период

# Shift.Period.Description
source: Indicator period (processing window)
ru: Период индикатора (окно расчетов)

# StepPrice.Description
source: A step price recorded at the end of every bar (if available).
ru: Стоимость шага цены, запомненная в конце каждого бара (если доступно).

# TheoreticalPrice.Description
source: Theoretical instrument price received from the Exchange. This value is also shown at the Quotes window.
ru: Теоретическая цена инструмента (если есть) в том виде, как её присылает брокер. Эта же величиная показывается в таблице 'Котировки'.

# Tick.Name
source: Price step
ru: Шаг цены

# Tick.Description
source: Price step of a security. This value is shown also in 'Quotes' table.
ru: Шаг цены инструмента. Эта же величина показывается в таблице 'Котировки'.

# Time.Description
source: Time of every bar is converted to number as hhmmss.
ru: Время каждого бара преобразуется в число в формате ЧЧММСС. Внимание! Блок 'Время' рассчитывается в момент пересчета агента. Соотвественно, выполнение входа в позицию и выполнение выхода из позиции возможны в указанный период времени работы агента + интервал пересчета агента. Если время выполнения заявки запланировано на момент позже времени закрытия торговой сессии, то данная заявка будет исполнена на следующий день.

# TimeInMins.Description
source: Time of the bar from midnight in minutes. I.e. time 10:31 converts to a number 631.
ru: Время бара в минутах от начала дня. Например, время бара 10:31 превратится в число 631.

# Volume.Description
source: Volume of the bar
ru: Объем заключенных контрактов - количество операций с фьючерсными контрактами или опционами, совершенными за определенный период времени.

# AbsolutCommission.Description
source: Absolute commission for one trade (long or short)
ru: Значение комиссии на одну сделку (покупка или продажа) в абсолютных величинах.

# RelativeCommisionWithMinimal.Description
source: Relative commission for one trade (long or short) as percents. Minumum absolute comission for a trade is additionally applied.
ru: Значение комиссии на одну сделку (покупка или продажа) в процентах. Также можно указать минимальную абсолютную комиссию за сделку.

# RelativeCommission.Description
source: Relative commission for one trade (long or short) as percents. Cost of money: is used to get a price of a borrowed funds.
ru: Значение комиссии на одну сделку (покупка или продажа) в процентах. Стоимость денег: Применяется для расчета цены заемных средств, то есть торговли с плечом. Для коротких позиций считается со всей суммы сделки. Для длинной как число лотов -1 помноженное на цену лота.

# TextHandler.Description
source: This block has no entries. It has an editable text parameter which returns as a result of its work.
ru: Блок без входов. Содержит редактируемый строковый параметр, который будет возвращаться из блока в качестве результата его работы.

# BoolBreaker.Value.Name
source: Value
ru: Значение

# BoolBreaker.Value.Description
source: A value to return as output of a handler
ru: Значение на выходе блока

# BoolConst.Value.Name
source: Value
ru: Значение

# BoolConst.Value.Description
source: A value to return as output of a handler
ru: Значение на выходе блока

# IvSmileRescaled2.OptPxMode.Name
source: Price mode
ru: Вид цены

# IvSmileRescaled2.OptPxMode.Description
source: Algorythm to get option price
ru: Алгоритм расчета цены опциона

# IvSmileRescaled2.OptionType.Name
source: Option type
ru: Тип опциона

# IvSmileRescaled2.OptionType.Description
source: Option type to be used by handler (call, put, best volatility)
ru: Тип опционов для расчетов (колл, пут, лучшая волатильность)

# IvSmileRescaled2.ShiftBid.Name
source: Shift Bid
ru: Сдвиг бидов

# IvSmileRescaled2.ShiftBid.Description
source: Shift Bids down (price steps)
ru: Сдвиг котировок Bid на заданное количество шагов цены вниз

# IvSmileRescaled2.ShiftAsk.Name
source: Shift Ask
ru: Сдвиг асков

# IvSmileRescaled2.ShiftAsk.Description
source: Shift Asks up (price steps)
ru: Сдвиг котировок Ask на заданное количество шагов цены вверх

# IvSmileRescaled2.MaxSigmaPct.Name
source: Max sigma, %
ru: Максимальная волатильность, %

# IvSmileRescaled2.MaxSigmaPct.Description
source: Maximum volatility (percents)
ru: Максимальное допустимое значение волатильности

# QuoteIvDeribit.Name
source: Quote volatility (Deribit)
ru: Котирование волатильности (Deribit)

# QuoteIvDeribit.Description
source: Quote volatility (special for Deribit)
ru: Котирование волатильности (c учетом необходимости домножить цены на курс конвертации)

# QuoteIvDeribit.Strike.Name
source: Strike
ru: Страйк

# QuoteIvDeribit.Strike.Description
source: Option strike
ru: Страйк опциона

# QuoteIvDeribit.OptionType.Name
source: Option Type
ru: Вид опционов

# QuoteIvDeribit.OptionType.Description
source: Option type (when Any, the handler will choose out-of-the-money security)
ru: Тип опционов (Any предполагает автоматический выбор, чтобы котировать всегда опционы вне-денег)

# QuoteIvDeribit.ExecuteCommand.Name
source: Execute
ru: Исполнить

# QuoteIvDeribit.ExecuteCommand.Description
source: Execute
ru: Исполнить

# QuoteIvDeribit.CancelAllLong.Name
source: Cancel all long
ru: Отменить все покупки

# QuoteIvDeribit.CancelAllLong.Description
source: Cancel long quotes in all strikes
ru: Отменить котирование покупок во всех страйках

# QuoteIvDeribit.CancelAllShort.Name
source: Cancel all short
ru: Отменить все продажи

# QuoteIvDeribit.CancelAllShort.Description
source: Cancel short quotes in all strikes
ru: Отменить котирование продаж во всех страйках

# QuoteIvDeribit.Qty.Name
source: Size
ru: Кол-во

# QuoteIvDeribit.Qty.Description
source: Trade quantity. Negative value reverts the signal.
ru: Торговый объём. Отрицательное значение приведет к перевороту сигнала.

# QuoteIvDeribit.ShiftIvPct.Name
source: Shift IV
ru: Сдвиг волатильности

# QuoteIvDeribit.ShiftIvPct.Description
source: Shift quote relative to the smile (in percents of volatility)
ru: Сдвиг котировки относительно улыбки (в процентах волатильности)

# QuoteIvDeribit.ShiftPrice.Name
source: Shift price
ru: Сдвиг цены

# QuoteIvDeribit.ShiftPrice.Description
source: Shift quote relative to the shifted smile (in price steps)
ru: Сдвиг котировки относительно сдвинутой улыбки (в шагах цены)

# QuoteIvDeribit.StrikeStep.Name
source: Strike step
ru: Шаг страйков

# QuoteIvDeribit.StrikeStep.Description
source: Strike step to extract most important options
ru: Шаг страйков для выделения главных подсерий

# ShowIvTargetsDeribit.Name
source: Show IV Targets (Deribit)
ru: Заявки по волатильности (Deribit)

# ShowIvTargetsDeribit.Description
source: Show volatility limit orders (special for Deribit)
ru: Показать котировки по волатильности (c учетом необходимости домножить цены на курс конвертации)

# ShowIvTargetsDeribit.IsLong.Name
source: Long
ru: Длинные

# ShowIvTargetsDeribit.IsLong.Description
source: Show long orders
ru: Показывать длинные заявки

# SingleSeriesNumericalDeltaDeribit3.Name
source: Numerical delta Deribit (IntSer)
ru: Численная дельта Deribit (IntSer)

# SingleSeriesNumericalDeltaDeribit3.Description
source: Estimates a delta using a position profile
ru: Численный расчет дельты позиции непосредственно на основе её профиля

# SingleSeriesNumericalDeltaDeribit3.FutNominal.Name
source: Futures nominal
ru: Номинал фьючерсов

# SingleSeriesNumericalDeltaDeribit3.FutNominal.Description
source: Nominal value of Deribit futures (by default is 10 USD)
ru: Номинальный размер фьючерса Дерибит (по умолчанию 10 USD)

# SingleSeriesNumericalDeltaDeribit3.ProfileAsBtc.Name
source: Profile in BTC?
ru: Профиль в биткойнах?

# SingleSeriesNumericalDeltaDeribit3.ProfileAsBtc.Description
source: Calculate profile as bitcoins
ru: Вычислить профиль позиции в биткойнах

# SingleSeriesNumericalDeltaDeribit3.TooltipFormat.Name
source: Tooltip Format
ru: Формат подсказки

# SingleSeriesNumericalDeltaDeribit3.TooltipFormat.Description
source: Tooltip format (i.e. '0.00', '0.0##' etc)
ru: Формат числа для тултипа. Например, '0.00', '0.0##' и т.п.

# SingleSeriesNumericalDeltaDeribit3.SigmaMult.Name
source: Width multiplier
ru: Множитель ширины

# SingleSeriesNumericalDeltaDeribit3.SigmaMult.Description
source: Width multiplier
ru: Множитель ширины

# SingleSeriesNumericalDeltaDeribit3.ShowNodes.Name
source: Show nodes
ru: Показывать узлы

# SingleSeriesNumericalDeltaDeribit3.ShowNodes.Description
source: Nodes are shown when true
ru: При true будет показывать узлы на отображаемой линии

# SingleSeriesProfileDeribit.Name
source: Single series profile (Deribit)
ru: Профиль позиции (одна серия, Deribit)

# SingleSeriesProfileDeribit.Description
source: A single series position profile (change of currency rate is not included) as a function of BA price (special for Deribit)
ru: Профиль позиции для одиночной опционной серии (без учета валютной составляющей) как функция цены БА (c учетом необходимости домножить цены на курс конвертации)

# SingleSeriesProfileDeribit.GreekAlgo.Name
source: Greek Algo
ru: Алгоритм улыбки

# SingleSeriesProfileDeribit.GreekAlgo.Description
source: FrozenSmile - smile is frozen; ShiftingSmile - smile shifts horizontally without modification
ru: FrozenSmile -- улыбка заморожена; ShiftingSmile -- улыбка без искажений сдвигается по горизонтали вслед за БА

# SingleSeriesProfileDeribit.TooltipFormat.Name
source: Tooltip Format
ru: Формат подсказки

# SingleSeriesProfileDeribit.TooltipFormat.Description
source: Tooltip format (i.e. '0.00', '0.0##' etc)
ru: Формат числа для тултипа. Например, '0.00', '0.0##' и т.п.

# SingleSeriesProfileDeribit.TwoSideDelta.Name
source: Two side delta
ru: Две дельты

# SingleSeriesProfileDeribit.TwoSideDelta.Description
source: Calculate delta to the left and to the right from the strike
ru: Вычислить дельту с двух сторон от страйка

# SingleSeriesProfileDeribit.FutNominal.Name
source: Futures nominal
ru: Номинал фьючерсов
