Repository: TSLab-Dev/Handlers
Catalog: Properties/Resources.*.resx
Languages: ru

# MACDEx.Description
source: The Moving Average Convergence/Divergence with calculation periods unlocked for optimization (First EMA - Second EMA).
ru: MACD с возможностью менять параметры мувингов и использовать их в оптимизаторе (Первая EMA - Вторая EMA).

# MACDSig.Description
source: The MACD signal line.
ru: Сигнальная линия MACD.

# MAMA.Description
source: The Mesa Adaptive Moving Average.
ru: Мезоадаптивное сглаженное скользящее среднее.

# MedianPrice.Description
source: This function sums up values of High and Low in the bar, and then divides this sum by 2. This value is the middle of the bar.
ru: Функция суммирует значения цен High и Low для бара, а затем делит эту сумму на 2. Это значение является серединой бара.

# Momentum.Name
source: Momentum
ru: Моментум

# Momentum.Description
source: The Momentum indicator. Calculated as Momentum Simple = C[0] - C[n], C[0] - a current period closing price. С[n] - a closing price as it was N periods ago.
ru: Индикатор момента (Momentum indicator). Рассчитывается как Momentum Simple = C[0] - C[n], где C[0] - цена закрытия текущего периода, а С[n] - цена закрытия N периодов назад.

# Momentum.Period.Name
source: Period
ru: Период

# Momentum.Period.Description
source: Indicator period (processing window)
ru: Период индикатора (окно расчетов)

# MomentumOsc.Description
source: The Chande Momentum Oscillator.
ru: Осциллятор Моментум Тушара Чандэ (Tushar Chande).

# MomentumOsc.Period.Name
source: Period
ru: Период

# MomentumOsc.Period.Description
source: Indicator period (processing window)
ru: Период индикатора (окно расчетов)

# MomentumPct.Description
source: The Momentum indicator, also known as Rate Of Change (ROC). Does not accept any negative values, calculated in percents as MOMENTUM = CLOSE[i] / CLOSE[i - n] * 100)
ru: Индикатор момента (Momentum indicator) нормированный, также известен как Rate Of Change (ROC). Отрицательных значений не принимает, рассчитывается в процентах как MOMENTUM = CLOSE[i] / CLOSE[i - n] * 100.

# MomentumPct.Period.Name
source: Period
ru: Период

# MomentumPct.Period.Description
source: Indicator period (processing window)
ru: Период индикатора (окно расчетов)

# ParabolicSAR.Description
source: The Parabolic Time/Price System.
ru: Parabolic Time/Price System (Параболическая система цены/времени).

# Relative.Description
source: Relative change of price starting from the beginning of some period applied in the chart. The first bar closing price is considered to be one unit and other values are based on this unit. Indicator values are presented as percents.
ru: Относительное изменение цены от начала диапазона графика. За единицу принимается значение закрытия первого бара и дальше строятся значения относительно него (в процентах).

# RelativeForPeriod.Description
source: Relative change of price starting from the beginning of configured timeframe. Indicator values are presented as percents.
ru: Относительное изменение цены от начала выбранного таймфрейма. Значения указываются относительно начала периода (в процентах).

# RSI.Description
source: The Relative Strength Index is a momentum oscillator, measuring velocity and magnitude of directional price movements.
ru: Индекс относительной силы (Relative strength index), следующий за ценами осциллятор, который колеблется в диапазоне от 0 до 100.

# RSI.Period.Name
source: Period
ru: Период

# RSI.Period.Description
source: Indicator period (processing window)
ru: Период индикатора (окно расчетов)

# SMA.Description
source: The Simple Moving Average is calculated by summing up incoming values, for example, instrument close prices of some period. The result is divided by a period value.
ru: Простое (арифметическое) скользящее среднее. Рассчитывается путем сложения входящих значений, например, цен закрытия инструмента за определенный период, затем полученная сумма делится на значение периода.

# SMA.Period.Name
source: Period
ru: Период

# SMA.Period.Description
source: Indicator period (processing window)
ru: Период индикатора (окно расчетов)

# SMMA.Description
source: The Smoothed Moving Average.
ru: Сглаженное скользящее среднее (Smoothed Moving Average, SMMA).

# SMMA.Period.Name
source: Period
ru: Период

# SMMA.Period.Description
source: Indicator period (processing window)
ru: Период индикатора (окно расчетов)

# StDev.Description
source: The Standard Deviation indicator (RMS deviation).
ru: Standard Deviation, стандартное отклонение (среднеквадратическое отклонение).

# StDev.Period.Name
source: Period
ru: Период

# StDev.Period.Description
source: Indicator period (processing window)
ru: Период индикатора (окно расчетов)

# StochK.Description
source: The Stochastic Oscillator = (Current bar closing price - Period minimum value calculated on bar minimum) / (Bar maximum value calculated on bar maximum - Bar minimum value based on bar minimum) * 100. This indicator shows how close price is to its upper and lower borders.The indicator varies in the range from 0 to 100.
ru: Стохастический осциллятор (Stochastic Oscillator) = (Цена закрытия текущего бара - Минимальное значение за период от минимума бара) / (Максимальное значение за период от максимума бара - Минимальное значение за период от минимума бара) * 100. Стохастический осциллятор измеряет насколько цена близка к своим верхним или нижним границам. Индикатор изменяется в диапазоне от 0 до 100.

# StochK.Period.Name
source: Period
ru: Период

# StochK.Period.Description
source: Indicator period (processing window)
ru: Период индикатора (окно расчетов)

# StochRSI.Description
source: Stochastics based on relative strength index. StochRSI = (Current RSI - period minimum RSI) / (Period maximum RSI - period minimum RSI) * 100.
ru: Стохастик от индекса относительной силы. StochRSI = (Текущее значение RSI - Минимальное значение RSI за период) / (Максимальное значение RSI за период - Минимальное значение RSI за период) * 100.

# StochRSI.Period.Name
source: Period
ru: Период

# StochRSI.Period.Description
source: Indicator period (processing window)
ru: Период индикатора (окно расчетов)

# SumForTimeFrameHandler.Description
source: Sum for time frame
ru: Сумма за таймфрейм

# SummFor.Description
source: Sums up incoming values, for example, this indicator can sum up instrument close prices in some period.
ru: Рассчитывается путем сложения входящих значений, например, цен закрытия инструмента за определенный период.

# SummFor.Period.Name
source: Period
ru: Период

# SummFor.Period.Description
source: Indicator period (processing window)
ru: Период индикатора (окно расчетов)

# TEMA.Description
source: The Triple Exponential Moving Average.
ru: Тройное экспоненциальное сглаженное скользящее среднее.

# TEMA.Period.Name
source: Period
ru: Период

# TEMA.Period.Description
source: Indicator period (processing window)
ru: Период индикатора (окно расчетов)

# TestCanvasPaneHandler.Description
source: Test handler to check interaction with a CanvasPane. It is visible in developer build only.
ru: Тестовый кубик для проверки работы с CanvasPane. Виден только в девелоперской версии.

# TRIX.Description
source: The Triple Exponential Average.
ru: Тройное экспоненциальное скользящее.

# TRIX.Period.Name
source: Period
ru: Период

# TRIX.Period.Description
source: Indicator period (processing window)
ru: Период индикатора (окно расчетов)

# TrueRange.Description
source: The True Range (TR) is the biggest one from these three values: difference between current maximum and minimum; difference between a previous closing price and a current maximum; difference between a previous closing price and a current minimum.
ru: Истинный диапазон (True Range - TR) - это наибольшая из следующих трех величин: разница между текущими максимумом и минимумом; разница между предыдущей ценой закрытия и текущим максимумом; разница между предыдущей ценой закрытия и текущим минимумом.

# TypicalPrice.Description
source: The Typical Price is an average price based on High, Low and Close. The result is called an average or typical price.
ru: Типичная цена представляет из себя среднее от High, Low и Close. Результат называют средней или типичной ценой.

# Volatility.Description
source: Variation: average of squared difference of values and corresponding SMA.
ru: Квадратичная вариация: вычисляется SMA(Period), вычисляется отклонение значений от среднего, разность возводится в квадрат. Затем вычисляется среднее значение этих отклонений. Корень НЕ ИЗВЛЕКАЕТСЯ.

# Volatility.Period.Name
source: Period
ru: Период

# Volatility.Period.Description
source: Indicator period (processing window)
ru: Период индикатора (окно расчетов)

# ZeroLagTEMA.Description
source: The Triple Exponential Moving Average with a limited lag.
ru: Тройное экспоненциальное сглаженное скользящее среднее с ограниченной задержкой.

# ZeroLagTEMA.Period.Name
source: Period
ru: Период

# ZeroLagTEMA.Period.Description
source: Indicator period (processing window)
ru: Период индикатора (окно расчетов)

# AgentCurrentPosition.Description
source: This block shows a calculated position of an agent.
ru: Отображает расчетную позицию агента.

# CurrentPosition.Description
source: Shows a total position involving an instrument. In laboratory mode this block shows a calculated position of a script. In agent mode this block shows a value of the Current column(in the Positions window) for tradable sources.
ru: Показывает совокупную позицию по бумаге. В режиме лаборатории отображается расчетная позиция скрипта. В режиме агента отображается значение из колонки 'Текущая' окна 'Позиции' для торгуемых источников.

# EstimatedMoney.Description
source: Shows your portfolio estimation. In agent mode portfolio estimation is received from your account. In laboratory mode portfolio estimation is calculated according the following formula: Portfolio Estimation = money + positions.
ru: Показывает оценку портфеля. В режиме агента информация транслируется со счета. В режиме лаборатории рассчитывается на основании позиции по формуле: Оценка портфеля = деньги + позиции.

# FreeMoney.Description
source: Shows free money in your account. In agent mode information about free money is received from your account. In laboratory mode information about free money is calculated according to the following formula: Free Money = money - (minus)positions - (minus)money blocked in orders.
ru: Показывает наличие свободных денег на счету. В режиме агента информация транслируется со счета. В режиме лаборатории рассчитывается на основании позиций по формуле: Свободные деньги = деньги - позиции - деньги блокированные в заявках.

# NumDaysProfit.Description
source: Calculates profit involving an instrument received during a specified number of days.
ru: Считает доход по бумаге за указанное количество дней.

# NumDaysProfit.Period.Name
source: Period
ru: Период

# NumDaysProfit.Period.Description
source: Indicator period (processing window)
ru: Период индикатора (окно расчетов)

# NumMinutesProfit.Description
source: Calculates profit involving an instrument received during a specified number of minutes.
ru: Считает доход по бумаге за указанное количество минут.

# NumMinutesProfit.Period.Name
source: Period
ru: Период

# NumMinutesProfit.Period.Description
source: Indicator period (processing window)
ru: Период индикатора (окно расчетов)

# NumPositionsProfit.Description
source: Calculates profit involving an instrument received during a specified number of positions.
ru: Считает доход по бумаге за указанное количество позиций.

# NumPositionsProfit.Period.Name
source: Period
ru: Период

# NumPositionsProfit.Period.Description
source: Indicator period (processing window)
ru: Период индикатора (окно расчетов)

# WholeDayProfit.Description
source: Calculates profit involving an instrument received in all trades of the day.
ru: Считает доход по бумаге по сделкам за день.

# WholeTimeProfit.Description
source: Calculates profit involving an instrument received in all trades of the whole period.
ru: Считает доход по бумаге по сделкам за все время.

# HoldSignalForNBars.Description
source: Holds a signal TRUE for some number of bars.
ru: Удерживает сигнал 'Истина' в течение заданного количества баров после его появления.

# HoldSignalForNBars.NBars.Description
source: Hold signal for N bars
ru: Удерживать сигнал в течение N баров

# InteractiveConstGen.Value.Name
source: Value
ru: Значение

# InteractiveConstGen.Value.Description
source: Value of a constant
ru: Значение константы

# InteractiveConstGen.PaneSide.Name
source: Pane side
ru: Сторона графика

# InteractiveConstGen.PaneSide.Description
source: Pane side (vertical axis)
ru: Сторона графика (вертикальная ось)

# InteractiveConstGen.Color.Name
source: Color
ru: Цвет

# InteractiveConstGen.Color.Description
source: Color in hexadecimal RGB format (i.e. #ff0000 - red, #00ff00 - green, #0000ff - blue)
ru: Цвет в шестнадцатеричном формате RGB (например, #ff0000 - красный, #00ff00 - зеленый, #0000ff - синий)

# InteractiveConstGen.Thickness.Name
source: Thickness
ru: Толщина

# InteractiveConstGen.Thickness.Description
source: Thickness of a line
ru: Толщина линии

# InteractiveLineGen.PaneSide.Name
source: Pane side
ru: Сторона графика

# InteractiveLineGen.PaneSide.Description
source: Pane side (vertical axis)
ru: Сторона графика (вертикальная ось)

# InteractiveLineGen.Color.Name
source: Color
ru: Цвет

# InteractiveLineGen.Color.Description
source: Color in hexadecimal RGB format (i.e. #ff0000 - red, #00ff00 - green, #0000ff - blue)
ru: Цвет в шестнадцатеричном формате RGB (например, #ff0000 - красный, #00ff00 - зеленый, #0000ff - синий)

# InteractiveLineGen.Thickness.Name
source: Thickness
ru: Толщина

# InteractiveLineGen.Thickness.Description
source: Thickness of a line
ru: Толщина линии

# InteractiveLineGen.FirstValue.Name
source: First value
ru: Первое значение

# InteractiveLineGen.FirstValue.Description
source: Y value of a first point
ru: Координата Y первой точки

# InteractiveLineGen.SecondValue.Name
source: Second value
ru: Второе значение

# InteractiveLineGen.SecondValue.Description
source: Y value of a second point
ru: Координата Y второй точки

# MessageHandler.Description
source: When input becomes TRUE a handler sends user message to a TSLab log.
ru: При появлении на входе блока значения 'Истина' выводит в лог программы пользовательское сообщение.

# TestCanvasPaneHandler.Value.Name
source: Value
ru: Значение

# TestCanvasPaneHandler.Value.Description
source: Value of a constant
ru: Значение константы

# BalancedPrice.Description
source: An average position entry price.
ru: Средняя цена входа в позицию. Если вход был один, то равна цене входа, если были изменения позиции, то равна средневзвешенной цене всех приращений позиции. При уменьшении позиции цена входа не меняется, но изменяется фиксированная часть п/у.

# BarsHeld.Description
source: Returns the number of bars to hold the position.
ru: Возвращает количество баров удержания позиции.

# CalcEntryPrice.Description
source: The calculated price of the trade at which the position was opened. In the laboratory mode it is equal to the opening price of the bar following the signal.
ru: Расчетная цена сделки, по которой открылась позиция. Для режима лаборатории это цена открытия следующего за сигналом бара. Внимание! Если вход произошел не по расчетной свече, то расчетная цена не может быть восстановлена.

# DaysInPosition.Description
source: The number of days in position.
ru: Количество дней в позиции с момента входа.

# DrowdownCount.Description
source: Calculates the number of consecutive loss positions.
ru: Подсчет количества убыточных позиций подряд.

# EntryDate.Description
source: A date of position entry presented as number in YYMMDD format.
ru: Дата входа в позицию, представленная как число в формате ГГММДД.

# EntryPrice.Description
source: In the laboratory mode, the price of the deal at which the position was opened. In real trading mode, the average price of transactions for the placed order. If the transaction prices are unknown, the price is taken from the order. If the order was placed with the "by market" type, then the price of 0 or the price of the upper or lower limit (for futures) for the instrument is taken.
ru: Цена сделки, по которой открылась позиция. Для режима реальных торгов это цена по которой была выставлена заявка на открытие позиции.

# EntryTime.Description
source: Time of position entry presented as number in HHMMSS format.
ru: Время входа в позицию, представленное как число в формате ЧЧММСС.

# HasLongPositionActive.Description
source: The Boolean function verifying if there is an active long position.
ru: Логическая функция проверяющая наличие активной длинной позиции.

# HasPositionActive.Description
source: The Boolean function verifying that there is an active position.
ru: Логическая функция проверяющая наличие активной позиции.

# HasShortPositionActive.Description
source: The Boolean function verifying that there is an active short position.
ru: Логическая функция проверяющая наличие активной короткой позиции.

# HasTwoLoss.Description
source: 2 or more consecutive loss positions.
ru: Наличие двух или более убыточных позиций подряд.

# IsItLossAtLastPosition.Description
source: Check if a closed position was unprofitable.
ru: Проверяет наличие убытка по закрытой позиции.

# LastClosedIsLong.Description
source: The latest position has been closed and it was long.
ru: Последняя позиция была закрыта и она длинная.

# LastClosedIsLong2.Description
source: The Boolean function verifying that the latest closed position was long.
ru: Логическая функция проверяющая, что последняя закрытая позиция была длинной.

# LastClosedIsShort.Description
source: The latest position has been closed and it was short.
ru: Последняя позиция была закрыта и она короткая.

# LastClosedIsShort2.Description
source: The Boolean function verifying that the latest closed position was short.
ru: Логическая функция проверяющая, что последняя закрытая позиция была короткой.

# LastClosedNamePositionExitDate.Description
source: The exit date of the latest closed named position (a number with format YYMMDD).
ru: Дата выхода последней закрытой позиции по имени (число в формате ГГММДД).

# LastClosedNamePositionExitDate.Name.Name
source: Name
ru: Имя

# LastClosedNamePositionExitDate.Name.Description
source: Close signal name
ru: Имя сигнала закрытия

# LastClosedNamePositionExitTime.Description
source: The exit time of the latest closed named position (a number with format HHMMSS).
ru: Время выхода последней закрытой позиции по имени (число в формате ЧЧММСС).

# LastClosedNamePositionExitTime.Name.Name
source: Name
ru: Имя

# LastClosedNamePositionExitTime.Name.Description
source: Close signal name
ru: Имя сигнала закрытия

# LastClosedNamePositionExitPrice.Description
source: The exit price of the latest closed named position.
ru: Цена выхода последней закрытой позиции по имени.

# LastClosedNamePositionExitPrice.Name.Name
source: Name
ru: Имя

# LastClosedNamePositionExitPrice.Name.Description
source: Close signal name
ru: Имя сигнала закрытия

# LastClosedPositionDate.Description
source: The date of the latest closed position (a number with format YYMMDD).
ru: Дата последней закрытой позиции (число в формате ГГММДД).

# LastClosedPositionExitDate.Description
source: The exit date of the latest closed position (a number with format YYMMDD).
ru: Время выхода последней закрытой позиции (число в формате ГГММДД).

# LastClosedPositionExitTime.Description
source: The exit time of the latest closed position (a number with format HHMMSS).
ru: Время выхода последней закрытой позиции (число в формате ЧЧММСС).

# LastClosedPositionTime.Description
source: The time of the latest closed position (a number with format HHMMSS).
ru: Время последней закрытой позиции (число в формате ЧЧММСС).

# LastExitPrice.Description
source: The price of the latest exit.
ru: Цена последнего выхода.

# MAE.Description
source: Maximum Adverse Excursion per one contract/lot.
ru: Maximum Adverse Excursion - максимальное неблагоприятное отклонение цены от позиции в абсолютных величинах. В расчете на один контракт/лот.

# MAEPct.Description
source: Maximum Adverse Excursion per one contract/lot (as percents).
ru: Maximum Adverse Excursion - максимальное неблагоприятное отклонение цены от позиции в процентах. В расчете на один контракт/лот.

# Median.Description
source: Shows deviation of the income curved line from the median.
ru: Показывает отклонение кривой прибыли от медианы.

# MFE.Description
source: Maximum Favorable Excursion per one contract/lot.
ru: Maximum Favorable Excursion - максимальное благоприятное отклонение цены от позиции в абсолютных величинах. В расчете на один контракт/лот.

# MFEPct.Description
source: Maximum Favorable Excursion per one contract/lot (as percents).
ru: Maximum Favorable Excursion Максимальное благоприятное отклонение цены от позиции в процентах. В расчете на один контракт/лот.

# MinutesInPosition.Description
source: The number of minutes in position.
ru: Количество минут в позиции с момента входа.

# PosActiveNameExit.Description
source: The parameter allows to give name the block Position Close. The value of this block is true if the last close for the instrument had this name.
ru: В параметре задается имя блока закрытия позиции. Значение данного блока верно, если последним закрытием по финансовому инструменту было закрытие с заданным именем.

# PosActiveNameExit.Name.Name
source: Name
ru: Имя

# PosActiveNameExit.Name.Description
source: Close signal name
ru: Имя сигнала закрытия

# PositionChangeEntryBarNumber.Description
source: Shows entry bar number of a changed complex position.
ru: Показывает номер бара входа в измененную сложносоставную позицию.

# PositionChangeEntryPrice.Description
source: Shows last entry price of a changed complex position. If none handler returns zero.
ru: Показывает цену последнего входа в сложносоставную позицию. Если определить цену нельзя, возвращает нуль.

# PositionChangeExitBarNumber.Description
source: Shows exit bar number of a changed complex position.
ru: Показывает номер бара выхода из измененной сложносоставной позиции.

# PositionChangeExitPrice.Description
source: Shows last exit price of a changed complex position. If none handler returns zero.
ru: Показывает цену последнего выхода из сложносоставной позиции.

# PositionEntryBarNumber.Description
source: Shows a complex position entry bar number.
ru: Показывает порядковый номер бара в момент входа в позицию.

# PositionExitBarNumber.Description
source: Shows a complex position exit bar number.
ru: Показывает порядковый номер бара в момент выхода из позиции.

# PositionIsVirtualClosedHandler.Description
source: Is position has virtual close (calculated only)?
ru: Позиция закрыта виртуально (рассчетно, сделок еще не было)?

# PositionIsVirtualHandler.Description
source: A handler returns TRUE if input position is virtual.
ru: Возвращает значение Истина, если позиция на входе является виртуальной.

# PositionShares.Description
source: Returns initial position size
ru: Возвращает начальный размер позиции

# PositionSharesByBar.Description
source: Returns current size of position in lots at every bar.
ru: На каждом баре возвращает текущий размер позиции в лотах.

# Profit.Description
source: Profit (loss) given by the position in absolute values. Calculated per one contract/lot.
ru: Доход (убыток) приносимый позицией в абсолютных величинах. В расчете на один контракт/лот.

# ProfitPct.Description
source: Profit (loss) given by the position in percentage valu.Calculated per one contract/lot.
ru: Доход (убыток) приносимый позицией в процентах. В расчете на один контракт/лот.
