Repository: TSLab-Dev/Handlers
Catalog: Properties/Resources.*.resx
Languages: ru

# IvSmile.MinStrike.Description
source: Min strike to be processed by handler
ru: Минимальный обрабатываемый страйк

# IvSmile.MaxStrike.Name
source: Max strike
ru: Максимальный страйк

# IvSmile.MaxStrike.Description
source: Max strike to be processed by handler
ru: Максимальный обрабатываемый страйк

# IvSmile.StrikeStep.Name
source: Strike step
ru: Шаг страйков

# IvSmile.StrikeStep.Description
source: Strike step
ru: Шаг между страйками

# BlackScholesConstSmile2.MinStrike.Name
source: Min Strike
ru: Минимальный страйк

# BlackScholesConstSmile2.MinStrike.Description
source: Min strike to be processed by handler
ru: Минимальный обрабатываемый страйк

# BlackScholesConstSmile2.MaxStrike.Name
source: Max Strike
ru: Максимальный страйк

# BlackScholesConstSmile2.MaxStrike.Description
source: Max strike to be processed by handler
ru: Максимальный обрабатываемый страйк

# BlackScholesConstSmile2.StrikeStep.Name
source: Strike Step
ru: Шаг страйков

# BlackScholesConstSmile2.StrikeStep.Description
source: Strike step
ru: Шаг между страйками

# BlackScholesDelta.MinStrike.Name
source: Min strike
ru: Минимальный страйк

# BlackScholesDelta.MinStrike.Description
source: Min strike to be processed by handler
ru: Минимальный обрабатываемый страйк

# BlackScholesDelta.MaxStrike.Name
source: Max strike
ru: Максимальный страйк

# BlackScholesDelta.MaxStrike.Description
source: Max strike to be processed by handler
ru: Максимальный обрабатываемый страйк

# BlackScholesDelta.StrikeStep.Name
source: Strike step
ru: Шаг страйков

# BlackScholesDelta.StrikeStep.Description
source: Strike step
ru: Шаг между страйками

# BlackScholesGreeks.MinStrike.Name
source: Min strike
ru: Минимальный страйк

# BlackScholesGreeks.MinStrike.Description
source: Min strike to be processed by handler
ru: Минимальный обрабатываемый страйк

# BlackScholesGreeks.MaxStrike.Name
source: Max strike
ru: Максимальный страйк

# BlackScholesGreeks.MaxStrike.Description
source: Max strike to be processed by handler
ru: Максимальный обрабатываемый страйк

# BlackScholesGreeks.StrikeStep.Name
source: Strike step
ru: Шаг страйков

# BlackScholesGreeks.StrikeStep.Description
source: Strike step
ru: Шаг между страйками

# GaussSmile.MinStrike.Name
source: Min strike
ru: Минимальный страйк

# GaussSmile.MinStrike.Description
source: Min strike to be processed by handler
ru: Минимальный обрабатываемый страйк

# GaussSmile.MaxStrike.Name
source: Max strike
ru: Максимальный страйк

# GaussSmile.MaxStrike.Description
source: Max strike to be processed by handler
ru: Максимальный обрабатываемый страйк

# GaussSmile.StrikeStep.Name
source: Strike step
ru: Шаг страйков

# GaussSmile.StrikeStep.Description
source: Strike step
ru: Шаг между страйками

# IvOnF2.UseGlobalCache.Name
source: Use Global Cache
ru: Использовать глобальный кеш

# IvOnF2.UseGlobalCache.Description
source: Use global cache
ru: Использовать глобальный кеш

# IvOnF2.AllowGlobalReadWrite.Name
source: Allow Global Write
ru: Разрешить запись

# IvOnF2.AllowGlobalReadWrite.Description
source: Permission to write to Global Cache
ru: Разрешить чтение/запись в глобальный кеш или только чтение?

# IvOnF2.GlobalSavePeriod.Name
source: Global Save Period
ru: Периодичность записи

# IvOnF2.GlobalSavePeriod.Description
source: Period to write to Global Cache
ru: Сохранять в глобальный кеш через каждые N баров

# IvOnF2.MinStrike.Name
source: Min Strike
ru: Минимальный страйк

# IvOnF2.MinStrike.Description
source: Min strike to be processed by handler
ru: Минимальный обрабатываемый страйк

# IvOnF2.MaxStrike.Name
source: Max Strike
ru: Максимальный страйк

# IvOnF2.MaxStrike.Description
source: Max strike to be processed by handler
ru: Максимальный обрабатываемый страйк

# IvOnF2.StrikeStep.Name
source: Strike Step
ru: Шаг страйков

# IvOnF2.StrikeStep.Description
source: Strike step
ru: Шаг между страйками

# SingleSeriesNumericalDelta.MinStrike.Name
source: Min Strike
ru: Минимальный страйк

# SingleSeriesNumericalDelta.MinStrike.Description
source: Min strike to be processed by handler
ru: Минимальный обрабатываемый страйк

# SingleSeriesNumericalDelta.MaxStrike.Name
source: Max Strike
ru: Максимальный страйк

# SingleSeriesNumericalDelta.MaxStrike.Description
source: Max strike to be processed by handler
ru: Максимальный обрабатываемый страйк

# SingleSeriesNumericalDelta.StrikeStep.Name
source: Strike Step
ru: Шаг страйков

# SingleSeriesNumericalDelta.StrikeStep.Description
source: Strike step
ru: Шаг между страйками

# SingleSeriesNumericalDelta3.MinStrike.Name
source: Min Strike
ru: Минимальный страйк

# SingleSeriesNumericalDelta3.MinStrike.Description
source: Min strike to be processed by handler
ru: Минимальный обрабатываемый страйк

# SingleSeriesNumericalDelta3.MaxStrike.Name
source: Max Strike
ru: Максимальный страйк

# SingleSeriesNumericalDelta3.MaxStrike.Description
source: Max strike to be processed by handler
ru: Максимальный обрабатываемый страйк

# SingleSeriesNumericalDelta3.StrikeStep.Name
source: Strike Step
ru: Шаг страйков

# SingleSeriesNumericalDelta3.StrikeStep.Description
source: Strike step
ru: Шаг между страйками

# SingleSeriesNumericalGamma.MinStrike.Name
source: Min Strike
ru: Минимальный страйк

# SingleSeriesNumericalGamma.MinStrike.Description
source: Min strike to be processed by handler
ru: Минимальный обрабатываемый страйк

# SingleSeriesNumericalGamma.MaxStrike.Name
source: Max Strike
ru: Максимальный страйк

# SingleSeriesNumericalGamma.MaxStrike.Description
source: Max strike to be processed by handler
ru: Максимальный обрабатываемый страйк

# SingleSeriesNumericalGamma.StrikeStep.Name
source: Strike Step
ru: Шаг страйков

# SingleSeriesNumericalGamma.StrikeStep.Description
source: Strike step
ru: Шаг между страйками

# SingleSeriesNumericalGamma3.MinStrike.Name
source: Min Strike
ru: Минимальный страйк

# SingleSeriesNumericalGamma3.MinStrike.Description
source: Min strike to be processed by handler
ru: Минимальный обрабатываемый страйк

# SingleSeriesNumericalGamma3.MaxStrike.Name
source: Max Strike
ru: Максимальный страйк

# SingleSeriesNumericalGamma3.MaxStrike.Description
source: Max strike to be processed by handler
ru: Максимальный обрабатываемый страйк

# SingleSeriesNumericalGamma3.StrikeStep.Name
source: Strike Step
ru: Шаг страйков

# SingleSeriesNumericalGamma3.StrikeStep.Description
source: Strike step
ru: Шаг между страйками

# SingleSeriesNumericalTheta.MinStrike.Name
source: Min Strike
ru: Минимальный страйк

# SingleSeriesNumericalTheta.MinStrike.Description
source: Min strike to be processed by handler
ru: Минимальный обрабатываемый страйк

# SingleSeriesNumericalTheta.MaxStrike.Name
source: Max Strike
ru: Максимальный страйк

# SingleSeriesNumericalTheta.MaxStrike.Description
source: Max strike to be processed by handler
ru: Максимальный обрабатываемый страйк

# SingleSeriesNumericalTheta.StrikeStep.Name
source: Strike Step
ru: Шаг страйков

# SingleSeriesNumericalTheta.StrikeStep.Description
source: Strike step
ru: Шаг между страйками

# SingleSeriesNumericalVega.MinStrike.Name
source: Min Strike
ru: Минимальный страйк

# SingleSeriesNumericalVega.MinStrike.Description
source: Min strike to be processed by handler
ru: Минимальный обрабатываемый страйк

# SingleSeriesNumericalVega.MaxStrike.Name
source: Max Strike
ru: Максимальный страйк

# SingleSeriesNumericalVega.MaxStrike.Description
source: Max strike to be processed by handler
ru: Максимальный обрабатываемый страйк

# SingleSeriesNumericalVega.StrikeStep.Name
source: Strike Step
ru: Шаг страйков

# SingleSeriesNumericalVega.StrikeStep.Description
source: Strike step
ru: Шаг между страйками

# IvOnFAllSeries.Name
source: IV ATM (all series)
ru: IV ATM (все серии)

# IvOnFAllSeries.Description
source: Implied Volatility at-the-money (all option series are processed)
ru: Подразумеваемая волатильность на деньгах (обработка сразу всех серий)

# OptionSeriesByNumber2.ExpirationMode.Name
source: Expiration Algo
ru: Алгоритм экспирации

# OptionSeriesByNumber2.ExpirationMode.Description
source: Algorythm to determine expiration date
ru: Алгоритм определения даты экспирации

# OptionSeriesByNumber2.Expiry.Name
source: Expiry
ru: Экспирация

# OptionSeriesByNumber2.Expiry.Description
source: Expiration datetime (including time of a day) for algorythm FixedExpiry
ru: Дата экспирации (включая время суток) для режима FixedExpiry

# OptionSeriesByNumber2.Number.Name
source: Series index
ru: Номер серии

# OptionSeriesByNumber2.Number.Description
source: Series index (only alive series) for algorythm ExpiryByNumber
ru: Индекс серии (учитываются только живые). Используется в режиме ExpiryByNumber.

# InteractiveConstGen.Name
source: Interactive constant
ru: Интерактивная константа

# InteractiveLineGen.Name
source: Interactive line
ru: Интерактивная линия

# NumericalDeltaOnF2.GreekAlgo.Name
source: Greek Algo
ru: Алгоритм улыбки

# NumericalDeltaOnF2.GreekAlgo.Description
source: FrozenSmile - smile is frozen; ShiftingSmile - smile shifts horizontally without modification
ru: FrozenSmile -- улыбка заморожена; ShiftingSmile -- улыбка без искажений сдвигается по горизонтали вслед за БА

# NumericalDeltaOnF2.Delta.Name
source: Delta
ru: Дельта

# NumericalDeltaOnF2.Delta.Description
source: Current delta (just to show it on ControlPane)
ru: Текущая дельта всей позиции (для отображения в интерфейсе агента)

# NumericalDeltaOnF2.HedgeDelta.Name
source: Align Delta
ru: Выровнять дельту

# NumericalDeltaOnF2.HedgeDelta.Description
source: Align delta (just to make button on ControlPane)
ru: Выровнять дельту (даёт возможность сделать в интерфейсе кнопку)

# OpenVirtualFutPosition.FixedPx.Name
source: Price
ru: Цена

# OpenVirtualFutPosition.FixedPx.Description
source: Entry price of this virtual position
ru: Цена открытия этой виртуальной позиции

# OpenVirtualFutPosition.FixedQty.Name
source: Size
ru: Кол-во

# OpenVirtualFutPosition.FixedQty.Description
source: Entry size of this virtual position
ru: Объём открытия этой виртуальной позиции

# OpenVirtualOptPosition.FixedStrike.Name
source: Strike
ru: Страйк

# OpenVirtualOptPosition.FixedStrike.Description
source: Strike of this virtual position
ru: Страйк виртуальной позиции

# OpenVirtualOptPosition.OptionType.Name
source: Option Type
ru: Вид опционов

# OpenVirtualOptPosition.OptionType.Description
source: Option type (parameter Any is not recommended)
ru: Тип опционов (использование типа Any может привести к неожиданному поведению)

# OpenVirtualOptPosition.FixedPx.Name
source: Price
ru: Цена

# OpenVirtualOptPosition.FixedPx.Description
source: Entry price of this virtual position
ru: Цена открытия этой виртуальной позиции

# OpenVirtualOptPosition.FixedQty.Name
source: Size
ru: Кол-во

# OpenVirtualOptPosition.FixedQty.Description
source: Entry size of this virtual position
ru: Объём открытия этой виртуальной позиции

# OptionSeriesByNumber.ExpirationMode.Name
source: Expiration Algo
ru: Алгоритм экспирации

# OptionSeriesByNumber.ExpirationMode.Description
source: Algorythm to determine expiration date
ru: Алгоритм определения даты экспирации

# OptionSeriesByNumber.Expiry.Name
source: Expiry
ru: Экспирация

# OptionSeriesByNumber.Expiry.Description
source: Expiration datetime (including time of a day) for algorythm FixedExpiry
ru: Дата экспирации (включая время суток) для режима FixedExpiry

# OptionSeriesByNumber.Number.Name
source: Series index
ru: Номер серии

# OptionSeriesByNumber.Number.Description
source: Series index (only alive series) for algorythm ExpiryByNumber
ru: Индекс серии (учитываются только живые). Используется в режиме ExpiryByNumber.

# TimeToExpiry.CurDateMode.Name
source: Current date algo
ru: Алгоритм поиска 'сейчас'

# TimeToExpiry.CurDateMode.Description
source: Current date algorythm
ru: Алгоритм поиска 'сейчас'

# TimeToExpiry.ExpirationMode.Name
source: Expiration algo
ru: Алгоритм экспирации

# TimeToExpiry.ExpirationMode.Description
source: Algorythm to determine expiration date
ru: Алгоритм определения даты экспирации

# TimeToExpiry.DistanceMode.Name
source: Estimation algo
ru: Алгоритм расчета

# TimeToExpiry.DistanceMode.Description
source: Algorythm to estimate time-to-expiry
ru: Алгоритм расчета времени до экспирации

# TimeToExpiry.Expiry.Name
source: Expiry
ru: Экспирация

# TimeToExpiry.Expiry.Description
source: Expiration datetime (including time of a day) for algorythm FixedExpiry
ru: Дата экспирации (включая время суток) для режима FixedExpiry

# TimeToExpiry.FixedDate.Name
source: Frozen 'today'
ru: 'Сегодня'

# TimeToExpiry.FixedDate.Description
source: Today datetime (including time of a day) for algorythm FixedDate
ru: Фиксированная дата (включая время суток). Используется в режиме FixedDate

# TimeToExpiry.UseDays.Name
source: Use days
ru: В днях

# TimeToExpiry.UseDays.Description
source: When true, handler calculates time to expiry as days
ru: При true будет считать дни, а не доли года

# TimeToExpiry.SeriesIndex.Name
source: Series index
ru: Номер серии

# TimeToExpiry.SeriesIndex.Description
source: Series index (only alive series) for algorythm ExpiryByNumber
ru: Индекс серии (учитываются только живые). Используется в режиме ExpiryByNumber.

# TimeToExpiry.Time.Name
source: Time
ru: Время

# TimeToExpiry.Time.Description
source: Time to expiry (just to show it on ControlPane)
ru: Время до экспирации (только для отображения на UI)

# TimeToExpiry.CurrentDateShift.Name
source: Current date shift
ru: Сдвиг текущей даты

# TimeToExpiry.CurrentDateShift.Description
source: Shift current date by calendar time interval
ru: Сдвинуть текущую дату на указанный интервал календарного времени

# VerticalLine.SigmaLowPct.Name
source: Sigma Low, %
ru: Нижний уровень, %

# VerticalLine.SigmaLowPct.Description
source: Low level of this marker (in percents)
ru: Нижний уровень маркера (в процентах)

# VerticalLine.SigmaHighPct.Name
source: Sigma High, %
ru: Верхний уровень, %

# VerticalLine.SigmaHighPct.Description
source: High level of this marker (in percents)
ru: Верхний уровень маркера (в процентах)

# AutoHedger.SensitivityPct.Name
source: Sensitivity Pct
ru: Чувствительность

# AutoHedger.SensitivityPct.Description
source: Delta should pass this percent of distance to next integer value to align
ru: Процент движения к следующему целому числу для выравнивания

# BlackScholesConstSmile2.SigmaPct.Name
source: Sigma, %
ru: Волатильность, %

# BlackScholesConstSmile2.SigmaPct.Description
source: Volatility (percents)
ru: Волатильность (в процентах)

# BlackScholesConstSmile2.SigmaMult.Name
source: Width multiplier
ru: Множитель ширины

# BlackScholesConstSmile2.SigmaMult.Description
source: Width multiplier
ru: Множитель ширины

# ChartTrading.Qty.Name
source: Size
ru: Кол-во

# ChartTrading.Qty.Description
source: Trade quantity. Negative value reverts the signal.
ru: Торговый объём. Отрицательное значение приведет к перевороту сигнала.

# CurrentFutPx.Qty.Name
source: Size
ru: Кол-во

# CurrentFutPx.Qty.Description
source: Trade quantity. Negative value reverts the signal.
ru: Торговый объём. Отрицательное значение приведет к перевороту сигнала.

# CurrentFutPx.TooltipFormat.Name
source: Tooltip format
ru: Формат подсказки

# CurrentFutPx.TooltipFormat.Description
source: Tooltip format (i.e. '0.00', '0.0##', 'P2' etc)
ru: Формат числа для тултипа. Например, '0.00', '0.0##', 'P2' и т.п.

# GetValueAtm.RepeatLastValue.Name
source: Repeat Last Value
ru: Повтор значения

# GetValueAtm.RepeatLastValue.Description
source: Handler should repeat last known value to avoid further logic errors
ru: При true будет находить и использовать последнее известное значение

# NumericalDeltaOnF.GreekAlgo.Name
source: Greek Algo
ru: Алгоритм улыбки

# NumericalDeltaOnF.GreekAlgo.Description
source: FrozenSmile - smile is frozen; ShiftingSmile - smile shifts horizontally without modification
ru: FrozenSmile -- улыбка заморожена; ShiftingSmile -- улыбка без искажений сдвигается по горизонтали вслед за БА

# NumericalDeltaOnF.Delta.Name
source: Delta
ru: Дельта

# NumericalDeltaOnF.Delta.Description
source: Current delta (just to show it on ControlPane)
ru: Текущая дельта всей позиции (для отображения в интерфейсе агента)

# NumericalDeltaOnF.HedgeDelta.Name
source: Align Delta
ru: Выровнять дельту

# NumericalDeltaOnF.HedgeDelta.Description
source: Align delta (just to make button on ControlPane)
ru: Выровнять дельту (даёт возможность сделать в интерфейсе кнопку)

# NumericalDeltaOnF3.Delta.Name
source: Delta
ru: Дельта

# NumericalDeltaOnF3.Delta.Description
source: Current delta (just to show it on ControlPane)
ru: Текущая дельта всей позиции (для отображения в интерфейсе агента)

# NumericalDeltaOnF3.HedgeDelta.Name
source: Align Delta
ru: Выровнять дельту

# NumericalDeltaOnF3.HedgeDelta.Description
source: Align delta (just to make button on ControlPane)
ru: Выровнять дельту (даёт возможность сделать в интерфейсе кнопку)

# NumericalGammaOnF.GreekAlgo.Name
source: Greek Algo
ru: Алгоритм улыбки

# NumericalGammaOnF.GreekAlgo.Description
source: FrozenSmile - smile is frozen; ShiftingSmile - smile shifts horizontally without modification
ru: FrozenSmile -- улыбка заморожена; ShiftingSmile -- улыбка без искажений сдвигается по горизонтали вслед за БА

# NumericalGammaOnF.Gamma.Name
source: Gamma
ru: Гамма

# NumericalGammaOnF.Gamma.Description
source: Current gamma (just to show it on ControlPane)
ru: Текущая гамма всей позиции (для отображения в интерфейсе агента)

# NumericalGammaOnF3.Gamma.Name
source: Gamma
ru: Гамма

# NumericalGammaOnF3.Gamma.Description
source: Current gamma (just to show it on ControlPane)
ru: Текущая гамма всей позиции (для отображения в интерфейсе агента)

# NumericalThetaOnF.TStep.Name
source: Time Step
ru: Шаг времени

# NumericalThetaOnF.TStep.Description
source: Time step for numerical derivative
ru: Шаг варьирования времени при дифференцировании

# NumericalThetaOnF.GreekAlgo.Name
source: Greek Algo
ru: Алгоритм улыбки

# NumericalThetaOnF.GreekAlgo.Description
source: FrozenSmile - smile is frozen; ShiftingSmile - smile shifts horizontally without modification
ru: FrozenSmile -- улыбка заморожена; ShiftingSmile -- улыбка без искажений сдвигается по горизонтали вслед за БА

# NumericalThetaOnF.Theta.Name
source: Theta
ru: Тета

# NumericalThetaOnF.Theta.Description
source: Current theta (just to show it on ControlPane)
ru: Текущая тета всей позиции (для отображения в интерфейсе агента)

# NumericalThetaOnF.DistanceMode.Name
source: Estimation algo
ru: Алгоритм расчета

# NumericalThetaOnF.DistanceMode.Description
source: Algorythm to estimate time-to-expiry
ru: Алгоритм расчета времени до экспирации

# OpenVirtualFutPosition2.FixedPx.Name
source: Price
ru: Цена

# OpenVirtualFutPosition2.FixedPx.Description
source: Entry price of this virtual position
ru: Цена открытия этой виртуальной позиции

# OpenVirtualFutPosition2.FixedQty.Name
source: Size
ru: Кол-во

# OpenVirtualFutPosition2.FixedQty.Description
source: Entry size of this virtual position
ru: Объём открытия этой виртуальной позиции

# OpenVirtualOptPosition2.FixedStrike.Name
source: Strike
ru: Страйк

# OpenVirtualOptPosition2.FixedStrike.Description
source: Strike of this virtual position
ru: Страйк виртуальной позиции

# OpenVirtualOptPosition2.OptionType.Name
source: Option Type
ru: Вид опционов

# OpenVirtualOptPosition2.OptionType.Description
source: Option type (parameter Any is not recommended)
ru: Тип опционов (использование типа Any может привести к неожиданному поведению)

# OpenVirtualOptPosition2.FixedPx.Name
source: Price
ru: Цена

# OpenVirtualOptPosition2.FixedPx.Description
source: Entry price of this virtual position
ru: Цена открытия этой виртуальной позиции

# OpenVirtualOptPosition2.FixedQty.Name
source: Size
ru: Кол-во

# OpenVirtualOptPosition2.FixedQty.Description
source: Entry size of this virtual position
ru: Объём открытия этой виртуальной позиции

# SingleSeriesNumericalDelta.GreekAlgo.Name
source: Greek Algo
ru: Алгоритм улыбки

# SingleSeriesNumericalDelta.GreekAlgo.Description
source: FrozenSmile - smile is frozen; ShiftingSmile - smile shifts horizontally without modification
ru: FrozenSmile -- улыбка заморожена; ShiftingSmile -- улыбка без искажений сдвигается по горизонтали вслед за БА

# SmileImitation5.SetSlopeByHands.Name
source: Set Skew Manually
ru: Наклон принудительно

# SmileImitation5.SetSlopeByHands.Description
source: Set skew manually
ru: Уровень наклона задаётся принудительно

# SmileImitation5.SlopePct.Name
source: Skew, %
ru: Наклон, %

# SmileImitation5.SlopePct.Description
source: Skew (percents)
ru: Наклон (в процентах)

# TotalRiskN2.RepeatLastValue.Name
source: Repeat Last Value
ru: Повтор значения

# TotalRiskN2.RepeatLastValue.Description
source: Handler should repeat last known value to avoid further logic errors
ru: При true будет находить и использовать последнее известное значение

# VerticalLine2.SigmaLowPct.Name
source: Sigma low, %
ru: Нижний уровень, %

# VerticalLine2.SigmaLowPct.Description
source: Low level of this marker (in percents)
ru: Нижний уровень маркера (в процентах)

# VerticalLine2.SigmaHighPct.Name
source: Sigma high, %
ru: Верхний уровень, %

# VerticalLine2.SigmaHighPct.Description
source: High level of this marker (in percents)
ru: Верхний уровень маркера (в процентах)

# VerticalLine2.Qty.Name
source: Size
ru: Кол-во

# VerticalLine2.Qty.Description
source: Trade quantity. Negative value reverts the signal.
ru: Торговый объём. Отрицательное значение приведет к перевороту сигнала.

# FixedCommission.Name
source: Fixed Commission
ru: Фиксированная комиссия

# FixedCommission.Description
source: Fixed commission (it can apply 'scalper discount' available in MOEX)
ru: Фиксированная комиссия (с возможностью учесть скальперскую скидку на МБ)

# FixedCommission.ScalpingRule.Name
source: Scalping Discount
ru: Скальперская скидка

# FixedCommission.ScalpingRule.Description
source: Apply 'scalper discount' available in MOEX
ru: Учет в расчетах скальперской скидки, доступной на ФОРТС

# FixedCommission.FutCommission.Name
source: Futures commission
ru: Комиссия по фьючерсам

# FixedCommission.FutCommission.Description
source: Futures commission
ru: Комиссия по фьючерсам

# FixedCommission.OptCommission.Name
source: Option commission
ru: Комиссия по опционам

# FixedCommission.OptCommission.Description
source: Option commission
ru: Комиссия по опционам

# TimeToExpiry.ExpiryTime.Name
source: Expiry time
ru: Время экспирации

# TimeToExpiry.ExpiryTime.Description
source: Expiration time (including time of a day) for algorythms EXCEPT FixedExpiry
ru: Дата экспирации (включая время суток) для режима КРОМЕ FixedExpiry

# BlackScholesDelta.TooltipFormat.Name
source: Tooltip format
ru: Формат подсказки

# BlackScholesDelta.TooltipFormat.Description
source: Tooltip format (i.e. '0.00', '0.0##' etc)
ru: Формат числа для тултипа. Например, '0.00', '0.0##' и т.п.

# BlackScholesGreeks.Greek.Name
source: Greek
ru: Грек

# BlackScholesGreeks.Greek.Description
source: Greek to be calculated (delta, theta, vega, gamma, etc)
ru: Тип грека для расчетов (дельта, тета, вега, гамма и т.д.)

# BlackScholesGreeks.TooltipFormat.Name
source: Tooltip Format
ru: Формат подсказки

# BlackScholesGreeks.TooltipFormat.Description
source: Tooltip format (i.e. '0.00', '0.0##' etc)
ru: Формат числа для тултипа. Например, '0.00', '0.0##' и т.п.

# BuyOptions.OptionType.Name
source: Option type
ru: Тип опциона

# BuyOptions.OptionType.Description
source: Limit trading to options of given type (call, put, both)
ru: Ограничение на тип торгуемого инструмента (колл, пут, котируются одновременно оба)

# BuyOptions.FixedQty.Name
source: Order size
ru: Объём заявки

# BuyOptions.FixedQty.Description
source: Order size
ru: Объём заявки

# BuyOptionGroup.OptionType.Name
source: Option type
ru: Тип опциона
