Repository: TSLab-Dev/Handlers
Catalog: Properties/Resources.*.resx
Languages: ru

# BuyOptionGroup.OptionType.Description
source: Limit trading to options of given type (call, put, both)
ru: Ограничение на тип торгуемого инструмента (колл, пут, котируются одновременно оба)

# BuyOptionGroup.FixedQty.Name
source: Order size
ru: Объём заявки

# BuyOptionGroup.FixedQty.Description
source: Order size
ru: Объём заявки

# BuyOptionGroup.EntryShift.Name
source: Entry shift
ru: Сдвиг входа

# BuyOptionGroup.EntryShift.Description
source: Entry shift to get lower buy price (price step)
ru: Сдвиг входа для уменьшения цены покупки (шаг цены)

# BuyOptionGroup.ExitShift.Name
source: Exit shift
ru: Сдвиг выхода

# BuyOptionGroup.ExitShift.Description
source: Exit shift to get quick execution (price step)
ru: Сдвиг выхода для быстрого закрытия позиции (шаг цены)

# BuyOptionGroup.StrikeStep.Name
source: Strike step
ru: Шаг страйков

# BuyOptionGroup.StrikeStep.Description
source: Strike step to extract the most important options
ru: Шаг страйков для выделения главных подсерий

# BuyOptionGroup.StrikeAmount.Name
source: Strike amount
ru: Количество страйков

# BuyOptionGroup.StrikeAmount.Description
source: Strike amount to set your orders (up and down from the central strike)
ru: Количество страйков для котирования (в обе стороны от центрального страйка)

# BuyOptionGroupDelta.FixedQty.Name
source: Order size
ru: Объём заявки

# BuyOptionGroupDelta.FixedQty.Description
source: Order size
ru: Объём заявки

# BuyOptionGroupDelta.EntryShift.Name
source: Entry shift
ru: Сдвиг входа

# BuyOptionGroupDelta.EntryShift.Description
source: Entry shift to get lower buy price (price step)
ru: Сдвиг входа для уменьшения цены покупки (шаг цены)

# BuyOptionGroupDelta.ExitShift.Name
source: Exit shift
ru: Сдвиг выхода

# BuyOptionGroupDelta.ExitShift.Description
source: Exit shift to get quick execution (price step)
ru: Сдвиг выхода для быстрого закрытия позиции (шаг цены)

# BuyOptionGroupDelta.StrikeStep.Name
source: Strike step
ru: Шаг страйков

# BuyOptionGroupDelta.StrikeStep.Description
source: Strike step to extract the most important options
ru: Шаг страйков для выделения главных подсерий

# BuyOptionGroupDelta.MinDeltaPct.Name
source: Min delta, %
ru: Мин. дельта, %

# BuyOptionGroupDelta.MinDeltaPct.Description
source: The lowest working delta we allow to quote (as percents)
ru: Минимальная рабочая дельта, которую мы согласны котировать (в процентах)

# BuyOptionGroupDelta.MaxDeltaPct.Name
source: Max delta, %
ru: Макс. дельта, %

# BuyOptionGroupDelta.MaxDeltaPct.Description
source: The highest working delta we allow to quote (as percents)
ru: Максимальная рабочая дельта, которую мы согласны котировать (в процентах)

# BuyOptionGroupDelta.CheckAbsDelta.Name
source: Check absolute delta
ru: Проверять модуль дельты

# BuyOptionGroupDelta.CheckAbsDelta.Description
source: Check absolute value of option's delta
ru: Флаг того, что дельту опционов следует проверять по модулю (без учета знака)

# MarketMakerDelta.FixedQty.Name
source: Order size
ru: Объём заявки

# MarketMakerDelta.FixedQty.Description
source: Order size
ru: Объём заявки

# MarketMakerDelta.EntryShift.Name
source: Shift, p.s.
ru: Сдвиг, ш.ц.

# MarketMakerDelta.EntryShift.Description
source: Shift to get better buy or sell price (price steps)
ru: Сдвиг цены для получения лучшей цены покупки или продажи (в шагах цены)

# MarketMakerDelta.EntryShiftIvPct.Name
source: Shift, %
ru: Сдвиг, %

# MarketMakerDelta.EntryShiftIvPct.Description
source: Shift to get better buy or sell price (percents of volatility)
ru: Сдвиг цены для получения лучшей цены покупки или продажи (в процентах волатильности)

# MarketMakerDelta.StrikeStep.Name
source: Strike step
ru: Шаг страйков

# MarketMakerDelta.StrikeStep.Description
source: Strike step to extract the most important options
ru: Шаг страйков для выделения главных подсерий

# MarketMakerDelta.MinDeltaPct.Name
source: Min delta, %
ru: Мин. дельта, %

# MarketMakerDelta.MinDeltaPct.Description
source: The lowest working delta we allow to quote (as percents)
ru: Минимальная рабочая дельта, которую мы согласны котировать (в процентах)

# MarketMakerDelta.MaxDeltaPct.Name
source: Max delta, %
ru: Макс. дельта, %

# MarketMakerDelta.MaxDeltaPct.Description
source: The highest working delta we allow to quote (as percents)
ru: Максимальная рабочая дельта, которую мы согласны котировать (в процентах)

# MarketMakerDelta.CheckAbsDelta.Name
source: Check absolute delta
ru: Проверять модуль дельты

# MarketMakerDelta.CheckAbsDelta.Description
source: Check absolute value of option's delta
ru: Флаг того, что дельту опционов следует проверять по модулю (без учета знака)

# MarketMakerDelta.LiquidProAlgo.Name
source: Force all quotes
ru: Выставлять все котировки

# MarketMakerDelta.LiquidProAlgo.Description
source: Set all quotes at all strikes (this mode is convinient with the Liquid.Pro service)
ru: Флаг того, что котировки надо выставлять СРАЗУ ВСЕ (в расчете на работу с сервисом типа Liquid.Pro)

# MarketMakerDelta.MaxContractsOnStrike.Name
source: Max contracts at strike
ru: Макс. контрактов на страйке

# MarketMakerDelta.MaxContractsOnStrike.Description
source: Maximum amount of contracts at the single strike (absolute value)
ru: Максимальное допустимое количество контрактов на одном страйке (без учета знака)

# ChartTrading.OptionType.Name
source: Option Type
ru: Вид опционов

# ChartTrading.OptionType.Description
source: Option type (when Any, the handler will choose the best quote)
ru: Тип опционов (Any предполагает автоматический выбор лучшей котировки)

# ChartTrading.OptPxMode.Name
source: Quote Type
ru: Тип котировки

# ChartTrading.OptPxMode.Description
source: Quote type (ask or bid)
ru: Тип котировки (аск или бид)

# CloseVirtualPosition.FixedPx.Name
source: Fixed Price
ru: Фиксированная цена

# CloseVirtualPosition.FixedPx.Description
source: Exit price for virtual position
ru: Фиксированная цена закрытия позиции

# CloseVirtualPosition.TimeToLive.Name
source: Time to Live
ru: Время жизни

# CloseVirtualPosition.TimeToLive.Description
source: Position lifetime (in minutes)
ru: Время жизни позиции (в минутах)

# CurrentFutPx.MinHeight.Name
source: Min Height
ru: Минимальный отступ

# CurrentFutPx.MinHeight.Description
source: Minimum height of the marker (absolute units)
ru: Минимальный вынос маркера относительно опорной кривой в обе стороны (в абсолютных единицах).

# CurrentFutPx.OffsetPct.Name
source: Offset, %
ru: Высота, %

# CurrentFutPx.OffsetPct.Description
source: Height of the marker (percents)
ru: Вынос вертикального маркера относительно опорной кривой в обе стороны (в процентах).

# DropVirtualPositions.DropPositions.Name
source: Drop Positions
ru: Удалить позиции

# DropVirtualPositions.DropPositions.Description
source: Drop virtual positions
ru: Очистить коллекцию виртуальных позиций

# FixedValue.DisplayUnits.Name
source: Display Units
ru: Единицы отображения

# FixedValue.DisplayUnits.Description
source: Display units (hundreds, thousands, as is)
ru: Единицы отображения (сотни, тысячи, как есть)

# IvSmile2.OptPxMode.Name
source: Price Mode
ru: Вид цены

# IvSmile2.OptPxMode.Description
source: Algorythm to get option price
ru: Алгоритм расчета цены опциона

# IvSmile2.OptionType.Name
source: Option Type
ru: Тип опциона

# IvSmile2.OptionType.Description
source: Option type to be used by handler (call, put, best volatility)
ru: Тип опционов для расчетов (колл, пут, лучшая волатильность)

# IvSmile2.ShiftBid.Name
source: Shift Bid
ru: Сдвиг бидов

# IvSmile2.ShiftBid.Description
source: Shift Bids down (price steps)
ru: Сдвиг котировок Bid на заданное количество шагов цены вниз

# IvSmile2.ShiftAsk.Name
source: Shift Ask
ru: Сдвиг асков

# IvSmile2.ShiftAsk.Description
source: Shift Asks up (price steps)
ru: Сдвиг котировок Ask на заданное количество шагов цены вверх

# IvSmile2.MaxSigmaPct.Name
source: Max Sigma, %
ru: Максимальная волатильность, %

# IvSmile2.MaxSigmaPct.Description
source: Maximum volatility (percents)
ru: Максимальное допустимое значение волатильности

# LinearTransform.Add.Name
source: Summand
ru: Слагаемое

# LinearTransform.Add.Description
source: Summand
ru: Слагаемое

# LinearTransform.Mult.Name
source: Multiplier
ru: Множитель

# LinearTransform.Mult.Description
source: Multiplier
ru: Множитель

# PositionsManager.UseVirtualPositions.Name
source: Virtual Positions
ru: Виртуальные позиции

# PositionsManager.UseVirtualPositions.Description
source: When true it will create only virtual positions without sending orders in market
ru: При true будет создавать виртуальные позиции без выставления заявок в рынок

# PositionsManager.ImportRealPos.Name
source: Import Real Pos
ru: Импорт позиций

# PositionsManager.ImportRealPos.Description
source: Button to import real positions
ru: Кнопка импорта реальных позиций

# SetViewport.ManageX.Name
source: Manage X
ru: Ось X

# SetViewport.ManageX.Description
source: Manage horizontal axis
ru: При true будет управлять горизонтальной осью

# SetViewport.ManageY.Name
source: Manage Y
ru: Ось Y

# SetViewport.ManageY.Description
source: Manage vertical axis
ru: При true будет управлять вертикальной осью

# SetViewport.VerticalMultiplier.Name
source: Height Multiplier
ru: Множитель высоты

# SetViewport.VerticalMultiplier.Description
source: Multiplier to estimate viewport height
ru: Множитель для подстраивания вертикального диапазона

# SetViewport.ApplyVisualSettings.Name
source: Apply settings
ru: Применить настройки

# SetViewport.ApplyVisualSettings.Description
source: Apply visual settings
ru: Принудительное применение визуальных настроек

# SetViewport.ManageChildX.Name
source: Manage child X
ru: Настраивать вторую ось X

# SetViewport.ManageChildX.Description
source: Manage horizontal axis of secondary panes
ru: При true будет управлять горизонтальной осью дочерних панелей

# SingleSeriesNumericalDelta.TooltipFormat.Name
source: Tooltip Format
ru: Формат подсказки

# SingleSeriesNumericalDelta.TooltipFormat.Description
source: Tooltip format (i.e. '0.00', '0.0##' etc)
ru: Формат числа для тултипа. Например, '0.00', '0.0##' и т.п.

# SingleSeriesNumericalDelta3.TooltipFormat.Name
source: Tooltip Format
ru: Формат подсказки

# SingleSeriesNumericalDelta3.TooltipFormat.Description
source: Tooltip format (i.e. '0.00', '0.0##' etc)
ru: Формат числа для тултипа. Например, '0.00', '0.0##' и т.п.

# SingleSeriesNumericalGamma.GreekAlgo.Name
source: Greek Algo
ru: Алгоритм улыбки

# SingleSeriesNumericalGamma.GreekAlgo.Description
source: FrozenSmile - smile is frozen; ShiftingSmile - smile shifts horizontally without modification
ru: FrozenSmile -- улыбка заморожена; ShiftingSmile -- улыбка без искажений сдвигается по горизонтали вслед за БА

# SingleSeriesNumericalGamma.TooltipFormat.Name
source: Tooltip Format
ru: Формат подсказки

# SingleSeriesNumericalGamma.TooltipFormat.Description
source: Tooltip format (i.e. '0.00', '0.0##' etc)
ru: Формат числа для тултипа. Например, '0.00', '0.0##' и т.п.

# SingleSeriesNumericalGamma3.TooltipFormat.Name
source: Tooltip Format
ru: Формат подсказки

# SingleSeriesNumericalGamma3.TooltipFormat.Description
source: Tooltip format (i.e. '0.00', '0.0##' etc)
ru: Формат числа для тултипа. Например, '0.00', '0.0##' и т.п.

# SingleSeriesNumericalTheta.GreekAlgo.Name
source: Greek Algo
ru: Алгоритм улыбки

# SingleSeriesNumericalTheta.GreekAlgo.Description
source: FrozenSmile - smile is frozen; ShiftingSmile - smile shifts horizontally without modification
ru: FrozenSmile -- улыбка заморожена; ShiftingSmile -- улыбка без искажений сдвигается по горизонтали вслед за БА

# SingleSeriesNumericalTheta.TStep.Name
source: Time Step
ru: Шаг времени

# SingleSeriesNumericalTheta.TStep.Description
source: Time step for numerical derivative
ru: Шаг варьирования времени при дифференцировании

# SingleSeriesNumericalTheta.DistanceMode.Name
source: Estimation algo
ru: Алгоритм расчета

# SingleSeriesNumericalTheta.DistanceMode.Description
source: Algorythm to estimate time-to-expiry
ru: Алгоритм расчета времени до экспирации

# SingleSeriesNumericalTheta.TooltipFormat.Name
source: Tooltip Format
ru: Формат подсказки

# SingleSeriesNumericalTheta.TooltipFormat.Description
source: Tooltip format (i.e. '0.00', '0.0##' etc)
ru: Формат числа для тултипа. Например, '0.00', '0.0##' и т.п.

# SingleSeriesNumericalVega.GreekAlgo.Name
source: Greek Algo
ru: Алгоритм улыбки

# SingleSeriesNumericalVega.GreekAlgo.Description
source: FrozenSmile - smile is frozen; ShiftingSmile - smile shifts horizontally without modification
ru: FrozenSmile -- улыбка заморожена; ShiftingSmile -- улыбка без искажений сдвигается по горизонтали вслед за БА

# SingleSeriesNumericalVega.SigmaStep.Name
source: Sigma Step
ru: Шаг сигмы

# SingleSeriesNumericalVega.SigmaStep.Description
source: Sigma step for numerical derivative
ru: Шаг варьирования сигмы при дифференцировании

# SingleSeriesNumericalVega.TooltipFormat.Name
source: Tooltip Format
ru: Формат подсказки

# SingleSeriesNumericalVega.TooltipFormat.Description
source: Tooltip format (i.e. '0.00', '0.0##' etc)
ru: Формат числа для тултипа. Например, '0.00', '0.0##' и т.п.

# SingleSeriesPositionGrid.OptionType.Name
source: Option Type
ru: Тип опциона

# SingleSeriesPositionGrid.OptionType.Description
source: Option type to be used by handler (call, put, sum of both)
ru: Тип опционов для расчетов (колл, пут, сумма)

# SingleSeriesPositionGrid.CountFutures.Name
source: Count Futures
ru: Учитывать БА

# SingleSeriesPositionGrid.CountFutures.Description
source: Count base asset
ru: Подсчитывать ли количество БА?

# SingleSeriesPositionGrid.TooltipFormat.Name
source: Tooltip Format
ru: Формат подсказки

# SingleSeriesPositionGrid.TooltipFormat.Description
source: Tooltip format (i.e. '0.00', '0.0##' etc)
ru: Формат числа для тултипа. Например, '0.00', '0.0##' и т.п.

# SingleSeriesPositionList.CountFutures.Name
source: Count Futures
ru: Учитывать БА

# SingleSeriesPositionList.CountFutures.Description
source: Count base asset
ru: Подсчитывать ли количество БА?

# SingleSeriesPositionList.TooltipFormat.Name
source: Tooltip Format
ru: Формат подсказки

# SingleSeriesPositionList.TooltipFormat.Description
source: Tooltip format (i.e. '0.00', '0.0##' etc)
ru: Формат числа для тултипа. Например, '0.00', '0.0##' и т.п.

# TotalQty.OpenQty.Name
source: Open Qty
ru: Открытый объём

# TotalQty.OpenQty.Description
source: Total open quantity
ru: Суммарный объём в инструменте

# TotalRiskN2.DisplayUnits.Name
source: Display Units
ru: Единицы отображения

# TotalRiskN2.DisplayUnits.Description
source: Display units (hundreds, thousands, as is)
ru: Единицы отображения (сотни, тысячи, как есть)

# TotalRiskN2.DisplayRisk.Name
source: Risk
ru: Риск

# TotalRiskN2.DisplayRisk.Description
source: Risk (just to display at UI)
ru: Риск (только для отображения на UI)

# TransformSmile.Transformation.Name
source: Transformation
ru: Преобразование

# TransformSmile.Transformation.Description
source: Algorythm to transform smile (LogSimmetrise, Simmetrise, None)
ru: Вид преобразования улыбки (LogSimmetrise, Simmetrise, None)

# TransformSmile.OptPxMode.Name
source: Price Mode
ru: Вид цены

# TransformSmile.OptPxMode.Description
source: Algorythm to get option price
ru: Алгоритм расчета цены опциона

# EditTemplateSmile.NumberOfNodes.Name
source: Number of Nodes
ru: Кол-во узлов

# EditTemplateSmile.NumberOfNodes.Description
source: Number of nodes to edit
ru: Количество редактируемых точек

# EditTemplateSmile.NodeStep.Name
source: Node Step
ru: Шаг узлов

# EditTemplateSmile.NodeStep.Description
source: Node step
ru: Шаг узлов интерполяции

# EditTemplateSmile.ShapePct.Name
source: Shape
ru: Форма

# EditTemplateSmile.ShapePct.Description
source: Shape
ru: Параметр формы

# EditTemplateSmile.ResetSmile.Name
source: Reset
ru: Сброс

# EditTemplateSmile.ResetSmile.Description
source: Button to reset smile to initial state
ru: Разложить улыбку по симметризованному шаблону

# EditTemplateSmile.LoadSplineCoeffs.Name
source: Load spline
ru: Загрузить сплайн

# EditTemplateSmile.LoadSplineCoeffs.Description
source: Load spline coefficients from Global Cache
ru: Загрузить коэффициенты сплайна из глобального кеша

# EditTemplateSmile.PasteGlobal.Name
source: Paste
ru: Из буфера

# EditTemplateSmile.PasteGlobal.Description
source: Get spline from clipboard
ru: Получить настройки сплайна из клипборда

# EditTemplateSmile.PrepareSplineCoeffs.Name
source: Prepare Spline
ru: Из буфера

# EditTemplateSmile.PrepareSplineCoeffs.Description
source: Prepare spline coefficients
ru: Подготовить коэффициенты сплайна

# EditTemplateSmile.FrozenSmileID.Name
source: Frozen Smile ID
ru: Локальный ключ

# EditTemplateSmile.FrozenSmileID.Description
source: Smile ID to be used with Local Cache
ru: Ключ улыбки в локальном кеше

# EditTemplateSmile.GlobalSmileID.Name
source: Global Smile ID
ru: Глобальный ключ

# EditTemplateSmile.GlobalSmileID.Description
source: Smile ID to be used with Global Cache
ru: Ключ улыбки в глобальном кеше

# FixedValue.MinValue.Name
source: Minimum
ru: Минимум

# FixedValue.MinValue.Description
source: Minimum for internal representation
ru: Нижняя допустимая граница на ВНУТРЕННЕЕ представление величины

# FixedValue.Value.Name
source: Value
ru: Значение

# FixedValue.Value.Description
source: Constant value (always above the limit 'Minimum')
ru: Фиксированная величина (не меньше ограничения 'Минимум')

# SingleSeriesPositionList.DisplayMode.Name
source: Display Property
ru: Что показывать

# SingleSeriesPositionList.DisplayMode.Description
source: Position property to be displayed
ru: Какое свойство позиции надо показать?

# SingleSeriesPositionList.MaxPositions.Name
source: Max Positions
ru: Кол-во позиций

# SingleSeriesPositionList.MaxPositions.Description
source: Limit number of positions to show
ru: Максимальное отображаемое число позиций

# SmileImitation3.SetIvByHands.Name
source: Set IV
ru: Задать IV

# SmileImitation3.SetIvByHands.Description
source: Set IV manually
ru: Уровень IV ATM задаётся руками (в %)

# SmileImitation3.SetSlopeByHands.Name
source: Set Skew Manually
ru: Наклон принудительно

# SmileImitation3.SetSlopeByHands.Description
source: Set skew manually
ru: Уровень наклона задаётся принудительно

# SmileImitation3.GenerateTails.Name
source: Generate Tails
ru: Формировать края

# SmileImitation3.GenerateTails.Description
source: Generate invisible tails
ru: Генерировать невидимые края

# SmileImitation3.IsVisiblePoints.Name
source: Show nodes
ru: Показывать узлы

# SmileImitation3.IsVisiblePoints.Description
source: Show nodes
ru: Показывать точки на кривой

# SmileImitation3.IvAtmPct.Description
source: IV ATM (percents)
ru: Волатильность на-деньгах (в процентах)

# SmileImitation3.ShiftPct.Name
source: Shift, %
ru: Сдвиг, %

# SmileImitation3.ShiftPct.Description
source: Shift (percents)
ru: Сдвиг (в процентах)

# SmileImitation3.DepthPct.Name
source: Depth, %
ru: Глубина, %

# SmileImitation3.DepthPct.Description
source: Depth (percents)
ru: Глубина (в процентах)

# SmileImitation3.SlopeAtmPct.Name
source: Skew, %
ru: Наклон, %

# SmileImitation3.SlopeAtmPct.Description
source: Skew (percents)
ru: Наклон (в процентах)

# SmileImitation5.SetIvByHands.Name
source: Set IV
ru: Задать IV

# SmileImitation5.SetIvByHands.Description
source: Set IV manually
ru: Уровень IV ATM задаётся руками (в %)

# SmileImitation5.SetShapeByHands.Name
source: Set Shape Manually
ru: Форма принудительно

# SmileImitation5.SetShapeByHands.Description
source: Set shape manually
ru: Форма задаётся руками

# SmileImitation5.GenerateTails.Name
source: Generate Tails
ru: Формировать края

# SmileImitation5.GenerateTails.Description
source: Generate invisible tails
ru: Генерировать невидимые края

# SmileImitation5.IsVisiblePoints.Name
source: Show nodes
ru: Показывать узлы

# SmileImitation5.IsVisiblePoints.Description
source: Show nodes
ru: Показывать точки на кривой

# SmileImitation5.UseLocalTemplate.Name
source: Use Local Template
ru: Локальный шаблон

# SmileImitation5.UseLocalTemplate.Description
source: Use template from global or from local cache
ru: Использовать шаблон из глобального или из локального кеша

# SmileImitation5.IvAtmPct.Description
source: IV ATM (percents)
ru: Волатильность на-деньгах (в процентах)

# SmileImitation5.ShapePct.Name
source: Shape, %
ru: Форма, %

# SmileImitation5.ShapePct.Description
source: Shape (percents)
ru: Форма (в процентах)

# SmileImitation5.FrozenSmileID.Name
source: Frozen Smile ID
ru: Локальный ключ

# SmileImitation5.FrozenSmileID.Description
source: Smile ID to be used with Local Cache
ru: Ключ улыбки в локальном кеше

# SmileImitation5.GlobalSmileID.Name
source: Global Smile ID
ru: Глобальный ключ

# SmileImitation5.GlobalSmileID.Description
source: Smile ID to be used with Global Cache
ru: Ключ улыбки в глобальном кеше

# SmileImitation5.NoLocalSmile
source: [{0}] There is no LOCAL smile with ID:{1}
ru: [{0}] Нет ЛОКАЛЬНОГО шаблона с идентификатором:{1}

# SmileImitation5.NoGlobalSmile
source: [{0}] There is no global templateInfo with ID:{1}. I'll try to use default one.
ru: [{0}] Нет глобального шаблона с идентификатором:{1}. Использую встроенный.

# SmileImitation5.TemplateWasSaved
source: [{0}] Default templateInfo was saved to Global Cache with ID:{1}
ru: [{0}] Встроенный шаблон сохранен в Глобальный Кеш с идентификатором:{1}

# TransformSmile.ShiftIvPct.Name
source: Shift IV, %
ru: Сдвиг волатильности, %

# TransformSmile.ShiftIvPct.Description
source: Additional vertical smile shift (in percents)
ru: Аддитивный сдвиг на заданное количество ПРОЦЕНТОВ ВОЛАТИЛЬНОСТИ вверх

# TransformSmile.SimmWeight.Name
source: Weight
ru: Вес симметризации

# TransformSmile.SimmWeight.Description
source: Weight (0 -- initial function; 0.5 -- simmetrised; 1 -- mirrored)
ru: Вес симметризации (0 -- исходная функция; 0.5 -- симметричная; 1 -- отраженная)

source: Time
ru: Время

# AbsolutCommission.Name
source: Absolute comission
ru: Абсолютная комиссия

# Add.Name
source: Sum up
ru: Сложить

# AdjShift.Name
source: Adjustment shift
ru: Сдвиг выравнивания

# Adjustment.Name
source: Adjustment
ru: Выравнивание

# Not.Name
source: Not
ru: НЕ

# And.Name
source: And
ru: И

# Or.Name
source: Or
ru: Или

# BarsHeld.Name
source: Bars held
ru: Удерживалось баров

# BOOL.Name
source: Source (boolean)
ru: Источник (логический)

# BooleanExpression.Name
source: Boolean expression
ru: Логическая формула

# BoolValue.Name
source: Source (boolean, not stream)
ru: Источник (логический, не потоковый)

# Close.Name
source: Close
ru: Закрытие

# Coef.Name
source: Factor
ru: Коэф.

# ColorPower.Name
source: Color filling coefficient
ru: Коэф. заливки

# CombineSteps.Name
source: Combine steps
ru: Объединять шагов

# Commission.Name
source: Commission
ru: Комиссия

# CommissionPct.Name
source: Commission %
ru: Комиссия %

# CompressAdvanced.Name
source: Compress (Advanced)
ru: Сжать (Расшир)

# Compress.Name
source: Compress
ru: Сжать

# CompressToSeconds.Name
source: Compress into seconds
ru: Сжать в секунды

# ConstGen.Name
source: Constant
ru: Константа

# CrossOver.Name
source: Cross over
ru: Пересечение сверху

# CrossUnder.Name
source: Cross under
ru: Пересечение снизу

# EqualHandler.Name
source: Equal
ru: Равно

# GreaterHandler.Name
source: Greater
ru: Больше

# LessHandler.Name
source: Less
ru: Меньше

# GreaterOrEqualHandler.Name
source: Greater or equal
ru: Больше или равно

# LessOrEqualHandler.Name
source: Less or equal
ru: Меньше или равно

# CurrentPosition.Name
source: Current position
ru: Текущая позиция

# AgentCurrentPosition.Name
source: Agent current position
ru: Текущая позиция агента

# Cutter.Name
source: Cut off
ru: Обрезать

# Date.Name
source: Date
ru: Дата

# DayOfMonth.Name
source: Day of month
ru: День месяца

# DayOfWeek.Name
source: Day of week
ru: День недели
