Repository: TSLab-Dev/Handlers
Catalog: Properties/Resources.*.resx
Languages: ru

# DaysInPosition.Name
source: Days in position
ru: Дней в позиции

# Decimals.Name
source: Symbols
ru: Знаков

# Decompres.Name
source: Decompress
ru: Разжать

# DecompresBool.Name
source: Decompress boolean
ru: Разжать логическое

# SecDivideWith.Name
source: Divide with
ru: Поделить с

# DOUBLE.Name
source: Source (numbers)
ru: Источник (значения)

# DoubleExpression.Name
source: Formula
ru: Формула

# DoubleValue.Name
source: Source (numbers, not stream)
ru: Источник (значения, не потоковый)

# DrowdownCount.Name
source: Losses running
ru: Убытков подряд

# EntryDate.Name
source: Entry date
ru: Дата входа

# CalcEntryPrice.Name
source: Entry price (estimated)
ru: Цена входа (расчетная)

# EntryPrice.Name
source: Entry price
ru: Цена входа

# EntryTime.Name
source: Entry time
ru: Время входа

# EstimatedMoney.Name
source: Portfolio estimation
ru: Оценка портфеля

# Expression.Name
source: Expression
ru: Выражение

# FastLimit.Name
source: Fast limit
ru: Быстрый лимит

# Flip.Name
source: Flip
ru: Перевернуть

# FreeMoney.Name
source: Free money
ru: Свободные деньги

# Handler.Name
source: Handler
ru: Обработчик

# HasLongPositionActive.Name
source: There is active long position
ru: Есть активная длинная поз.

# HasPositionActive.Name
source: There is active position
ru: Есть активная позиция

# HasShortPositionActive.Name
source: There is active short position
ru: Есть активная короткая поз.

# HasTwoLoss.Name
source: 2 losses successively
ru: 2 убытка подряд

# High.Name
source: High
ru: Максимум

# Highest.Name
source: Highest for
ru: Максимум за

# Hold.Name
source: Hold
ru: Задержать

# INTERACTIVESPLINE.Name
source: Interactive spline
ru: Источник (интерактивный сплайн)

# Interval.Name
source: Interval
ru: Интервал

# IntervalBase.Name
source: Interval base
ru: База интервала

# LastClosedIsLong2.Name
source: Last closed position was long
ru: Посл. закр. поз. была длинной

# LastClosedIsShort2.Name
source: Last closed position was short
ru: Посл. закр. поз. была короткой

# LastClosedNamePositionExitDate.Name
source: Exit date of last closed named position
ru: Дата выхода последней закрытой позиции по имени

# LastClosedNamePositionExitTime.Name
source: Exit time of last closed named position
ru: Время выхода последней закрытой позиции по имени

# LastClosedNamePositionExitPrice.Name
source: Exit price of last closed named position
ru: Цена выхода последней закрытой позиции по имени

# LastClosedPositionDate.Name
source: Date of last closed position
ru: Дата последней закрытой позиции

# LastClosedPositionExitDate.Name
source: Exit date of last closed position
ru: Дата выхода последней закрытой позиции

# LastClosedPositionExitTime.Name
source: Exit time of last closed position
ru: Время выхода последней закрытой позиции

# LastClosedPositionTime.Name
source: Time of last closed position
ru: Время последней закрытой позиции

# PosActiveNameExit.Name
source: Last exit has such name
ru: Последний выход имеет такое имя

# LastExitPrice.Name
source: Last exit price
ru: Цена последнего выхода

# LastClosedIsLong.Name
source: Last position has been closed and it was long
ru: Посл. поз. закрыта и длинная

# LastClosedIsShort.Name
source: Last position has been closed and it was short
ru: Посл. поз. закрыта и короткая

# Long.Name
source: Buy
ru: Покупка

# Low.Name
source: Low
ru: Минимум

# Lowest.Name
source: Lowest for
ru: Минимум за

# MarginPct.Name
source: Money value%
ru: Стоимость денег %

# Max.Name
source: Max
ru: Наибольшее

# Method.Name
source: Method
ru: Метод

# Min.Name
source: Min
ru: Наименьшее

# MinimalCommission.Name
source: Minimum comission
ru: Минимум комиссии

# MinutesInPosition.Name
source: Minutes in position
ru: Минут в позиции

# SecMultiply.Name
source: Multiply (CB) by
ru: Умножить (ЦБ) на

# Multiply.Name
source: Multiply by
ru: Умножить на

# SecMultiplyWith.Name
source: Multiply by
ru: Перемножить с

# NotClear.Name
source: Do not clear
ru: Не очищать

# NotTradableOption.Name
source: Not tradable source (Option)
ru: Неторгуемый источник (опцион)

# NotTradableSecurity.Name
source: Not tradable source (instrument)
ru: Неторгуемый источник (инструмент)

# NumDaysProfit.Name
source: Profit (in N days)
ru: Доход (за N дней)

# NumMinutesProfit.Name
source: Profit (in N minutes)
ru: Доход (за N минут)

# NumPositionsProfit.Name
source: Profit (in N positions)
ru: Доход (за N позиций)

# Open.Name
source: Open
ru: Открытие

# Period.Name
source: Period
ru: Период

# Period1.Name
source: Period1
ru: Период1

# Period2.Name
source: Period2
ru: Период2

# ProfitPct.Name
source: Profit %
ru: Доход %

# Profit.Name
source: Profit
ru: Доход

# Relative.Name
source: Relative
ru: Относительный

# RelativeForPeriod.Name
source: Relative for period
ru: Относительный за период

# RelativeCommission.Name
source: Relative comission
ru: Относительная комиссия

# RelativeCommisionWithMinimal.Name
source: Relative comission with minimum
ru: Относ. комиссия с минимумом

# PositionSharesByBar.Name
source: Quantity
ru: Количество

# PositionShares.Name
source: Position size (initial)
ru: Размер позиции (начальный)

# Shift.Name
source: Shift
ru: Сдвиг

# Slippage.Name
source: Slippage
ru: Проскальзывание

# SlowLimit.Name
source: Slow limit
ru: Медленный лимит

# StartFrom.Name
source: Initial
ru: Начальное

# StartIndex.Name
source: Begin with
ru: Начинать с

# StepPrice.Name
source: Step price
ru: Стоимость шага цены

# StopLoss.Name
source: Stop loss
ru: Стоп лосс

# Sub.Name1
source: Subtract
ru: Вычесть

# SummFor.Name
source: Sum in
ru: Сумма за

# SumForTimeFrameHandler.Name
source: Sum for time frame
ru: Сумма за таймфрейм

# Time.Name
source: Time
ru: Время

# TimeInMins.Name
source: Time in minutes
ru: Время в минутах

# TradableOption.Name
source: Tradable source (Option)
ru: Торгуемый источник (опцион)

# TradableSecurity.Name
source: Tradable source (instrument)
ru: Торгуемый источник (инструмент)

# TrailEnable.Name
source: Enable the trail
ru: Вкл. трейл

# TrailLoss.Name
source: Trail loss
ru: Трейл лосс

# TrailStop.Name
source: Trail stop
ru: Трейл Стоп

# TrailStopAbs.Name
source: Trail stop absolute
ru: Трейл Стоп Абс.

# Unknown.Name
source: Unknow
ru: Неизвестно

# Updater.Name
source: Updatable value
ru: Обновляемое значение

# UseCalcPrice.Name
source: Use estimated price
ru: Исп. расч. цену

# Value.Name
source: Value
ru: Значение

# Volume.Name
source: Volume
ru: Объем

# WholeDayProfit.Name
source: Profit (one day period)
ru: Доход (за день)

# WholeTimeProfit.Name
source: Profit (whole period)
ru: Доход (за все время)

# PositionsManager.AgregatePositions.Name
source: Agregate positions
ru: Агрегировать позиции

# PositionsManager.AgregatePositions.Description
source: When true it will agregate positions of similar directions in one
ru: При true будет агрегировать позиции одинакового направления в одну общую

# TimeToExpiry2.Name
source: Time to expiry
ru: Время до экспирации

# TimeToExpiry2.Description
source: Time to expiry in year fractions. Various algorithms are applied (fixed time, plain calendar time, plain calendar time including days off and so on).
ru: Время до экспирации в долях года. Заложены различные алгоритмы (фиксированное время, плоское календарное время, плоское календарное время с учетом выходных, и т.п.).

# TimeToExpiry2.CurDateMode.Name
source: Current date algo
ru: Алгоритм поиска 'сейчас'

# TimeToExpiry2.CurDateMode.Description
source: Current date algorythm
ru: Алгоритм поиска 'сейчас'

# TimeToExpiry2.ExpirationMode.Name
source: Expiration algo
ru: Алгоритм экспирации

# TimeToExpiry2.ExpirationMode.Description
source: Algorythm to determine expiration date
ru: Алгоритм определения даты экспирации

# TimeToExpiry2.DistanceMode.Name
source: Estimation algo
ru: Алгоритм расчета

# TimeToExpiry2.DistanceMode.Description
source: Algorythm to estimate time-to-expiry
ru: Алгоритм расчета времени до экспирации

# TimeToExpiry2.Expiry.Name
source: Expiry
ru: Экспирация

# TimeToExpiry2.Expiry.Description
source: Expiration datetime (including time of a day) for algorythm FixedExpiry
ru: Дата экспирации (включая время суток) для режима FixedExpiry

# TimeToExpiry2.ExpiryTime.Name
source: Expiry time
ru: Время экспирации

# TimeToExpiry2.ExpiryTime.Description
source: Expiration time (including time of a day) for algorythms except FixedExpiry
ru: Дата экспирации (включая время суток) для режима кроме FixedExpiry

# TimeToExpiry2.FixedDate.Name
source: Frozen 'today'
ru: 'Сегодня'

# TimeToExpiry2.FixedDate.Description
source: Today datetime (including time of a day) for algorythm FixedDate
ru: Фиксированная дата (включая время суток). Используется в режиме FixedDate

# TimeToExpiry2.UseDays.Name
source: Use days
ru: В днях

# TimeToExpiry2.UseDays.Description
source: When true, handler calculates time to expiry as days
ru: При true будет считать дни, а не доли года

# TimeToExpiry2.SeriesIndex.Name
source: Series index
ru: Номер серии

# TimeToExpiry2.SeriesIndex.Description
source: Series index (only alive series) for algorythm ExpiryByNumber
ru: Индекс серии (учитываются только живые). Используется в режиме ExpiryByNumber.

# TimeToExpiry2.Time.Name
source: Time
ru: Время

# TimeToExpiry2.Time.Description
source: Time to expiry (just to show it on ControlPane)
ru: Время до экспирации (только для отображения на UI)

# TimeToExpiry2.CurrentDateShift.Name
source: Current date shift
ru: Сдвиг текущей даты

# TimeToExpiry2.CurrentDateShift.Description
source: Shift current date by calendar time interval
ru: Сдвинуть текущую дату на указанный интервал календарного времени

# CombinePricesCount.Name
source: Combine prices
ru: Объеденять цены

# TimeFrame.Name
source: Time frame
ru: Таймфрейм

# TimeFrameUnit.Name
source: Time frame unit
ru: Ед. изм. таймфрейма

# TimeFrameShift.Name
source: Time frame shift
ru: Сдвиг таймфрейма

# TimeFrameShiftUnit.Name
source: Time frame shift unit
ru: Ед. изм. сдвига таймфрейма

# CentralStrike.ShiftStrike.Name
source: Shift strike
ru: Сдвиг страйка

# CentralStrike.ShiftStrike.Description
source: Shift central strike (number of strikes)
ru: Искуственный сдвиг центрального страйка (в штуках страйков)

# IvOnFAllSeries.RescaleTime.Name
source: Rescale Time
ru: Заменить время

# IvOnFAllSeries.RescaleTime.Description
source: Rescale time-to-expiry to our internal?
ru: Заменять время на 'правильное'?

# IvOnFAllSeries.DistanceMode.Name
source: Estimation Algo
ru: Алгоритм расчета

# IvOnFAllSeries.DistanceMode.Description
source: Algorythm to estimate time-to-expiry
ru: Алгоритм расчета времени до экспирации

# IvOnFAllSeries.ExpiryTime.Name
source: Expiry Time
ru: Время истечения

# IvOnFAllSeries.ExpiryTime.Description
source: Exact expiration time of day (HH:mm)
ru: Точное время экспирации (ЧЧ:мм)

# SingleSeriesNumericalDelta.SigmaMult.Name
source: Width multiplier
ru: Множитель ширины

# SingleSeriesNumericalDelta.SigmaMult.Description
source: Width multiplier
ru: Множитель ширины

# SingleSeriesNumericalDelta3.SigmaMult.Name
source: Width multiplier
ru: Множитель ширины

# SingleSeriesNumericalDelta3.SigmaMult.Description
source: Width multiplier
ru: Множитель ширины

# SingleSeriesNumericalGamma.SigmaMult.Name
source: Width multiplier
ru: Множитель ширины

# SingleSeriesNumericalGamma.SigmaMult.Description
source: Width multiplier
ru: Множитель ширины

# SingleSeriesNumericalGamma3.SigmaMult.Name
source: Width multiplier
ru: Множитель ширины

# SingleSeriesNumericalGamma3.SigmaMult.Description
source: Width multiplier
ru: Множитель ширины

# SingleSeriesNumericalTheta.SigmaMult.Name
source: Width multiplier
ru: Множитель ширины

# SingleSeriesNumericalTheta.SigmaMult.Description
source: Width multiplier
ru: Множитель ширины

# SingleSeriesNumericalVega.SigmaMult.Name
source: Width multiplier
ru: Множитель ширины

# SingleSeriesNumericalVega.SigmaMult.Description
source: Width multiplier
ru: Множитель ширины

# SingleSeriesPositionCommissions.Name
source: Single Series Position Commission
ru: Комиссия позиции (одна серия)

# SingleSeriesPositionCommissions.Description
source: Grid of entire option position commissions
ru: Таблица комиссий набранной позиции для одиночной опционной серии

# SingleSeriesPositionCommissions.LongPositions.Name
source: Long positions
ru: Длинные позиции

# SingleSeriesPositionCommissions.LongPositions.Description
source: Prices of long positions
ru: Цены длинных позиций

# SingleSeriesPositionCommissions.OptionType.Name
source: Option Type
ru: Тип опциона

# SingleSeriesPositionCommissions.OptionType.Description
source: Option type to be used by handler (call, put, sum of both)
ru: Тип опционов для расчетов (колл, пут, сумма)

# SingleSeriesPositionCommissions.CountFutures.Name
source: Count Futures
ru: Учитывать БА

# SingleSeriesPositionCommissions.CountFutures.Description
source: Count base asset
ru: Подсчитывать ли количество БА?

# SingleSeriesPositionCommissions.TooltipFormat.Name
source: Tooltip Format
ru: Формат подсказки

# SingleSeriesPositionCommissions.TooltipFormat.Description
source: Tooltip format (i.e. '0.00', '0.0##' etc)
ru: Формат числа для тултипа. Например, '0.00', '0.0##' и т.п.

# SingleSeriesPositionCommissions.SigmaMult.Name
source: Width multiplier
ru: Множитель ширины

# SingleSeriesPositionCommissions.SigmaMult.Description
source: Width multiplier
ru: Множитель ширины

# SingleSeriesPositionCommissions.ShowNodes.Name
source: Show nodes
ru: Показывать узлы

# SingleSeriesPositionCommissions.ShowNodes.Description
source: Nodes are shown when true
ru: При true будет показывать узлы на отображаемой линии

# SingleSeriesPositionPrices.Name
source: Single Series Position Prices
ru: Средние цены позиции (одна серия)

# SingleSeriesPositionPrices.Description
source: Grid of average position prices (single option series)
ru: Таблица средних цен набранной позиции для одиночной опционной серии

# SingleSeriesPositionPrices.LongPositions.Name
source: Long positions
ru: Длинные позиции

# SingleSeriesPositionPrices.LongPositions.Description
source: Prices of long positions
ru: Цены длинных позиций

# SingleSeriesPositionPrices.OptionType.Name
source: Option Type
ru: Тип опциона

# SingleSeriesPositionPrices.OptionType.Description
source: Option type to be used by handler (call, put, sum of both)
ru: Тип опционов для расчетов (колл, пут, сумма)

# SingleSeriesPositionPrices.CountFutures.Name
source: Count Futures
ru: Учитывать БА

# SingleSeriesPositionPrices.CountFutures.Description
source: Count base asset
ru: Подсчитывать ли количество БА?

# SingleSeriesPositionPrices.TooltipFormat.Name
source: Tooltip Format
ru: Формат подсказки

# SingleSeriesPositionPrices.TooltipFormat.Description
source: Tooltip format (i.e. '0.00', '0.0##' etc)
ru: Формат числа для тултипа. Например, '0.00', '0.0##' и т.п.

# SingleSeriesPositionPrices.SigmaMult.Name
source: Width multiplier
ru: Множитель ширины

# SingleSeriesPositionPrices.SigmaMult.Description
source: Width multiplier
ru: Множитель ширины

# SingleSeriesPositionPrices.ShowNodes.Name
source: Show nodes
ru: Показывать узлы

# SingleSeriesPositionPrices.ShowNodes.Description
source: Nodes are shown when true
ru: При true будет показывать узлы на отображаемой линии

# ContractsCount.Name
source: Contracts count
ru: Количество контрактов

# Kind.Name
source: Kind
ru: Вид

# SetViewport.ManageXGridStep.Name
source: Manage X grid step
ru: Сетка оси X

# SetViewport.ManageXGridStep.Description
source: Manage horizontal axis grid step
ru: При true будет управлять расстоянием между вертикальными линиями грида

# SetViewport.XAxisStep.Name
source: X axis step
ru: Шаг сетки оси X

# SetViewport.XAxisStep.Description
source: X axis grid step
ru: Шаг линий сетки вдоль оси X

# SetViewport.XAxisDivisor.Name
source: X axis divisor
ru: Делитель сетки оси X

# SetViewport.XAxisDivisor.Description
source: X axis divisor
ru: Делитель маркеров сетки оси X

# ADX.Name
source: ADX (Old)
ru: ADX (cтарый)

# BoolBreaker.Name
source: Boolean Breaker
ru: Логический разделитель

# BoolConst.Name
source: Boolean Constant
ru: Логическая константа

# OpenInterest.Name
source: Open Interest
ru: Открытый интерес

# OptVolatility.Name
source: Option Volatility
ru: Опционная волатильность

# TheoreticalPrice.Name
source: Theoretical price
ru: Теор. цена опциона

# ZeroLagTEMA.Name
source: TEMA (Zero Lag)
ru: TEMA (без задержки)

# AutoHedger.BuyShift.Name
source: Buy shift
ru: Сдвиг покупок

# AutoHedger.BuyShift.Description
source: Buy shift (price steps)
ru: Сдвиг покупок (шаги цены)

# AutoHedger.SellShift.Name
source: Sell shift
ru: Сдвиг продаж

# AutoHedger.SellShift.Description
source: Sell shift (price steps)
ru: Сдвиг продаж (шаги цены)

# TextHandler.Name
source: Text
ru: Текст

# AverageTrueRange.Name
source: ATR (Old)
ru: ATR

# BollingerBands1.Name
source: Bollinger Bands (+)
ru: Полоса Болинжера (+)

# BollingerBands2.Name
source: Bollinger Bands (-)
ru: Полоса Болинжера (-)

# CuttlerRSI.Name
source: Cutler's RSI
ru: RSI Катлера

# MACDEx.Name
source: MACD Ext
ru: MACD расшир.

# MACDSig.Name
source: MACD Signal
ru: MACD сигнал

# MedianPrice.Name
source: Median Price
ru: Медианная цена

# TypicalPrice.Name
source: Typical Price
ru: Типичная цена

# MomentumPct.Name
source: Momentum %
ru: Моментум %

# BidAskMarketPosition.Name
source: Buy/Sell cluster(view only)
ru: Кластер пок./прод.

# DeltaMarketPosition.Name
source: Delta cluster(view only)
ru: Дельта кластер

# AllTimeTradeStatisticsHandler.Name
source: All Time Trade Statistics
ru: Торговая статистика за всё время

# LastContractsTradeStatisticsHandler.Name
source: Last Contracts Trade Statistics
ru: Торговая статистика последних контрактов

# LastTradeStatisticsHandler.Name
source: Last Trade Statistics
ru: Последняя торговая статистика

# TradeStatisticsExtremumPriceHandler.Name
source: Trade Statistics Extremum Price
ru: Экстремальная цена торговой статистики

# TradeStatisticsExtendedExtremumPriceHandler.Name
source: Trade Statistics Extended Extremum Price 1
ru: Расширенная экстремальная цена торговой статистики 1

# TradeStatisticsExtendedExtremumPriceHandler2.Name
source: Trade Statistics Extended Extremum Price 2
ru: Расширенная экстремальная цена торговой статистики 2

# TradeStatisticsExtremumValueHandler.Name
source: Trade Statistics Extremum Value
ru: Экстремальное значение торговой статистики

# TradeStatisticsHandler.Name
source: Trade Statistics
ru: Торговая статистика

# TradeStatisticsLowerEdgeHandler.Name
source: Trade Statistics Lower Level
ru: Нижний уровень торговой статистики

# TradeStatisticsUpperEdgeHandler.Name
source: Trade Statistics Upper Level
ru: Верхний уровень торговой статистики

# TradeStatisticsBarsCountHandler.Name
source: Trade Statistics Strings Count
ru: Количество строк торговой статистики

# TradeStatisticsBarsSumHandler.Name
source: Trade Statistics Strings Sum
ru: Сумма строк торговой статистики

# TradeStatisticsExtendedBarsCountHandler.Name
source: Trade Statistics Extended Strings Count 1
ru: Расширенное количество строк торговой статистики 1

# TradeStatisticsExtendedBarsSumHandler.Name
source: Trade Statistics Extended Strings Sum 1
ru: Расширенная сумма строк торговой статистики 1

# TradeStatisticsExtendedBarsCountHandler2.Name
source: Trade Statistics Extended Strings Count 2
ru: Расширенное количество строк торговой статистики 2

# TradeStatisticsExtendedBarsSumHandler2.Name
source: Trade Statistics Extended Strings Sum 2
ru: Расширенная сумма строк торговой статистики 2

# TradeStatisticsPriceValueHandler.Name
source: Trade Statistics Price Value
ru: Значение цены торговой статистики

# VolumeForPeriodHandler.Name
source: Volume for period
ru: Объём за период

# AlignedSecurityHandler.Name
source: Aligned instrument
ru: Выровненный инструмент

# BuysHandler.Name
source: Buys
ru: Покупки

# SellsHandler.Name
source: Sells
ru: Продажи

# BuysMinusSellsHandler.Name
source: Buys Minus Sells
ru: Покупки минус продажи

# VolumeMarketPosition.Name
source: Volume cluster(view only)
ru: Кластер объёма

# MessageHandler.Name
source: Message
ru: Сообщение

source: Momentum
ru: Моментум

# IvOnF.RescaleTime.Name
source: Rescale Time
ru: Заменить время

# IvOnF.RescaleTime.Description
source: Rescale time-to-expiry to our internal?
ru: Заменять время на 'правильное'?

# IvOnF.DistanceMode.Name
source: Estimation Algo
ru: Алгоритм расчета

# IvOnF.DistanceMode.Description
source: Algorythm to estimate time-to-expiry
ru: Алгоритм расчета времени до экспирации

# IvOnF.ExpiryTime.Name
source: Expiry Time
ru: Время истечения

# IvOnF.ExpiryTime.Description
source: Exact expiration time of day (HH:mm)
ru: Точное время экспирации (ЧЧ:мм)

# IvOnF2.RescaleTime.Name
source: Rescale Time
ru: Заменить время

# IvOnF2.RescaleTime.Description
source: Rescale time-to-expiry to our internal?
ru: Заменять время на 'правильное'?

# IvOnF2.DistanceMode.Name
source: Estimation Algo
ru: Алгоритм расчета

# IvOnF2.DistanceMode.Description
source: Algorythm to estimate time-to-expiry
ru: Алгоритм расчета времени до экспирации

# IvOnF2.ExpiryTime.Name
source: Expiry Time
ru: Время истечения

# IvOnF2.ExpiryTime.Description
source: Exact expiration time of day (HH:mm)
ru: Точное время экспирации (ЧЧ:мм)

# TotalProfit.ProfitAlgo.Name
source: Profit algo
ru: Алгоритм расчета

# TotalProfit.ProfitAlgo.Description
source: Profit calculation algorytm
ru: Алгоритм расчета

# SelectStrike.Name
source: Select strike
ru: Выбор страйка

# SelectStrike.Description
source: Use drop-down control to select single strike from option series. To use it link 'Strike' property to Control pane.
ru: Выбрать из серии один страйк с помощью выпадающего списка. Для этого надо связать свойство 'Страйк' с Контрольной панелью и оформить его в виде выпадающего списка.

# SelectStrike.Strike.Name
source: Strike
ru: Страйк

# SelectStrike.Strike.Description
source: Option strike
ru: Страйк опциона

# BasePx.RepeatLastPx.Name
source: Repeat Last Px
ru: Повтор значения

# BasePx.RepeatLastPx.Description
source: Handler should repeat last known value to avoid further logic errors
ru: При true будет находить и использовать последнее известное значение

# SelectStrike.StrikeStep.Name
source: Strike step
ru: Шаг страйков

# SelectStrike.StrikeStep.Description
source: Strike step to extract most important options
ru: Шаг страйков для выделения главных подсерий

# BasePx2.RepeatLastPx.Name
source: Repeat Last Px
ru: Повтор значения

# BasePx2.RepeatLastPx.Description
source: Handler should repeat last known value to avoid further logic errors
ru: При true будет находить и использовать последнее известное значение

# ConstSmileLevel2.Name
source: Horizontal line
ru: Горизонтальная линия

# ConstSmileLevel2.Description
source: Horizontal line at smile chart. Position is defined by 'Value' parameter.
ru: Горизонтальная линия на графике улыбки. Положение задаётся параметром 'Уровень'.

# ConstSmileLevel2.ValuePct.Name
source: Value, %
ru: Уровень, %

# ConstSmileLevel2.ValuePct.Description
source: Value (percents)
ru: Уровень (в процентах)

# ConstSmileLevel2.ShowEdgeLabels.Name
source: Show edge labels
ru: Подписи на краях

# ConstSmileLevel2.ShowEdgeLabels.Description
source: Show edge labels
ru: Показывать подписи крайних узлов

# ConstSmileLevel2.SigmaPct.Name
source: Sigma, %
ru: Волатильность, %

# ConstSmileLevel2.SigmaPct.Description
source: Volatility (percents)
ru: Волатильность (в процентах)

# ConstSmileLevel2.Label.Name
source: Label
ru: Метка

# ConstSmileLevel2.Label.Description
source: Label to mark a nodes
ru: Метка для подписи узлов

# ConstSmileLevel2.SigmaMult.Name
source: Width multiplier
ru: Множитель ширины

# ConstSmileLevel2.SigmaMult.Description
source: Width multiplier
ru: Множитель ширины

# ConstSmileLevel2.ShowNodes.Name
source: Show nodes
ru: Показывать узлы
